var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 10;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1442225": {
        "进阶id": 1452207,
        "等级1": {
            "双攻": 4,
            "命中": 7,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级2": {
            "双攻": 8,
            "命中": 14,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    20
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级3": {
            "双攻": 12,
            "命中": 22,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    30
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155819
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级4": {
            "双攻": 16,
            "命中": 29,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    40
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级5": {
            "双攻": 20,
            "命中": 36,
            "材料": [
                [
                    4001084,
                    6
                ],
                [
                    4033104,
                    50
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                4500019,
                4500216,
                4500033
            ]
        },
        "等级6": {
            "双攻": 25,
            "命中": 43,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    60
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级7": {
            "双攻": 29,
            "命中": 50,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    70
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级8": {
            "双攻": 33,
            "命中": 57,
            "材料": [
                [
                    4001084,
                    6
                ],
                [
                    4033104,
                    80
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                4500019,
                4500216,
                4500033
            ]
        },
        "等级9": {
            "双攻": 37,
            "命中": 65,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    90
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155819
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级10": {
            "双攻": 41,
            "命中": 72,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    100
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        }
    },
    "1452207": {
        "进阶id": 1462195,
        "等级1": {
            "双攻": 45,
            "命中": 80,
            "材料": [
                [
                    4001085,
                    13
                ],
                [
                    4500202,
                    20
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                4500020,
                4500217,
                4500033
            ]
        },
        "等级2": {
            "双攻": 50,
            "命中": 87,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    30
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级3": {
            "双攻": 54,
            "命中": 95,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    40
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级4": {
            "双攻": 59,
            "命中": 103,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    50
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级5": {
            "双攻": 63,
            "命中": 111,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    60
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级6": {
            "双攻": 68,
            "命中": 118,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    60
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级7": {
            "双攻": 72,
            "命中": 126,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    70
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级8": {
            "双攻": 76,
            "命中": 134,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    80
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级9": {
            "双攻": 81,
            "命中": 142,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    90
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级10": {
            "双攻": 85,
            "命中": 149,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    100
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        }
    },
    "1462195": {
        "进阶id": 1402199,
        "等级1": {
            "双攻": 91,
            "命中": 159,
            "材料": [
                [
                    4500006,
                    16
                ],
                [
                    4500203,
                    30
                ],
                [
                    4000313,
                    103
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                4500021,
                4500218,
                4500033
            ]
        },
        "等级2": {
            "双攻": 96,
            "命中": 168,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    40
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级3": {
            "双攻": 101,
            "命中": 177,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    50
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级4": {
            "双攻": 106,
            "命中": 186,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    60
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级5": {
            "双攻": 112,
            "命中": 195,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    70
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级6": {
            "双攻": 117,
            "命中": 204,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    80
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级7": {
            "双攻": 122,
            "命中": 213,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    90
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级8": {
            "双攻": 127,
            "命中": 223,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    100
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级9": {
            "双攻": 132,
            "命中": 232,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    110
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级10": {
            "双攻": 138,
            "命中": 241,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    120
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        }
    },
    "1402199": {
        "进阶id": 1412137,
        "等级1": {
            "双攻": 145,
            "命中": 254,
            "材料": [
                [
                    4500007,
                    24
                ],
                [
                    4500204,
                    50
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                4500022,
                4500219,
                4500033
            ]
        },
        "等级2": {
            "双攻": 152,
            "命中": 267,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    60
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级3": {
            "双攻": 160,
            "命中": 279,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    80
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级4": {
            "双攻": 167,
            "命中": 292,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    100
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级5": {
            "双攻": 174,
            "命中": 305,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    110
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级6": {
            "双攻": 182,
            "命中": 318,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    120
                ],
                [
                    4000313,
                    160
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级7": {
            "双攻": 189,
            "命中": 331,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    130
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级8": {
            "双攻": 196,
            "命中": 344,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    140
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级9": {
            "双攻": 204,
            "命中": 357,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    150
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级10": {
            "双攻": 211,
            "命中": 370,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    160
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        }
    },
    "1412137": {
        "进阶id": 1482170,
        "等级1": {
            "双攻": 218,
            "命中": 382,
            "材料": [
                [
                    4500008,
                    24
                ],
                [
                    4500205,
                    50
                ],
                [
                    4000313,
                    168
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                4500023,
                4500220,
                4500033
            ]
        },
        "等级2": {
            "双攻": 225,
            "命中": 394,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    60
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级3": {
            "双攻": 232,
            "命中": 406,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    80
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级4": {
            "双攻": 239,
            "命中": 418,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    100
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级5": {
            "双攻": 246,
            "命中": 430,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    110
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级6": {
            "双攻": 252,
            "命中": 442,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    120
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级7": {
            "双攻": 259,
            "命中": 454,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    130
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级8": {
            "双攻": 266,
            "命中": 466,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    140
                ],
                [
                    4000313,
                    168
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级9": {
            "双攻": 273,
            "命中": 478,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    150
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级10": {
            "双攻": 280,
            "命中": 490,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    160
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        }
    },
    "1482170": {
        "进阶id": 1492181,
        "等级1": {
            "双攻": 288,
            "命中": 505,
            "材料": [
                [
                    4500009,
                    32
                ],
                [
                    4500206,
                    60
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                4500024,
                4500221,
                4500033
            ]
        },
        "等级2": {
            "双攻": 297,
            "命中": 520,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    80
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589736
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级3": {
            "双攻": 306,
            "命中": 535,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    100
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级4": {
            "双攻": 314,
            "命中": 550,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    120
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级5": {
            "双攻": 323,
            "命中": 565,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    140
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级6": {
            "双攻": 331,
            "命中": 580,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    160
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级7": {
            "双攻": 340,
            "命中": 595,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    180
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589736
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级8": {
            "双攻": 349,
            "命中": 610,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    200
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级9": {
            "双攻": 357,
            "命中": 625,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    220
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级10": {
            "双攻": 366,
            "命中": 640,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    240
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        }
    },
    "1492181": {
        "进阶id": 1432169,
        "等级1": {
            "双攻": 374,
            "命中": 654,
            "材料": [
                [
                    4500010,
                    32
                ],
                [
                    4500207,
                    60
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                4500025,
                4500222,
                4500033
            ]
        },
        "等级2": {
            "双攻": 382,
            "命中": 669,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    80
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级3": {
            "双攻": 390,
            "命中": 683,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    100
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级4": {
            "双攻": 398,
            "命中": 697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    120
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级5": {
            "双攻": 407,
            "命中": 711,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    140
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级6": {
            "双攻": 415,
            "命中": 726,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    160
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级7": {
            "双攻": 423,
            "命中": 740,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    180
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级8": {
            "双攻": 431,
            "命中": 754,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    200
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级9": {
            "双攻": 439,
            "命中": 768,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    220
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级10": {
            "双攻": 447,
            "命中": 783,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    240
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        }
    },
    "1432169": {
        "进阶id": 1332227,
        "等级1": {
            "双攻": 455,
            "命中": 796,
            "材料": [
                [
                    4500011,
                    32
                ],
                [
                    4500208,
                    60
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                4500026,
                4500223,
                4500033
            ]
        },
        "等级2": {
            "双攻": 463,
            "命中": 810,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    80
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级3": {
            "双攻": 470,
            "命中": 823,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    100
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级4": {
            "双攻": 478,
            "命中": 837,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    120
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级5": {
            "双攻": 486,
            "命中": 851,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    140
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级6": {
            "双攻": 494,
            "命中": 864,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    160
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级7": {
            "双攻": 502,
            "命中": 878,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    180
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级8": {
            "双攻": 509,
            "命中": 891,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    200
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级9": {
            "双攻": 517,
            "命中": 905,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    220
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级10": {
            "双攻": 525,
            "命中": 918,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    240
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        }
    },
    "1332227": {
        "进阶id": 1382211,
        "等级1": {
            "双攻": 534,
            "命中": 935,
            "材料": [
                [
                    4500012,
                    40
                ],
                [
                    4500209,
                    80
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                4500027,
                4500224,
                4500033
            ]
        },
        "等级2": {
            "双攻": 544,
            "命中": 951,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    110
                ],
                [
                    4000313,
                    343
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级3": {
            "双攻": 553,
            "命中": 967,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    140
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级4": {
            "双攻": 562,
            "命中": 984,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    160
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级5": {
            "双攻": 572,
            "命中": 1000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    180
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级6": {
            "双攻": 581,
            "命中": 1016,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    200
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级7": {
            "双攻": 590,
            "命中": 1033,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    220
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级8": {
            "双攻": 600,
            "命中": 1049,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    240
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级9": {
            "双攻": 609,
            "命中": 1066,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    260
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级10": {
            "双攻": 618,
            "命中": 1082,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    280
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        }
    },
    "1382211": {
        "进阶id": 1472216,
        "等级1": {
            "双攻": 627,
            "命中": 1098,
            "材料": [
                [
                    4500013,
                    40
                ],
                [
                    4500210,
                    80
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                4500028,
                4500225,
                4500033
            ]
        },
        "等级2": {
            "双攻": 636,
            "命中": 1113,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    110
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级3": {
            "双攻": 645,
            "命中": 1129,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    140
                ],
                [
                    4000313,
                    360
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级4": {
            "双攻": 654,
            "命中": 1145,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    160
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级5": {
            "双攻": 663,
            "命中": 1161,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    180
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级6": {
            "双攻": 672,
            "命中": 1177,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    200
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级7": {
            "双攻": 681,
            "命中": 1192,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    220
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级8": {
            "双攻": 690,
            "命中": 1208,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    240
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级9": {
            "双攻": 699,
            "命中": 1224,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    260
                ],
                [
                    4000313,
                    360
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级10": {
            "双攻": 709,
            "命中": 1240,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    280
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531168
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        }
    },
    "1472216": {
        "进阶id": 1322205,
        "等级1": {
            "双攻": 717,
            "命中": 1255,
            "材料": [
                [
                    4500014,
                    40
                ],
                [
                    4500211,
                    80
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                4500029,
                4500226,
                4500033
            ]
        },
        "等级2": {
            "双攻": 726,
            "命中": 1270,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    110
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级3": {
            "双攻": 735,
            "命中": 1286,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    140
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级4": {
            "双攻": 744,
            "命中": 1301,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    160
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级5": {
            "双攻": 752,
            "命中": 1317,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    180
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级6": {
            "双攻": 761,
            "命中": 1332,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    200
                ],
                [
                    4000313,
                    378
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级7": {
            "双攻": 770,
            "命中": 1347,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    220
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级8": {
            "双攻": 779,
            "命中": 1363,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    240
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级9": {
            "双攻": 788,
            "命中": 1378,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    260
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级10": {
            "双攻": 796,
            "命中": 1393,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    280
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        }
    },
    "1322205": {
        "进阶id": 1312155,
        "等级1": {
            "双攻": 807,
            "命中": 1411,
            "材料": [
                [
                    4500015,
                    48
                ],
                [
                    4500212,
                    100
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                4500030,
                4500227,
                4500033
            ]
        },
        "等级2": {
            "双攻": 817,
            "命中": 1429,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    130
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级3": {
            "双攻": 827,
            "命中": 1447,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    160
                ],
                [
                    4000313,
                    476
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级4": {
            "双攻": 837,
            "命中": 1465,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    190
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级5": {
            "双攻": 848,
            "命中": 1483,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    220
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级6": {
            "双攻": 858,
            "命中": 1502,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    250
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级7": {
            "双攻": 868,
            "命中": 1520,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    270
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级8": {
            "双攻": 879,
            "命中": 1538,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    290
                ],
                [
                    4000313,
                    476
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级9": {
            "双攻": 889,
            "命中": 1556,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    310
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级10": {
            "双攻": 899,
            "命中": 1574,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    330
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        }
    },
    "1312155": {
        "进阶id": 0,
        "等级1": {
            "双攻": 909,
            "命中": 1591,
            "材料": [
                [
                    4500016,
                    48
                ],
                [
                    4500213,
                    100
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                4500031,
                4500228,
                4500033
            ]
        },
        "等级2": {
            "双攻": 919,
            "命中": 1609,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    130
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级3": {
            "双攻": 929,
            "命中": 1627,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    160
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级4": {
            "双攻": 939,
            "命中": 1644,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    190
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级5": {
            "双攻": 950,
            "命中": 1662,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    220
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级6": {
            "双攻": 960,
            "命中": 1679,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    250
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级7": {
            "双攻": 970,
            "命中": 1697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    270
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级8": {
            "双攻": 980,
            "命中": 1715,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    290
                ],
                [
                    4000313,
                    498
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级9": {
            "双攻": 990,
            "命中": 1732,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    310
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级10": {
            "双攻": 1000,
            "命中": 1750,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    330
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        }
    }
}
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    强化物品ivid = itemaa.getInventoryId();
    当前星级 = parseInt((等级规划.indexOf("" + itemaa.getOwner() + "")));
    if (itemaa.getOwner() == null || itemaa.getOwner() == "") {
        当前星级 = 1;
    }

    if (当前星级 <= -1) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;

    }
    下一阶id = 强化物品;
    下一等级 = 等级规划[当前星级 + 1];
    if (当前星级 >= 最高等级) {
        下一阶id = 进阶数据[强化物品]["进阶id"];
        下一等级 = "等级1";
    }
    if (!下一等级 || !进阶数据[下一阶id][下一等级]) {
        cm.sendOk("该装备已到达上限，无法进阶。");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 等级规划[当前星级] + "#k#n 强化至 #b#e" + (下一阶id != 强化物品 ? "进阶" : 下一等级) + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[下一阶id][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[下一阶id][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["四维"] ? "[#r四维+" + 进阶数据[下一阶id][下一等级]["四维"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[下一阶id][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双防"] ? "[#r双防+" + 进阶数据[下一阶id][下一等级]["双防"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["速度"] ? "[#r速度+" + 进阶数据[下一阶id][下一等级]["速度"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[下一阶id][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["命中"] ? "[#r命中+" + 进阶数据[下一阶id][下一等级]["命中"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["回避"] ? "[#r回避+" + 进阶数据[下一阶id][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[下一阶id][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[下一阶id][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                if (需要物品id == 4033104 ||
                    需要物品id == 4500202 ||
                    需要物品id == 4500203 ||
                    需要物品id == 4500204 ||
                    需要物品id == 4500205 ||
                    需要物品id == 4500206 ||
                    需要物品id == 4500207 ||
                    需要物品id == 4500208 ||
                    需要物品id == 4500209 ||
                    需要物品id == 4500210 ||
                    需要物品id == 4500211 ||
                    需要物品id == 4500212 ||
                    需要物品id == 4500213) {
                    cm.dispose();
                    cm.openNpc(9130000, "武器材料礼包");
                    return;
                }
            }
        } else if (status == 2) {
            if (当前星级 >= 最高等级) {
                var itemab = cm.getInventory(1).getItem(1).copy();
                if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                    cm.sendOk("此装备无法进阶");
                    cm.dispose();
                    return;
                }
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (!cm.removeFromSlot(1, 1, 1, 强化物品ivid)) {
                    cm.sendOk("进阶异常，请重试！！");
                    cm.dispose();
                    return;
                }
                var equip = cm.getEquip(下一阶id);
                // equip.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // equip.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                equip.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                equip.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                // equip.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
                // equip.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
                // equip.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                equip.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                equip.setOwner(下一等级);
                cm.addFromDrop(equip, true);
                cm.dispose();
                return;

            } else {
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (cm.随机数(100) <= 成功率) {
                    var statup = new java.util.ArrayList();
                    var item = cm.getInventory(1).getItem(1).copy();
                    // item.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    // item.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    item.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    item.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    // item.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
                    // item.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
                    // item.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                    item.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                    item.setOwner(下一等级);
                    Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                    Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                    //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                    cm.sendNext("强化成功");
                    status = -1;

                } else {
                    cm.sendNext("强化失败");
                    status = -1;
                }
            }

        } else {
            //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
            cm.dispose();
        }
    }

    function deleteitem(新物品id, 新等级) {
        var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    return false;
                } else {
                    if (背包绑定物品数量 >= 需要物品数量) {
                        cm.gainItem(绑定物品id, -需要物品数量);
                    } else {
                        cm.gainItem(绑定物品id, -背包绑定物品数量);
                        cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                    }
                }
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    return false;
                }
                cm.gainMeso(-需要物品数量);

            }


        }
        return true;
    }
}
