var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 10;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1032040": {
        "进阶id": 1032035,
        "等级1": {
            "双攻": 2,
            "回避": 14,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级2": {
            "双攻": 3,
            "回避": 29,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    2
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 5,
            "回避": 43,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    3
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 7,
            "回避": 57,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    4
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 8,
            "回避": 72,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4441300,
                    5
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 10,
            "回避": 86,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577910
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 11,
            "回避": 100,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    7
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 13,
            "回避": 115,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 15,
            "回避": 129,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    9
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 16,
            "回避": 144,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032035": {
        "进阶id": 1032114,
        "等级1": {
            "双攻": 18,
            "回避": 159,
            "材料": [
                [
                    4001085,
                    19
                ],
                [
                    4441300,
                    2
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                4500020,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 20,
            "回避": 175,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    3
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 22,
            "回避": 190,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    4
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 23,
            "回避": 206,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    5
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 25,
            "回避": 221,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 27,
            "回避": 237,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 29,
            "回避": 252,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    7
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 31,
            "回避": 268,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    38
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 32,
            "回避": 283,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    9
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 34,
            "回避": 299,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032114": {
        "进阶id": 1032131,
        "等级1": {
            "双攻": 36,
            "回避": 317,
            "材料": [
                [
                    4500006,
                    24
                ],
                [
                    4441300,
                    3
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                4500021,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 38,
            "回避": 335,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    4
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 40,
            "回避": 354,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    5
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 43,
            "回避": 372,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 45,
            "回避": 390,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    7
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 47,
            "回避": 409,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    52
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 49,
            "回避": 427,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    9
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 51,
            "回避": 445,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 53,
            "回避": 463,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 55,
            "回避": 482,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032131": {
        "进阶id": 1032133,
        "等级1": {
            "双攻": 58,
            "回避": 507,
            "材料": [
                [
                    4500007,
                    36
                ],
                [
                    4441300,
                    5
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                4500022,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 61,
            "回避": 533,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 64,
            "回避": 559,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 67,
            "回避": 585,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 70,
            "回避": 610,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 73,
            "回避": 636,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 76,
            "回避": 662,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    13
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 79,
            "回避": 688,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 82,
            "回避": 713,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    15
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 84,
            "回避": 739,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032133": {
        "进阶id": 1032195,
        "等级1": {
            "双攻": 87,
            "回避": 763,
            "材料": [
                [
                    4500008,
                    36
                ],
                [
                    4441300,
                    5
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                4500023,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 90,
            "回避": 787,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 93,
            "回避": 811,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 95,
            "回避": 835,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 98,
            "回避": 859,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 101,
            "回避": 883,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 104,
            "回避": 907,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    13
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 106,
            "回避": 931,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 109,
            "回避": 955,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    15
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 112,
            "回避": 979,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032195": {
        "进阶id": 1032227,
        "等级1": {
            "双攻": 115,
            "回避": 1009,
            "材料": [
                [
                    4500009,
                    48
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                4500024,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 119,
            "回避": 1040,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 122,
            "回避": 1070,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 126,
            "回避": 1100,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 129,
            "回避": 1130,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 133,
            "回避": 1160,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 136,
            "回避": 1190,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 139,
            "回避": 1220,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 143,
            "回避": 1250,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 146,
            "回避": 1280,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032227": {
        "进阶id": 1032083,
        "等级1": {
            "双攻": 150,
            "回避": 1309,
            "材料": [
                [
                    4500010,
                    48
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                4500025,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 153,
            "回避": 1337,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 156,
            "回避": 1366,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 159,
            "回避": 1394,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 163,
            "回避": 1423,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 166,
            "回避": 1451,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 169,
            "回避": 1480,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 172,
            "回避": 1508,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 176,
            "回避": 1537,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 179,
            "回避": 1565,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032083": {
        "进阶id": 1032223,
        "等级1": {
            "双攻": 182,
            "回避": 1592,
            "材料": [
                [
                    4500011,
                    48
                ],
                [
                    4441300,
                    6
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                4500026,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 185,
            "回避": 1620,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 188,
            "回避": 1647,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 191,
            "回避": 1674,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    12
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 194,
            "回避": 1701,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 198,
            "回避": 1728,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 201,
            "回避": 1755,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 204,
            "回避": 1782,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 207,
            "回避": 1810,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 210,
            "回避": 1837,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032223": {
        "进阶id": 1032219,
        "等级1": {
            "双攻": 214,
            "回避": 1869,
            "材料": [
                [
                    4500012,
                    60
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                4500027,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 217,
            "回避": 1902,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 221,
            "回避": 1935,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 225,
            "回避": 1968,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 229,
            "回避": 2000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 232,
            "回避": 2033,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 236,
            "回避": 2066,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 240,
            "回避": 2098,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 244,
            "回避": 2131,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    26
                ],
                [
                    4000313,
                    172
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 247,
            "回避": 2164,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    28
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032219": {
        "进阶id": 1032268,
        "等级1": {
            "双攻": 251,
            "回避": 2195,
            "材料": [
                [
                    4500013,
                    60
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                4500028,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 255,
            "回避": 2227,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 258,
            "回避": 2258,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 262,
            "回避": 2290,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 265,
            "回避": 2322,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 269,
            "回避": 2353,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 273,
            "回避": 2385,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 276,
            "回避": 2416,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 280,
            "回避": 2448,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    26
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 283,
            "回避": 2479,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    28
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032268": {
        "进阶id": 1032316,
        "等级1": {
            "双攻": 287,
            "回避": 2510,
            "材料": [
                [
                    4500014,
                    60
                ],
                [
                    4441300,
                    8
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                4500029,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 290,
            "回避": 2541,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    11
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 294,
            "回避": 2572,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    14
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 297,
            "回避": 2602,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 301,
            "回避": 2633,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    18
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 304,
            "回避": 2664,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    20
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 308,
            "回避": 2695,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692141
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 311,
            "回避": 2725,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    24
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 315,
            "回避": 2756,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    26
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 319,
            "回避": 2787,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    28
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032316": {
        "进阶id": 1032201,
        "等级1": {
            "双攻": 323,
            "回避": 2823,
            "材料": [
                [
                    4500015,
                    72
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                4500030,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 327,
            "回避": 2859,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    13
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 331,
            "回避": 2895,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 335,
            "回避": 2931,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    19
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 339,
            "回避": 2967,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 343,
            "回避": 3003,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    25
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 347,
            "回避": 3039,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    27
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 351,
            "回避": 3075,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    29
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 356,
            "回避": 3111,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    31
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 360,
            "回避": 3147,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    33
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    },
    "1032201": {
        "进阶id": 0,
        "等级1": {
            "双攻": 364,
            "回避": 3182,
            "材料": [
                [
                    4500016,
                    72
                ],
                [
                    4441300,
                    10
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                4500031,
                4500516,
                4500033
            ]
        },
        "等级2": {
            "双攻": 368,
            "回避": 3218,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    13
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级3": {
            "双攻": 372,
            "回避": 3253,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    16
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级4": {
            "双攻": 376,
            "回避": 3288,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    19
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级5": {
            "双攻": 380,
            "回避": 3324,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    22
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级6": {
            "双攻": 384,
            "回避": 3359,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    25
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级7": {
            "双攻": 388,
            "回避": 3394,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    27
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级8": {
            "双攻": 392,
            "回避": 3429,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    29
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级9": {
            "双攻": 396,
            "回避": 3465,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    31
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        },
        "等级10": {
            "双攻": 400,
            "回避": 3500,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4441300,
                    33
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500516,
                4500033
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    强化物品ivid = itemaa.getInventoryId();
    当前星级 = parseInt((等级规划.indexOf("" + itemaa.getOwner() + "")));
    if (itemaa.getOwner() == null || itemaa.getOwner() == "") {
        当前星级 = 1;
    }

    if (当前星级 <= -1) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;

    }
    下一阶id = 强化物品;
    下一等级 = 等级规划[当前星级 + 1];
    if (当前星级 >= 最高等级) {
        下一阶id = 进阶数据[强化物品]["进阶id"];
        下一等级 = "等级1";
    }
    if (!下一等级 || !进阶数据[下一阶id][下一等级]) {
        cm.sendOk("该装备已到达上限，无法进阶。");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 等级规划[当前星级] + "#k#n 强化至 #b#e" + (下一阶id != 强化物品 ? "进阶" : 下一等级) + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[下一阶id][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[下一阶id][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["四维"] ? "[#r四维+" + 进阶数据[下一阶id][下一等级]["四维"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[下一阶id][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双防"] ? "[#r双防+" + 进阶数据[下一阶id][下一等级]["双防"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["速度"] ? "[#r速度+" + 进阶数据[下一阶id][下一等级]["速度"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[下一阶id][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["命中"] ? "[#r命中+" + 进阶数据[下一阶id][下一等级]["命中"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["回避"] ? "[#r回避+" + 进阶数据[下一阶id][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[下一阶id][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[下一阶id][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "测试黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "测试BOSS材料礼包");
                }
                if (需要物品id == 4441300 || 需要物品id == 4500516) {
                    cm.dispose();
                    cm.openNpc(9130000, "测试饰品材料礼包");
                    return;
                }
            }
        } else if (status == 2) {
            if (当前星级 >= 最高等级) {
                var itemab = cm.getInventory(1).getItem(1).copy();
                if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                    cm.sendOk("此装备无法进阶");
                    cm.dispose();
                    return;
                }
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (!cm.removeFromSlot(1, 1, 1, 强化物品ivid)) {
                    cm.sendOk("进阶异常，请重试！！");
                    cm.dispose();
                    return;
                }
                var equip = cm.getEquip(下一阶id);
                // equip.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // equip.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                equip.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                equip.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                equip.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                // equip.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                equip.setOwner(下一等级);
                cm.addFromDrop(equip, true);
                cm.dispose();
                return;

            } else {
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (cm.随机数(100) <= 成功率) {
                    var statup = new java.util.ArrayList();
                    var item = cm.getInventory(1).getItem(1).copy();
                    // item.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    // item.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    item.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    item.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    item.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                    // item.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                    item.setOwner(下一等级);
                    Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                    Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                    //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                    cm.sendNext("强化成功");
                    status = -1;

                } else {
                    cm.sendNext("强化失败");
                    status = -1;
                }
            }

        } else {
            //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
            cm.dispose();
        }
    }

    function deleteitem(新物品id, 新等级) {
        var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    return false;
                } else {
                    if (背包绑定物品数量 >= 需要物品数量) {
                        cm.gainItem(绑定物品id, -需要物品数量);
                    } else {
                        cm.gainItem(绑定物品id, -背包绑定物品数量);
                        cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                    }
                }
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    return false;
                }
                cm.gainMeso(-需要物品数量);
            }
        }
        return true;
    }
}
