var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 10;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1050287": {
        "进阶id": 1050018,
        "等级1": {
            "四维": 8,
            "防/魔防": 8,
            "材料": [
                [
                    4001084,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                null
            ]
        },
        "等级2": {
            "四维": 16,
            "防/魔防": 16,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    20
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级3": {
            "四维": 25,
            "防/魔防": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    30
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155819
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级4": {
            "四维": 33,
            "防/魔防": 33,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    40
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级5": {
            "四维": 41,
            "防/魔防": 41,
            "材料": [
                [
                    4001084,
                    6
                ],
                [
                    4033232,
                    50
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                4500019,
                4500116,
                4500033
            ]
        },
        "等级6": {
            "四维": 49,
            "防/魔防": 49,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    60
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级7": {
            "四维": 57,
            "防/魔防": 57,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    70
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级8": {
            "四维": 66,
            "防/魔防": 66,
            "材料": [
                [
                    4001084,
                    6
                ],
                [
                    4033232,
                    80
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                4500019,
                4500116,
                4500033
            ]
        },
        "等级9": {
            "四维": 74,
            "防/魔防": 74,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    90
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155819
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        },
        "等级10": {
            "四维": 82,
            "防/魔防": 82,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033232,
                    100
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500116,
                4500033
            ]
        }
    },
    "1050018": {
        "进阶id": 1052357,
        "等级1": {
            "四维": 91,
            "防/魔防": 91,
            "材料": [
                [
                    4001085,
                    13
                ],
                [
                    4500102,
                    20
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                4500020,
                4500117,
                4500033
            ]
        },
        "等级2": {
            "四维": 100,
            "防/魔防": 100,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    30
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级3": {
            "四维": 109,
            "防/魔防": 109,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    40
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级4": {
            "四维": 117,
            "防/魔防": 117,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    50
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级5": {
            "四维": 126,
            "防/魔防": 126,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    60
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级6": {
            "四维": 135,
            "防/魔防": 135,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    60
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级7": {
            "四维": 144,
            "防/魔防": 144,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    70
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级8": {
            "四维": 153,
            "防/魔防": 153,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    80
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级9": {
            "四维": 162,
            "防/魔防": 162,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    90
                ],
                [
                    4000313,
                    78
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        },
        "等级10": {
            "四维": 171,
            "防/魔防": 171,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500102,
                    100
                ],
                [
                    4000313,
                    77
                ],
                [
                    0,
                    4259200
                ]
            ],
            "绑定材料": [
                null,
                4500117,
                4500033
            ]
        }
    },
    "1052357": {
        "进阶id": 1052457,
        "等级1": {
            "四维": 181,
            "防/魔防": 181,
            "材料": [
                [
                    4500006,
                    16
                ],
                [
                    4500103,
                    30
                ],
                [
                    4000313,
                    103
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                4500021,
                4500118,
                4500033
            ]
        },
        "等级2": {
            "四维": 192,
            "防/魔防": 192,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    40
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级3": {
            "四维": 202,
            "防/魔防": 202,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    50
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级4": {
            "四维": 213,
            "防/魔防": 213,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    60
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级5": {
            "四维": 223,
            "防/魔防": 223,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    70
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级6": {
            "四维": 233,
            "防/魔防": 233,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    80
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级7": {
            "四维": 244,
            "防/魔防": 244,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    90
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级8": {
            "四维": 254,
            "防/魔防": 254,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    100
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级9": {
            "四维": 265,
            "防/魔防": 265,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    110
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        },
        "等级10": {
            "四维": 275,
            "防/魔防": 275,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500103,
                    120
                ],
                [
                    4000313,
                    102
                ],
                [
                    0,
                    5856400
                ]
            ],
            "绑定材料": [
                null,
                4500118,
                4500033
            ]
        }
    },
    "1052457": {
        "进阶id": 1052467,
        "等级1": {
            "四维": 290,
            "防/魔防": 290,
            "材料": [
                [
                    4500007,
                    24
                ],
                [
                    4500104,
                    50
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                4500022,
                4500119,
                4500033
            ]
        },
        "等级2": {
            "四维": 305,
            "防/魔防": 305,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    60
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级3": {
            "四维": 319,
            "防/魔防": 319,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    80
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级4": {
            "四维": 334,
            "防/魔防": 334,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    100
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级5": {
            "四维": 349,
            "防/魔防": 349,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    110
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级6": {
            "四维": 363,
            "防/魔防": 364,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    120
                ],
                [
                    4000313,
                    160
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级7": {
            "四维": 378,
            "防/魔防": 378,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    130
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级8": {
            "四维": 393,
            "防/魔防": 393,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    140
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级9": {
            "四维": 408,
            "防/魔防": 408,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    150
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        },
        "等级10": {
            "四维": 422,
            "防/魔防": 422,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500104,
                    160
                ],
                [
                    4000313,
                    161
                ],
                [
                    0,
                    9663060
                ]
            ],
            "绑定材料": [
                null,
                4500119,
                4500033
            ]
        }
    },
    "1052467": {
        "进阶id": 1052612,
        "等级1": {
            "四维": 436,
            "防/魔防": 436,
            "材料": [
                [
                    4500008,
                    24
                ],
                [
                    4500105,
                    50
                ],
                [
                    4000313,
                    168
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                4500023,
                4500120,
                4500033
            ]
        },
        "等级2": {
            "四维": 450,
            "防/魔防": 450,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    60
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级3": {
            "四维": 463,
            "防/魔防": 464,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    80
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级4": {
            "四维": 477,
            "防/魔防": 477,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    100
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级5": {
            "四维": 491,
            "防/魔防": 491,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    110
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级6": {
            "四维": 505,
            "防/魔防": 505,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    120
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级7": {
            "四维": 518,
            "防/魔防": 518,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    130
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级8": {
            "四维": 532,
            "防/魔防": 532,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    140
                ],
                [
                    4000313,
                    168
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级9": {
            "四维": 546,
            "防/魔防": 546,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    150
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        },
        "等级10": {
            "四维": 560,
            "防/魔防": 560,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500105,
                    160
                ],
                [
                    4000313,
                    169
                ],
                [
                    0,
                    10629366
                ]
            ],
            "绑定材料": [
                null,
                4500120,
                4500033
            ]
        }
    },
    "1052612": {
        "进阶id": 1052487,
        "等级1": {
            "四维": 577,
            "防/魔防": 577,
            "材料": [
                [
                    4500009,
                    32
                ],
                [
                    4500106,
                    60
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                4500024,
                4500121,
                4500033
            ]
        },
        "等级2": {
            "四维": 594,
            "防/魔防": 594,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    80
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589736
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级3": {
            "四维": 611,
            "防/魔防": 611,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    100
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级4": {
            "四维": 628,
            "防/魔防": 629,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    120
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级5": {
            "四维": 646,
            "防/魔防": 646,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    140
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级6": {
            "四维": 663,
            "防/魔防": 663,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    160
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级7": {
            "四维": 680,
            "防/魔防": 680,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    180
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589736
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级8": {
            "四维": 697,
            "防/魔防": 697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    200
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级9": {
            "四维": 715,
            "防/魔防": 715,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    220
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        },
        "等级10": {
            "四维": 732,
            "防/魔防": 732,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500106,
                    240
                ],
                [
                    4000313,
                    236
                ],
                [
                    0,
                    15589737
                ]
            ],
            "绑定材料": [
                null,
                4500121,
                4500033
            ]
        }
    },
    "1052487": {
        "进阶id": 1052460,
        "等级1": {
            "四维": 748,
            "防/魔防": 748,
            "材料": [
                [
                    4500010,
                    32
                ],
                [
                    4500107,
                    60
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                4500025,
                4500122,
                4500033
            ]
        },
        "等级2": {
            "四维": 764,
            "防/魔防": 764,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    80
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级3": {
            "四维": 781,
            "防/魔防": 780,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    100
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级4": {
            "四维": 797,
            "防/魔防": 797,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    120
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级5": {
            "四维": 813,
            "防/魔防": 813,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    140
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级6": {
            "四维": 829,
            "防/魔防": 829,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    160
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级7": {
            "四维": 846,
            "防/魔防": 846,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    180
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级8": {
            "四维": 862,
            "防/魔防": 862,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    200
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级9": {
            "四维": 878,
            "防/魔防": 878,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    220
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148710
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        },
        "等级10": {
            "四维": 894,
            "防/魔防": 894,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500107,
                    240
                ],
                [
                    4000313,
                    248
                ],
                [
                    0,
                    17148711
                ]
            ],
            "绑定材料": [
                null,
                4500122,
                4500033
            ]
        }
    },
    "1052460": {
        "进阶id": 1052929,
        "等级1": {
            "四维": 910,
            "防/魔防": 910,
            "材料": [
                [
                    4500011,
                    32
                ],
                [
                    4500108,
                    60
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                4500026,
                4500123,
                4500033
            ]
        },
        "等级2": {
            "四维": 925,
            "防/魔防": 925,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    80
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级3": {
            "四维": 941,
            "防/魔防": 941,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    100
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级4": {
            "四维": 957,
            "防/魔防": 957,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    120
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级5": {
            "四维": 972,
            "防/魔防": 972,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    140
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级6": {
            "四维": 988,
            "防/魔防": 988,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    160
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级7": {
            "四维": 1003,
            "防/魔防": 1003,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    180
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级8": {
            "四维": 1019,
            "防/魔防": 1019,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    200
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级9": {
            "四维": 1034,
            "防/魔防": 1034,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    220
                ],
                [
                    4000313,
                    261
                ],
                [
                    0,
                    18863581
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        },
        "等级10": {
            "四维": 1050,
            "防/魔防": 1050,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500108,
                    240
                ],
                [
                    4000313,
                    260
                ],
                [
                    0,
                    18863582
                ]
            ],
            "绑定材料": [
                null,
                4500123,
                4500033
            ]
        }
    },
    "1052929": {
        "进阶id": 1052804,
        "等级1": {
            "四维": 1068,
            "防/魔防": 1068,
            "材料": [
                [
                    4500012,
                    40
                ],
                [
                    4500109,
                    80
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                4500027,
                4500124,
                4500033
            ]
        },
        "等级2": {
            "四维": 1087,
            "防/魔防": 1087,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    110
                ],
                [
                    4000313,
                    343
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级3": {
            "四维": 1106,
            "防/魔防": 1106,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    140
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级4": {
            "四维": 1125,
            "防/魔防": 1125,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    160
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级5": {
            "四维": 1143,
            "防/魔防": 1143,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    180
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级6": {
            "四维": 1162,
            "防/魔防": 1162,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    200
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级7": {
            "四维": 1181,
            "防/魔防": 1181,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    220
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级8": {
            "四维": 1199,
            "防/魔防": 1199,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    240
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级9": {
            "四维": 1218,
            "防/魔防": 1218,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    260
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937424
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        },
        "等级10": {
            "四维": 1237,
            "防/魔防": 1237,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500109,
                    280
                ],
                [
                    4000313,
                    342
                ],
                [
                    0,
                    25937425
                ]
            ],
            "绑定材料": [
                null,
                4500124,
                4500033
            ]
        }
    },
    "1052804": {
        "进阶id": 1052890,
        "等级1": {
            "四维": 1255,
            "防/魔防": 1255,
            "材料": [
                [
                    4500013,
                    40
                ],
                [
                    4500110,
                    80
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                4500028,
                4500125,
                4500033
            ]
        },
        "等级2": {
            "四维": 1273,
            "防/魔防": 1273,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    110
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级3": {
            "四维": 1291,
            "防/魔防": 1291,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    140
                ],
                [
                    4000313,
                    360
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级4": {
            "四维": 1309,
            "防/魔防": 1309,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    160
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级5": {
            "四维": 1327,
            "防/魔防": 1327,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    180
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级6": {
            "四维": 1345,
            "防/魔防": 1345,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    200
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级7": {
            "四维": 1363,
            "防/魔防": 1363,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    220
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级8": {
            "四维": 1381,
            "防/魔防": 1381,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    240
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级9": {
            "四维": 1399,
            "防/魔防": 1399,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    260
                ],
                [
                    4000313,
                    360
                ],
                [
                    0,
                    28531167
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        },
        "等级10": {
            "四维": 1417,
            "防/魔防": 1417,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500110,
                    280
                ],
                [
                    4000313,
                    359
                ],
                [
                    0,
                    28531168
                ]
            ],
            "绑定材料": [
                null,
                4500125,
                4500033
            ]
        }
    },
    "1052890": {
        "进阶id": 1053737,
        "等级1": {
            "四维": 1435,
            "防/魔防": 1435,
            "材料": [
                [
                    4500014,
                    40
                ],
                [
                    4500111,
                    80
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                4500029,
                4500126,
                4500033
            ]
        },
        "等级2": {
            "四维": 1452,
            "防/魔防": 1452,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    110
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级3": {
            "四维": 1470,
            "防/魔防": 1470,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    140
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级4": {
            "四维": 1487,
            "防/魔防": 1487,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    160
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级5": {
            "四维": 1505,
            "防/魔防": 1505,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    180
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级6": {
            "四维": 1522,
            "防/魔防": 1522,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    200
                ],
                [
                    4000313,
                    378
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级7": {
            "四维": 1540,
            "防/魔防": 1540,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    220
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级8": {
            "四维": 1557,
            "防/魔防": 1557,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    240
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级9": {
            "四维": 1575,
            "防/魔防": 1575,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    260
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384283
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        },
        "等级10": {
            "四维": 1593,
            "防/魔防": 1593,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500111,
                    280
                ],
                [
                    4000313,
                    377
                ],
                [
                    0,
                    31384284
                ]
            ],
            "绑定材料": [
                null,
                4500126,
                4500033
            ]
        }
    },
    "1053737": {
        "进阶id": 1053064,
        "等级1": {
            "四维": 1613,
            "防/魔防": 1613,
            "材料": [
                [
                    4500015,
                    48
                ],
                [
                    4500112,
                    100
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                4500030,
                4500127,
                4500033
            ]
        },
        "等级2": {
            "四维": 1634,
            "防/魔防": 1634,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    130
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级3": {
            "四维": 1654,
            "防/魔防": 1654,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    160
                ],
                [
                    4000313,
                    476
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级4": {
            "四维": 1675,
            "防/魔防": 1675,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    190
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级5": {
            "四维": 1696,
            "防/魔防": 1695,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    220
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级6": {
            "四维": 1716,
            "防/魔防": 1716,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    250
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级7": {
            "四维": 1737,
            "防/魔防": 1737,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    270
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级8": {
            "四维": 1757,
            "防/魔防": 1757,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    290
                ],
                [
                    4000313,
                    476
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级9": {
            "四维": 1778,
            "防/魔防": 1778,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    310
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427254
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        },
        "等级10": {
            "四维": 1798,
            "防/魔防": 1798,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500112,
                    330
                ],
                [
                    4000313,
                    475
                ],
                [
                    0,
                    41427255
                ]
            ],
            "绑定材料": [
                null,
                4500127,
                4500033
            ]
        }
    },
    "1053064": {
        "进阶id": 0,
        "等级1": {
            "四维": 1819,
            "防/魔防": 1818,
            "材料": [
                [
                    4500016,
                    48
                ],
                [
                    4500113,
                    100
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                4500031,
                4500128,
                4500033
            ]
        },
        "等级2": {
            "四维": 1839,
            "防/魔防": 1839,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    130
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级3": {
            "四维": 1859,
            "防/魔防": 1859,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    160
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级4": {
            "四维": 1879,
            "防/魔防": 1879,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    190
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级5": {
            "四维": 1899,
            "防/魔防": 1899,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    220
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级6": {
            "四维": 1919,
            "防/魔防": 1919,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    250
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级7": {
            "四维": 1940,
            "防/魔防": 1939,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    270
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级8": {
            "四维": 1960,
            "防/魔防": 1960,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    290
                ],
                [
                    4000313,
                    498
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级9": {
            "四维": 1980,
            "防/魔防": 1980,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    310
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        },
        "等级10": {
            "四维": 2000,
            "防/魔防": 2000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500113,
                    330
                ],
                [
                    4000313,
                    499
                ],
                [
                    0,
                    45569980
                ]
            ],
            "绑定材料": [
                null,
                4500128,
                4500033
            ]
        }
    }
}
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    强化物品ivid = itemaa.getInventoryId();
    当前星级 = parseInt((等级规划.indexOf("" + itemaa.getOwner() + "")));
    if (itemaa.getOwner() == null || itemaa.getOwner() == "") {
        当前星级 = 1;
    }

    if (当前星级 <= -1) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;

    }
    下一阶id = 强化物品;
    下一等级 = 等级规划[当前星级 + 1];
    if (当前星级 >= 最高等级) {
        下一阶id = 进阶数据[强化物品]["进阶id"];
        下一等级 = "等级1";
    }
    if (!下一等级 || !进阶数据[下一阶id][下一等级]) {
        cm.sendOk("该装备已到达上限，无法进阶。");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 等级规划[当前星级] + "#k#n 强化至 #b#e" + (下一阶id != 强化物品 ? "进阶" : 下一等级) + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[下一阶id][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[下一阶id][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["四维"] ? "[#r四维+" + 进阶数据[下一阶id][下一等级]["四维"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[下一阶id][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双防"] ? "[#r双防+" + 进阶数据[下一阶id][下一等级]["双防"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["速度"] ? "[#r速度+" + 进阶数据[下一阶id][下一等级]["速度"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[下一阶id][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["命中"] ? "[#r命中+" + 进阶数据[下一阶id][下一等级]["命中"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["回避"] ? "[#r回避+" + 进阶数据[下一阶id][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[下一阶id][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[下一阶id][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                if (需要物品id == 4033232 ||
                    需要物品id == 4500102 ||
                    需要物品id == 4500103 ||
                    需要物品id == 4500104 ||
                    需要物品id == 4500105 ||
                    需要物品id == 4500106 ||
                    需要物品id == 4500107 ||
                    需要物品id == 4500108 ||
                    需要物品id == 4500109 ||
                    需要物品id == 4500110 ||
                    需要物品id == 4500111 ||
                    需要物品id == 4500112 ||
                    需要物品id == 4500113) {
                    cm.dispose();
                    cm.openNpc(9130000, "衣服材料礼包");
                    return;
                }
            }
        } else if (status == 2) {
            if (当前星级 >= 最高等级) {
                var itemab = cm.getInventory(1).getItem(1).copy();
                if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                    cm.sendOk("此装备无法进阶");
                    cm.dispose();
                    return;
                }
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (!cm.removeFromSlot(1, 1, 1, 强化物品ivid)) {
                    cm.sendOk("进阶异常，请重试！！");
                    cm.dispose();
                    return;
                }
                var equip = cm.getEquip(下一阶id);
                equip.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                equip.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                equip.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                equip.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                // equip.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // equip.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // equip.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                // equip.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                equip.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
                equip.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
                // equip.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                // equip.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                equip.setOwner(下一等级);
                cm.addFromDrop(equip, true);
                cm.dispose();
                return;

            } else {
                if (!deleteitem(下一阶id, 下一等级)) {
                    cm.sendOk("材料不足");
                    cm.dispose();
                    return;
                }
                if (cm.随机数(100) <= 成功率) {
                    var statup = new java.util.ArrayList();
                    var item = cm.getInventory(1).getItem(1).copy();
                    item.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                    item.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                    item.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                    item.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                    // item.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    // item.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                    // item.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    // item.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                    item.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
                    item.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
                    // item.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                    // item.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                    item.setOwner(下一等级);
                    Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                    Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                    //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                    cm.sendNext("强化成功");
                    status = -1;

                } else {
                    cm.sendNext("强化失败");
                    status = -1;
                }
            }

        } else {
            //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
            cm.dispose();
        }
    }

    function deleteitem(新物品id, 新等级) {
        var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    return false;
                } else {
                    if (背包绑定物品数量 >= 需要物品数量) {
                        cm.gainItem(绑定物品id, -需要物品数量);
                    } else {
                        cm.gainItem(绑定物品id, -背包绑定物品数量);
                        cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                    }
                }
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    return false;
                }
                cm.gainMeso(-需要物品数量);

            }


        }
        return true;
    }
}
