var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 10;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1122007": {
        "进阶id": 1122012,
        "等级1": {
            "四维": 4,
            "双防": 4,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级2": {
            "四维": 8,
            "双防": 8,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    2
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    3155818
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级3": {
            "四维": 12,
            "双防": 12,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    3
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    4733727
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级4": {
            "四维": 16,
            "双防": 16,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    4
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    6311636
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级5": {
            "四维": 21,
            "双防": 20,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    4440300,
                    5
                ],
                [
                    4000313,
                    156
                ],
                [
                    0,
                    7889545
                ]
            ],
            "绑定材料": [
                4500019,
                4500716,
                4500033
            ]
        },
        "等级6": {
            "四维": 25,
            "双防": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    6
                ],
                [
                    4000313,
                    187
                ],
                [
                    0,
                    9467455
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级7": {
            "四维": 29,
            "双防": 29,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    7
                ],
                [
                    4000313,
                    219
                ],
                [
                    0,
                    11045364
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级8": {
            "四维": 33,
            "双防": 33,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    4440300,
                    8
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    12623273
                ]
            ],
            "绑定材料": [
                4500019,
                4500716,
                4500033
            ]
        },
        "等级9": {
            "四维": 37,
            "双防": 37,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    9
                ],
                [
                    4000313,
                    281
                ],
                [
                    0,
                    14201182
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        },
        "等级10": {
            "四维": 41,
            "双防": 41,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4440300,
                    10
                ],
                [
                    4000313,
                    312
                ],
                [
                    0,
                    15779091
                ]
            ],
            "绑定材料": [
                null,
                4500716,
                4500033
            ]
        }
    },
    "1122012": {
        "进阶id": 1122010,
        "等级1": {
            "四维": 45,
            "双防": 45,
            "材料": [
                [
                    4001085,
                    6
                ],
                [
                    4500702,
                    2
                ],
                [
                    4000313,
                    351
                ],
                [
                    0,
                    17908691
                ]
            ],
            "绑定材料": [
                4500020,
                4500717,
                4500033
            ]
        },
        "等级2": {
            "四维": 50,
            "双防": 50,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    3
                ],
                [
                    4000313,
                    390
                ],
                [
                    0,
                    20038291
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级3": {
            "四维": 54,
            "双防": 54,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    4
                ],
                [
                    4000313,
                    429
                ],
                [
                    0,
                    22167891
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级4": {
            "四维": 59,
            "双防": 59,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    5
                ],
                [
                    4000313,
                    468
                ],
                [
                    0,
                    24297491
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级5": {
            "四维": 63,
            "双防": 63,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    6
                ],
                [
                    4000313,
                    507
                ],
                [
                    0,
                    26427091
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级6": {
            "四维": 68,
            "双防": 68,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    6
                ],
                [
                    4000313,
                    546
                ],
                [
                    0,
                    28556691
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级7": {
            "四维": 72,
            "双防": 72,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    7
                ],
                [
                    4000313,
                    585
                ],
                [
                    0,
                    30686291
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级8": {
            "四维": 76,
            "双防": 76,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    8
                ],
                [
                    4000313,
                    623
                ],
                [
                    0,
                    32815891
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级9": {
            "四维": 81,
            "双防": 81,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    9
                ],
                [
                    4000313,
                    662
                ],
                [
                    0,
                    34945491
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        },
        "等级10": {
            "四维": 85,
            "双防": 85,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500702,
                    10
                ],
                [
                    4000313,
                    701
                ],
                [
                    0,
                    37075091
                ]
            ],
            "绑定材料": [
                null,
                4500717,
                4500033
            ]
        }
    },
    "1122010": {
        "进阶id": 1122015,
        "等级1": {
            "四维": 91,
            "双防": 91,
            "材料": [
                [
                    4500006,
                    8
                ],
                [
                    4500703,
                    3
                ],
                [
                    4000313,
                    752
                ],
                [
                    0,
                    40003291
                ]
            ],
            "绑定材料": [
                4500021,
                4500718,
                4500033
            ]
        },
        "等级2": {
            "四维": 96,
            "双防": 96,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    4
                ],
                [
                    4000313,
                    803
                ],
                [
                    0,
                    42931491
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级3": {
            "四维": 101,
            "双防": 101,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    5
                ],
                [
                    4000313,
                    854
                ],
                [
                    0,
                    45859691
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级4": {
            "四维": 106,
            "双防": 106,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    6
                ],
                [
                    4000313,
                    905
                ],
                [
                    0,
                    48787891
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级5": {
            "四维": 112,
            "双防": 112,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    7
                ],
                [
                    4000313,
                    956
                ],
                [
                    0,
                    51716091
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级6": {
            "四维": 117,
            "双防": 117,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    8
                ],
                [
                    4000313,
                    1008
                ],
                [
                    0,
                    54644291
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级7": {
            "四维": 122,
            "双防": 122,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    9
                ],
                [
                    4000313,
                    1059
                ],
                [
                    0,
                    57572491
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级8": {
            "四维": 127,
            "双防": 127,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    10
                ],
                [
                    4000313,
                    1110
                ],
                [
                    0,
                    60500691
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级9": {
            "四维": 132,
            "双防": 132,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    11
                ],
                [
                    4000313,
                    1161
                ],
                [
                    0,
                    63428891
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        },
        "等级10": {
            "四维": 138,
            "双防": 138,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500703,
                    12
                ],
                [
                    4000313,
                    1212
                ],
                [
                    0,
                    66357091
                ]
            ],
            "绑定材料": [
                null,
                4500718,
                4500033
            ]
        }
    },
    "1122015": {
        "进阶id": 1122073,
        "等级1": {
            "四维": 145,
            "双防": 145,
            "材料": [
                [
                    4500007,
                    12
                ],
                [
                    4500704,
                    5
                ],
                [
                    4000313,
                    1292
                ],
                [
                    0,
                    71188621
                ]
            ],
            "绑定材料": [
                4500022,
                4500719,
                4500033
            ]
        },
        "等级2": {
            "四维": 152,
            "双防": 152,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    6
                ],
                [
                    4000313,
                    1373
                ],
                [
                    0,
                    76020151
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级3": {
            "四维": 160,
            "双防": 160,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    8
                ],
                [
                    4000313,
                    1453
                ],
                [
                    0,
                    80851681
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级4": {
            "四维": 167,
            "双防": 167,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    10
                ],
                [
                    4000313,
                    1533
                ],
                [
                    0,
                    85683211
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级5": {
            "四维": 174,
            "双防": 174,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    11
                ],
                [
                    4000313,
                    1614
                ],
                [
                    0,
                    90514741
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级6": {
            "四维": 182,
            "双防": 182,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    12
                ],
                [
                    4000313,
                    1694
                ],
                [
                    0,
                    95346271
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级7": {
            "四维": 189,
            "双防": 189,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    13
                ],
                [
                    4000313,
                    1775
                ],
                [
                    0,
                    100177801
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级8": {
            "四维": 196,
            "双防": 196,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    14
                ],
                [
                    4000313,
                    1855
                ],
                [
                    0,
                    105009331
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级9": {
            "四维": 204,
            "双防": 204,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    15
                ],
                [
                    4000313,
                    1935
                ],
                [
                    0,
                    109840861
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        },
        "等级10": {
            "四维": 211,
            "双防": 211,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500704,
                    16
                ],
                [
                    4000313,
                    2016
                ],
                [
                    0,
                    114672391
                ]
            ],
            "绑定材料": [
                null,
                4500719,
                4500033
            ]
        }
    },
    "1122073": {
        "进阶id": 1122074,
        "等级1": {
            "四维": 218,
            "双防": 218,
            "材料": [
                [
                    4500008,
                    12
                ],
                [
                    4500705,
                    5
                ],
                [
                    4000313,
                    2100
                ],
                [
                    0,
                    119987074
                ]
            ],
            "绑定材料": [
                4500023,
                4500720,
                4500033
            ]
        },
        "等级2": {
            "四维": 225,
            "双防": 225,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    6
                ],
                [
                    4000313,
                    2185
                ],
                [
                    0,
                    125301757
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级3": {
            "四维": 232,
            "双防": 232,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    8
                ],
                [
                    4000313,
                    2269
                ],
                [
                    0,
                    130616440
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级4": {
            "四维": 239,
            "双防": 239,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    10
                ],
                [
                    4000313,
                    2354
                ],
                [
                    0,
                    135931123
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级5": {
            "四维": 245,
            "双防": 246,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    11
                ],
                [
                    4000313,
                    2438
                ],
                [
                    0,
                    141245806
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级6": {
            "四维": 252,
            "双防": 252,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    12
                ],
                [
                    4000313,
                    2522
                ],
                [
                    0,
                    146560489
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级7": {
            "四维": 259,
            "双防": 259,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    13
                ],
                [
                    4000313,
                    2607
                ],
                [
                    0,
                    151875172
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级8": {
            "四维": 266,
            "双防": 266,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    14
                ],
                [
                    4000313,
                    2691
                ],
                [
                    0,
                    157189855
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级9": {
            "四维": 273,
            "双防": 273,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    15
                ],
                [
                    4000313,
                    2776
                ],
                [
                    0,
                    162504538
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        },
        "等级10": {
            "四维": 280,
            "双防": 280,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500705,
                    16
                ],
                [
                    4000313,
                    2860
                ],
                [
                    0,
                    167819221
                ]
            ],
            "绑定材料": [
                null,
                4500720,
                4500033
            ]
        }
    },
    "1122074": {
        "进阶id": 1122109,
        "等级1": {
            "四维": 288,
            "双防": 288,
            "材料": [
                [
                    4500009,
                    16
                ],
                [
                    4500706,
                    6
                ],
                [
                    4000313,
                    2978
                ],
                [
                    0,
                    175614089
                ]
            ],
            "绑定材料": [
                4500024,
                4500721,
                4500033
            ]
        },
        "等级2": {
            "四维": 297,
            "双防": 297,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    8
                ],
                [
                    4000313,
                    3096
                ],
                [
                    0,
                    183408958
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级3": {
            "四维": 306,
            "双防": 306,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    10
                ],
                [
                    4000313,
                    3215
                ],
                [
                    0,
                    191203826
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级4": {
            "四维": 314,
            "双防": 314,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    12
                ],
                [
                    4000313,
                    3333
                ],
                [
                    0,
                    198998695
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级5": {
            "四维": 323,
            "双防": 323,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    14
                ],
                [
                    4000313,
                    3451
                ],
                [
                    0,
                    206793563
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级6": {
            "四维": 331,
            "双防": 331,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    16
                ],
                [
                    4000313,
                    3569
                ],
                [
                    0,
                    214588431
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级7": {
            "四维": 340,
            "双防": 340,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    18
                ],
                [
                    4000313,
                    3687
                ],
                [
                    0,
                    222383300
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级8": {
            "四维": 349,
            "双防": 349,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    20
                ],
                [
                    4000313,
                    3806
                ],
                [
                    0,
                    230178168
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级9": {
            "四维": 357,
            "双防": 357,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    22
                ],
                [
                    4000313,
                    3924
                ],
                [
                    0,
                    237973037
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        },
        "等级10": {
            "四维": 366,
            "双防": 366,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500706,
                    24
                ],
                [
                    4000313,
                    4042
                ],
                [
                    0,
                    245767905
                ]
            ],
            "绑定材料": [
                null,
                4500721,
                4500033
            ]
        }
    },
    "1122109": {
        "进阶id": 1122188,
        "等级1": {
            "四维": 374,
            "双防": 374,
            "材料": [
                [
                    4500010,
                    16
                ],
                [
                    4500707,
                    6
                ],
                [
                    4000313,
                    4166
                ],
                [
                    0,
                    254342260
                ]
            ],
            "绑定材料": [
                4500025,
                4500722,
                4500033
            ]
        },
        "等级2": {
            "四维": 382,
            "双防": 382,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    8
                ],
                [
                    4000313,
                    4290
                ],
                [
                    0,
                    262916615
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级3": {
            "四维": 390,
            "双防": 390,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    10
                ],
                [
                    4000313,
                    4414
                ],
                [
                    0,
                    271490971
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级4": {
            "四维": 398,
            "双防": 398,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    12
                ],
                [
                    4000313,
                    4538
                ],
                [
                    0,
                    280065326
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级5": {
            "四维": 407,
            "双防": 407,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    14
                ],
                [
                    4000313,
                    4663
                ],
                [
                    0,
                    288639681
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级6": {
            "四维": 415,
            "双防": 415,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    16
                ],
                [
                    4000313,
                    4787
                ],
                [
                    0,
                    297214036
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级7": {
            "四维": 423,
            "双防": 423,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    18
                ],
                [
                    4000313,
                    4911
                ],
                [
                    0,
                    305788392
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级8": {
            "四维": 431,
            "双防": 431,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    20
                ],
                [
                    4000313,
                    5035
                ],
                [
                    0,
                    314362747
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级9": {
            "四维": 439,
            "双防": 439,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    22
                ],
                [
                    4000313,
                    5159
                ],
                [
                    0,
                    322937102
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        },
        "等级10": {
            "四维": 447,
            "双防": 447,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500707,
                    24
                ],
                [
                    4000313,
                    5283
                ],
                [
                    0,
                    331511457
                ]
            ],
            "绑定材料": [
                null,
                4500722,
                4500033
            ]
        }
    },
    "1122188": {
        "进阶id": 1122236,
        "等级1": {
            "四维": 455,
            "双防": 455,
            "材料": [
                [
                    4500011,
                    16
                ],
                [
                    4500708,
                    6
                ],
                [
                    4000313,
                    5413
                ],
                [
                    0,
                    340943248
                ]
            ],
            "绑定材料": [
                4500026,
                4500723,
                4500033
            ]
        },
        "等级2": {
            "四维": 463,
            "双防": 463,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    8
                ],
                [
                    4000313,
                    5544
                ],
                [
                    0,
                    350375039
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级3": {
            "四维": 471,
            "双防": 470,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    10
                ],
                [
                    4000313,
                    5674
                ],
                [
                    0,
                    359806830
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级4": {
            "四维": 478,
            "双防": 478,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    12
                ],
                [
                    4000313,
                    5804
                ],
                [
                    0,
                    369238620
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级5": {
            "四维": 486,
            "双防": 486,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    14
                ],
                [
                    4000313,
                    5935
                ],
                [
                    0,
                    378670411
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级6": {
            "四维": 494,
            "双防": 494,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    16
                ],
                [
                    4000313,
                    6065
                ],
                [
                    0,
                    388102202
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级7": {
            "四维": 502,
            "双防": 502,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    18
                ],
                [
                    4000313,
                    6195
                ],
                [
                    0,
                    397533993
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级8": {
            "四维": 509,
            "双防": 509,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    20
                ],
                [
                    4000313,
                    6326
                ],
                [
                    0,
                    406965783
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级9": {
            "四维": 517,
            "双防": 517,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    22
                ],
                [
                    4000313,
                    6456
                ],
                [
                    0,
                    416397574
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        },
        "等级10": {
            "四维": 525,
            "双防": 525,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500708,
                    24
                ],
                [
                    4000313,
                    6586
                ],
                [
                    0,
                    425829365
                ]
            ],
            "绑定材料": [
                null,
                4500723,
                4500033
            ]
        }
    },
    "1122236": {
        "进阶id": 1122306,
        "等级1": {
            "四维": 534,
            "双防": 534,
            "材料": [
                [
                    4500012,
                    20
                ],
                [
                    4500709,
                    8
                ],
                [
                    4000313,
                    6757
                ],
                [
                    0,
                    438798077
                ]
            ],
            "绑定材料": [
                4500027,
                4500724,
                4500033
            ]
        },
        "等级2": {
            "四维": 544,
            "双防": 544,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    11
                ],
                [
                    4000313,
                    6928
                ],
                [
                    0,
                    451766790
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级3": {
            "四维": 553,
            "双防": 553,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    14
                ],
                [
                    4000313,
                    7099
                ],
                [
                    0,
                    464735502
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级4": {
            "四维": 562,
            "双防": 562,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    16
                ],
                [
                    4000313,
                    7270
                ],
                [
                    0,
                    477704214
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级5": {
            "四维": 572,
            "双防": 572,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    18
                ],
                [
                    4000313,
                    7441
                ],
                [
                    0,
                    490672926
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级6": {
            "四维": 581,
            "双防": 581,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    20
                ],
                [
                    4000313,
                    7612
                ],
                [
                    0,
                    503641639
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级7": {
            "四维": 590,
            "双防": 590,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    22
                ],
                [
                    4000313,
                    7783
                ],
                [
                    0,
                    516610351
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级8": {
            "四维": 600,
            "双防": 600,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    24
                ],
                [
                    4000313,
                    7954
                ],
                [
                    0,
                    529579063
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级9": {
            "四维": 609,
            "双防": 609,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    26
                ],
                [
                    4000313,
                    8126
                ],
                [
                    0,
                    542547776
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        },
        "等级10": {
            "四维": 618,
            "双防": 618,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500709,
                    28
                ],
                [
                    4000313,
                    8297
                ],
                [
                    0,
                    555516488
                ]
            ],
            "绑定材料": [
                null,
                4500724,
                4500033
            ]
        }
    },
    "1122306": {
        "进阶id": 1123001,
        "等级1": {
            "四维": 627,
            "双防": 627,
            "材料": [
                [
                    4500013,
                    20
                ],
                [
                    4500710,
                    8
                ],
                [
                    4000313,
                    8476
                ],
                [
                    0,
                    569782071
                ]
            ],
            "绑定材料": [
                4500028,
                4500725,
                4500033
            ]
        },
        "等级2": {
            "四维": 636,
            "双防": 636,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    11
                ],
                [
                    4000313,
                    8656
                ],
                [
                    0,
                    584047655
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级3": {
            "四维": 645,
            "双防": 645,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    14
                ],
                [
                    4000313,
                    8835
                ],
                [
                    0,
                    598313239
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级4": {
            "四维": 654,
            "双防": 654,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    16
                ],
                [
                    4000313,
                    9015
                ],
                [
                    0,
                    612578822
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级5": {
            "四维": 663,
            "双防": 663,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    18
                ],
                [
                    4000313,
                    9194
                ],
                [
                    0,
                    626844406
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级6": {
            "四维": 672,
            "双防": 672,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    20
                ],
                [
                    4000313,
                    9374
                ],
                [
                    0,
                    641109989
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级7": {
            "四维": 681,
            "双防": 681,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    22
                ],
                [
                    4000313,
                    9554
                ],
                [
                    0,
                    655375573
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级8": {
            "四维": 690,
            "双防": 690,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    24
                ],
                [
                    4000313,
                    9733
                ],
                [
                    0,
                    669641156
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级9": {
            "四维": 699,
            "双防": 699,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    26
                ],
                [
                    4000313,
                    9913
                ],
                [
                    0,
                    683906740
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        },
        "等级10": {
            "四维": 709,
            "双防": 709,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500710,
                    28
                ],
                [
                    4000313,
                    10092
                ],
                [
                    0,
                    698172323
                ]
            ],
            "绑定材料": [
                null,
                4500725,
                4500033
            ]
        }
    },
    "1123001": {
        "进阶id": 1122197,
        "等级1": {
            "四维": 717,
            "双防": 717,
            "材料": [
                [
                    4500014,
                    20
                ],
                [
                    4500711,
                    8
                ],
                [
                    4000313,
                    10281
                ],
                [
                    0,
                    713864465
                ]
            ],
            "绑定材料": [
                4500029,
                4500726,
                4500033
            ]
        },
        "等级2": {
            "四维": 726,
            "双防": 726,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    11
                ],
                [
                    4000313,
                    10470
                ],
                [
                    0,
                    729556607
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级3": {
            "四维": 735,
            "双防": 735,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    14
                ],
                [
                    4000313,
                    10658
                ],
                [
                    0,
                    745248749
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级4": {
            "四维": 744,
            "双防": 744,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    16
                ],
                [
                    4000313,
                    10847
                ],
                [
                    0,
                    760940891
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级5": {
            "四维": 752,
            "双防": 752,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    18
                ],
                [
                    4000313,
                    11035
                ],
                [
                    0,
                    776633033
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级6": {
            "四维": 761,
            "双防": 761,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    20
                ],
                [
                    4000313,
                    11224
                ],
                [
                    0,
                    792325175
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级7": {
            "四维": 770,
            "双防": 770,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    22
                ],
                [
                    4000313,
                    11412
                ],
                [
                    0,
                    808017316
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级8": {
            "四维": 779,
            "双防": 779,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    24
                ],
                [
                    4000313,
                    11601
                ],
                [
                    0,
                    823709458
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级9": {
            "四维": 788,
            "双防": 788,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    26
                ],
                [
                    4000313,
                    11789
                ],
                [
                    0,
                    839401600
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        },
        "等级10": {
            "四维": 796,
            "双防": 796,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500711,
                    28
                ],
                [
                    4000313,
                    11978
                ],
                [
                    0,
                    855093742
                ]
            ],
            "绑定材料": [
                null,
                4500726,
                4500033
            ]
        }
    },
    "1122197": {
        "进阶id": 1122210,
        "等级1": {
            "四维": 807,
            "双防": 807,
            "材料": [
                [
                    4500015,
                    24
                ],
                [
                    4500712,
                    10
                ],
                [
                    4000313,
                    12216
                ],
                [
                    0,
                    875807369
                ]
            ],
            "绑定材料": [
                4500030,
                4500727,
                4500033
            ]
        },
        "等级2": {
            "四维": 817,
            "双防": 817,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    13
                ],
                [
                    4000313,
                    12453
                ],
                [
                    0,
                    896520997
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级3": {
            "四维": 827,
            "双防": 827,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    16
                ],
                [
                    4000313,
                    12691
                ],
                [
                    0,
                    917234624
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级4": {
            "四维": 837,
            "双防": 837,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    19
                ],
                [
                    4000313,
                    12928
                ],
                [
                    0,
                    937948251
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级5": {
            "四维": 848,
            "双防": 848,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    22
                ],
                [
                    4000313,
                    13166
                ],
                [
                    0,
                    958661879
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级6": {
            "四维": 858,
            "双防": 858,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    25
                ],
                [
                    4000313,
                    13404
                ],
                [
                    0,
                    979375506
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级7": {
            "四维": 868,
            "双防": 868,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    27
                ],
                [
                    4000313,
                    13641
                ],
                [
                    0,
                    1000089133
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级8": {
            "四维": 879,
            "双防": 879,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    29
                ],
                [
                    4000313,
                    13879
                ],
                [
                    0,
                    1020802760
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级9": {
            "四维": 889,
            "双防": 889,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    31
                ],
                [
                    4000313,
                    14116
                ],
                [
                    0,
                    1041516388
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        },
        "等级10": {
            "四维": 899,
            "双防": 899,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500712,
                    33
                ],
                [
                    4000313,
                    14354
                ],
                [
                    0,
                    1062230015
                ]
            ],
            "绑定材料": [
                null,
                4500727,
                4500033
            ]
        }
    },
    "1122210": {
        "进阶id": 0,
        "等级1": {
            "四维": 909,
            "双防": 909,
            "材料": [
                [
                    4500016,
                    24
                ],
                [
                    4500713,
                    10
                ],
                [
                    4000313,
                    14603
                ],
                [
                    0,
                    1085015005
                ]
            ],
            "绑定材料": [
                4500031,
                4500728,
                4500033
            ]
        },
        "等级2": {
            "四维": 919,
            "双防": 919,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    13
                ],
                [
                    4000313,
                    14853
                ],
                [
                    0,
                    1107799995
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级3": {
            "四维": 929,
            "双防": 929,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    16
                ],
                [
                    4000313,
                    15102
                ],
                [
                    0,
                    1130584985
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级4": {
            "四维": 940,
            "双防": 939,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    19
                ],
                [
                    4000313,
                    15352
                ],
                [
                    0,
                    1153369975
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级5": {
            "四维": 950,
            "双防": 950,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    22
                ],
                [
                    4000313,
                    15601
                ],
                [
                    0,
                    1176154965
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级6": {
            "四维": 960,
            "双防": 960,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    25
                ],
                [
                    4000313,
                    15851
                ],
                [
                    0,
                    1198939955
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级7": {
            "四维": 970,
            "双防": 970,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    27
                ],
                [
                    4000313,
                    16100
                ],
                [
                    0,
                    1221724945
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级8": {
            "四维": 980,
            "双防": 980,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    29
                ],
                [
                    4000313,
                    16350
                ],
                [
                    0,
                    1244509935
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级9": {
            "四维": 990,
            "双防": 990,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    31
                ],
                [
                    4000313,
                    16599
                ],
                [
                    0,
                    1267294925
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        },
        "等级10": {
            "四维": 1000,
            "双防": 1000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500713,
                    33
                ],
                [
                    4000313,
                    16849
                ],
                [
                    0,
                    1290079915
                ]
            ],
            "绑定材料": [
                null,
                4500728,
                4500033
            ]
        }
    }
}
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    强化物品ivid = itemaa.getInventoryId();
    当前星级 = parseInt((等级规划.indexOf("" + itemaa.getOwner() + "")));
    if (itemaa.getOwner() == null || itemaa.getOwner() == "") {
        当前星级 = 1;
    }

    if (当前星级 <= -1) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;

    }
    下一阶id = 强化物品;
    下一等级 = 等级规划[当前星级 + 1];
    if (当前星级 >= 最高等级) {
        下一阶id = 进阶数据[强化物品]["进阶id"];
        下一等级 = "等级1";
    }
    if (!下一等级 || !进阶数据[下一阶id][下一等级]) {
        cm.sendOk("该装备已到达上限，无法进阶。");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 等级规划[当前星级] + "#k#n 强化至 #b#e" + (下一阶id != 强化物品 ? "进阶" : 下一等级) + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[下一阶id][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[下一阶id][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["四维"] ? "[#r四维+" + 进阶数据[下一阶id][下一等级]["四维"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[下一阶id][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["双防"] ? "[#r双防+" + 进阶数据[下一阶id][下一等级]["双防"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["速度"] ? "[#r速度+" + 进阶数据[下一阶id][下一等级]["速度"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[下一阶id][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["命中"] ? "[#r命中+" + 进阶数据[下一阶id][下一等级]["命中"] + "]" : "";
        text += 进阶数据[下一阶id][下一等级]["回避"] ? "[#r回避+" + 进阶数据[下一阶id][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[下一阶id][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[下一阶id][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                // if (需要物品id == 4310079 || 需要物品id == 4500001) {
                //     cm.dispose();
                //     cm.openNpc(9130000, "获取材料1");
                //     return;
                // }
            }



        }
    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品ivid)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(下一阶id);
            equip.setStr(进阶数据[下一阶id][下一等级]["四维"]);
            equip.setDex(进阶数据[下一阶id][下一等级]["四维"]);
            equip.setInt(进阶数据[下一阶id][下一等级]["四维"]);
            equip.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
            // equip.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
            // equip.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
            // equip.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
            // equip.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
            equip.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
            equip.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
            // equip.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
            // equip.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                item.setStr(进阶数据[下一阶id][下一等级]["四维"]);
                item.setDex(进阶数据[下一阶id][下一等级]["四维"]);
                item.setInt(进阶数据[下一阶id][下一等级]["四维"]);
                item.setLuk(进阶数据[下一阶id][下一等级]["四维"]);
                // item.setHp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // item.setMp(进阶数据[下一阶id][下一等级]["hpmp"]);
                // item.setWatk(进阶数据[下一阶id][下一等级]["双攻"]);
                // item.setMatk(进阶数据[下一阶id][下一等级]["双攻"]);
                item.setWdef(进阶数据[下一阶id][下一等级]["双防"]);
                item.setMdef(进阶数据[下一阶id][下一等级]["双防"]);
                // item.setAvoid(进阶数据[下一阶id][下一等级]["回避"]);
                // item.setAcc(进阶数据[下一阶id][下一等级]["命中"]);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}

function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }


        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);

        }


    }
    return true;
}
