var status = -1; // 在脚本开始时定义 status 变量
function action() {
    if (cm.getInventory(1).isFull(7)){
        cm.说明文字("请保证背包#b装备栏#k至少有 #r7 #k格位置");
        cm.结束对话();
        return;
    }
    if (cm.getInventory(2).isFull(4)){
        cm.说明文字("请保证背包#b消耗栏#k至少有 #r4 #k格位置");
        cm.结束对话();
        return;
    }

    if (status == -1) {
        status = 0;
        var text = "#e#d欢迎领取新手礼包！#n#k\r\n";
        text += "#b以下是新手礼包的内容展示（创建三个角色三个角色都有哦）：#k\r\n";
        // text += "#v2022575# 3000个超级药水\r\n";
        // text += "#v5370000# 1个宠物自动捡取功能\r\n";
        text += "#v1012530#   回归套装全套\r\n";
        // text += "#v2000016#   3000个白色药水\r\n";
        // text += "#v2020013#  3000个鹿奶\r\n";
        // text += "#v2020015#   3000个黄昏\r\n";
        // text += "#v2022564#   #r新手成就宝典 必做！！！！！！！！！#n#k\r\n";
        // text += "#v2022582#   50个增加HPMP上限石头\r\n";
        // text += "#v2000018#  3000个活力神水\r\n";
        // text += "#v5220007#  废弃都市找大姐大可以租一把枫叶武器\r\n";
        // text += "#v2022336#  1个吸怪权限，在消耗栏双击即可开启吸怪\r\n";
        text += "#v1142107#  1个新手勋章，用交易积分币进行提升\r\n";
        text += "#v1112440#   1个限时属性戒指（+50全属性，+40攻击，+60魔法）\r\n";
        text += "#v1112422#  1个每日戒指（做副本，跑环，抽奖获取劳动奖章进行升级）\r\n";
        text += "#v1112423#  1个野怪戒指（做副本，击杀小怪获取小宝物袋进行升级）\r\n";
        text += "#v1112424#  1个经验戒指（用经验换取经验币进行升级）\r\n";
        text += "#v1112425# 1个副本戒指（做副本获取邮票进行升级）\r\n";
        text += "#v1112426#  1个BOSS戒指（击杀各种野外BOSS获取心脏进行升级）\r\n";
        // text += "#v2022520# 放在快捷栏可以快速打开拍卖功能栏\r\n";
        // text += "同时你将获得：68888抵用券（买宠物买双倍经验买双爆）\r\n";
        // text += "388W金币\r\n";
        text += "#r领取后将无法重复领取，是否确认领取新手礼包？#k";
        cm.sendYesNo(text);
    } else if (status == 0) {
        if (cm.getOneTimeLog("新手奖励") > 1) { 
            cm.sendOkS("每个角色只能领取一个新手礼盒！", 1);
            cm.dispose();
        } else {
            cm.gainItem(2022575, -1);
            cm.gainItem(1003529, 1);
            // cm.gainItem(2022582, 50);
            // cm.gainItem(2022564, 1);//新手宝典
            cm.gainItem(1012530, 1);
            cm.gainItem(1022135, 1);
            cm.gainItem(1032111, 1);
            cm.gainItem(1052457, 1);
            cm.gainItem(1072660, 1);
            cm.gainItem(1082430, 1);
            // cm.gainItem(2022552, 1);
            // cm.gainItem(5370000, 1);
            // cm.gainItem(2020013, 3000);
            // cm.gainItem(2020015, 3000);
            // cm.gainItem(2022000, 1500);
            // cm.gainItem(2000018, 3000);
            // cm.gainItem(2022336, 1);
            // cm.gainItem(1472000, 1);
            // cm.gainItem(1332007, 1);
            // cm.gainItem(1462001, 1);
            // cm.gainItem(1452002, 1);
            // cm.gainItem(1372005, 1);
            // cm.gainItem(1302007, 1);
            // cm.gainItem(1432000, 1);
            // cm.gainItem(1492000, 1);
            // cm.gainItem(1482000, 1);
            cm.给属性装备(1112440, 0, 0, 50, 50, 50, 50, 0, 0, 40, 60, 0, 0, 0, 0, 0, 0, 168);
            // cm.给抵用券(68888);
            // cm.gainItem(2022520, 1);
            // cm.gainItem(5220007, 1);
            // cm.gainMeso(3888888);
            cm.给属性装备(1112422, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.给属性装备(1142107, 0, 0, 3, 3, 3, 3, 50, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.给属性装备(1112423, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.给属性装备(1112424, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.给属性装备(1112425, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.给属性装备(1112426, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
            cm.teachSkill(8, 1, 1);
            cm.teachSkill(1017, 1, 1);
            cm.teachSkill(1003, 1, 1);
            cm.teachSkill(1004, 1, 1);
            cm.teachSkill(20000024, 1, 1);
            cm.全服黄色喇叭(cm.getPlayer().getName() + " [新手礼包]" + " : " + "成功领取了新手礼包！");
            cm.setOneTimeLog("新手奖励");
            cm.dispose();
        }
    }
}
