var 美化1 = "#fUI/ChatBalloon.img/pet/279/nw#";//选择道具
var 美化3 = "#fUI/ChatBalloon.img/pet/279/ne#";//选择道具
var 美化2 = "#fUI/ChatBalloon.img/pet/279/n#";//选择道具
var 美化4 = "#fUI/ChatBalloon.img/pet/279/sw#";//选择道具
var 美化5 = "#fUI/ChatBalloon.img/pet/279/se#";//选择道具
var 美化6 = "#fUI/ChatBalloon.img/pet/279/s#";//选择道具
var 美化7 = "#fUI/ChatBalloon.img/pet/279/head#";//选择道具
var 美化8 = "#fUI/ChatBalloon.img/pet/279/arrow#";//选择道具
var 爱心1 = "#fEffect/CharacterEff.img/1112946/0/0#";
var 爱心2 = "#fEffect/CharacterEff.img/1112905/0/1#";
var 爱心3 = "#fEffect/CharacterEff.img/1112946/1/0#";
var 爱心4 = "#fEffect/CharacterEff.img/1112946/1/1#";
var 爱心5 = "#fEffect/CharacterEff.img/1112946/2/0#";
var 爱心6 = "#fEffect/CharacterEff.img/1112946/2/1#";
var 爱心7 = "#fEffect/CharacterEff.img/1112946/3/0#";
var 爱心8 = "#fEffect/CharacterEff.img/1112946/3/1#";
var 爱心9 = "#fEffect/CharacterEff.img/1112906/0/1#";
var 爱心10 = "#fEffect/CharacterEff.img/1112903/1/0#";
var 制作 = "#fUI/UIWindow/Maker/BtStart/mouseOver/0#";
var 小lv数字0 = "#fUI/Basic/ShowLevel/0/0#";
var 小lv数字1 = "#fUI/Basic/ShowLevel/0/1#";
var 小lv数字2 = "#fUI/Basic/ShowLevel/0/2#";
var 小lv数字3 = "#fUI/Basic/ShowLevel/0/3#";
var 小lv数字4 = "#fUI/Basic/ShowLevel/0/4#";
var 小lv数字5 = "#fUI/Basic/ShowLevel/0/5#";
var 小lv数字6 = "#fUI/Basic/ShowLevel/0/6#";
var 小lv数字7 = "#fUI/Basic/ShowLevel/0/7#";
var 小lv数字8 = "#fUI/Basic/ShowLevel/0/8#";
var 小lv数字9 = "#fUI/Basic/ShowLevel/0/9#";
var 小lv = "#fUI/Basic/ShowLevel/0/left#";
var 右边框 = "#fUI/Basic/ShowLevel/Bracket/right#";


var 个人排名 = -1;
var 奖励数据 = {
	"个人": [
		[
			[
				4000313,
				9.06
			],
			[
				4033232,
				1.16
			],
			[
				4500116,
				1.16
			],
			[
				4033104,
				1.16
			],
			[
				4500216,
				1.16
			],
			[
				4033105,
				0.58
			],
			[
				4500316,
				0.58
			],
			[
				4033106,
				0.58
			],
			[
				4500416,
				0.58
			],
			[
				0,
				152542.5
			]
		],
		[
			[
				4000313,
				13.52
			],
			[
				4033232,
				1.73
			],
			[
				4500116,
				1.73
			],
			[
				4033104,
				1.73
			],
			[
				4500216,
				1.73
			],
			[
				4033105,
				0.87
			],
			[
				4500316,
				0.87
			],
			[
				4033106,
				0.87
			],
			[
				4500416,
				0.87
			],
			[
				0,
				227675.38
			]
		],
		[
			[
				4000313,
				20.18
			],
			[
				4033232,
				2.58
			],
			[
				4500116,
				2.58
			],
			[
				4033104,
				2.58
			],
			[
				4500216,
				2.58
			],
			[
				4033105,
				1.29
			],
			[
				4500316,
				1.29
			],
			[
				4033106,
				1.29
			],
			[
				4500416,
				1.29
			],
			[
				0,
				339814.0
			]
		],
		[
			[
				4000313,
				30.12
			],
			[
				4033232,
				3.86
			],
			[
				4500116,
				3.86
			],
			[
				4033104,
				3.86
			],
			[
				4500216,
				3.86
			],
			[
				4033105,
				1.93
			],
			[
				4500316,
				1.93
			],
			[
				4033106,
				1.93
			],
			[
				4500416,
				1.93
			],
			[
				0,
				507185.07
			]
		],
		[
			[
				4000313,
				36.46
			],
			[
				4500102,
				3.75
			],
			[
				4500117,
				3.75
			],
			[
				4500202,
				3.75
			],
			[
				4500217,
				3.75
			],
			[
				4500302,
				1.88
			],
			[
				4500317,
				1.88
			],
			[
				4500402,
				1.88
			],
			[
				4500417,
				1.88
			],
			[
				0,
				723429.83
			]
		],
		[
			[
				4000313,
				38.3
			],
			[
				4500103,
				3.75
			],
			[
				4500118,
				3.75
			],
			[
				4500203,
				3.75
			],
			[
				4500218,
				3.75
			],
			[
				4500303,
				1.88
			],
			[
				4500318,
				1.88
			],
			[
				4500403,
				1.88
			],
			[
				4500418,
				1.88
			],
			[
				0,
				768652.5
			]
		],
		[
			[
				4000313,
				40.21
			],
			[
				4500104,
				3.67
			],
			[
				4500119,
				3.67
			],
			[
				4500204,
				3.67
			],
			[
				4500219,
				3.67
			],
			[
				4500304,
				1.83
			],
			[
				4500319,
				1.83
			],
			[
				4500404,
				1.83
			],
			[
				4500419,
				1.83
			],
			[
				0,
				845517.75
			]
		],
		[
			[
				4000313,
				42.21
			],
			[
				4500105,
				3.67
			],
			[
				4500120,
				3.67
			],
			[
				4500205,
				3.67
			],
			[
				4500220,
				3.67
			],
			[
				4500305,
				1.83
			],
			[
				4500320,
				1.83
			],
			[
				4500405,
				1.83
			],
			[
				4500420,
				1.83
			],
			[
				0,
				930069.53
			]
		],
		[
			[
				4000313,
				44.33
			],
			[
				4500106,
				3.75
			],
			[
				4500121,
				3.75
			],
			[
				4500206,
				3.75
			],
			[
				4500221,
				3.75
			],
			[
				4500306,
				1.88
			],
			[
				4500321,
				1.88
			],
			[
				4500406,
				1.88
			],
			[
				4500421,
				1.88
			],
			[
				0,
				1023076.48
			]
		],
		[
			[
				4000313,
				46.54
			],
			[
				4500107,
				3.75
			],
			[
				4500122,
				3.75
			],
			[
				4500207,
				3.75
			],
			[
				4500222,
				3.75
			],
			[
				4500307,
				1.88
			],
			[
				4500322,
				1.88
			],
			[
				4500407,
				1.88
			],
			[
				4500422,
				1.88
			],
			[
				0,
				1125384.12
			]
		],
		[
			[
				4000313,
				48.87
			],
			[
				4500108,
				3.75
			],
			[
				4500123,
				3.75
			],
			[
				4500208,
				3.75
			],
			[
				4500223,
				3.75
			],
			[
				4500308,
				1.88
			],
			[
				4500323,
				1.88
			],
			[
				4500408,
				1.88
			],
			[
				4500423,
				1.88
			],
			[
				0,
				1237922.54
			]
		],
		[
			[
				4000313,
				51.32
			],
			[
				4500109,
				3.74
			],
			[
				4500124,
				3.74
			],
			[
				4500209,
				3.74
			],
			[
				4500224,
				3.74
			],
			[
				4500309,
				1.87
			],
			[
				4500324,
				1.87
			],
			[
				4500409,
				1.87
			],
			[
				4500424,
				1.87
			],
			[
				0,
				1361714.79
			]
		],
		[
			[
				4000313,
				53.87
			],
			[
				4500110,
				3.74
			],
			[
				4500125,
				3.74
			],
			[
				4500210,
				3.74
			],
			[
				4500225,
				3.74
			],
			[
				4500310,
				1.87
			],
			[
				4500325,
				1.87
			],
			[
				4500410,
				1.87
			],
			[
				4500425,
				1.87
			],
			[
				0,
				1497886.27
			]
		],
		[
			[
				4000313,
				56.57
			],
			[
				4500111,
				3.74
			],
			[
				4500126,
				3.74
			],
			[
				4500211,
				3.74
			],
			[
				4500226,
				3.74
			],
			[
				4500311,
				1.87
			],
			[
				4500326,
				1.87
			],
			[
				4500411,
				1.87
			],
			[
				4500426,
				1.87
			],
			[
				0,
				1647674.9
			]
		],
		[
			[
				4000313,
				59.4
			],
			[
				4500112,
				3.75
			],
			[
				4500127,
				3.75
			],
			[
				4500212,
				3.75
			],
			[
				4500227,
				3.75
			],
			[
				4500312,
				1.88
			],
			[
				4500327,
				1.88
			],
			[
				4500412,
				1.88
			],
			[
				4500427,
				1.88
			],
			[
				0,
				1812442.39
			]
		],
		[
			[
				4000313,
				62.37
			],
			[
				4500113,
				3.75
			],
			[
				4500128,
				3.75
			],
			[
				4500213,
				3.75
			],
			[
				4500228,
				3.75
			],
			[
				4500313,
				1.88
			],
			[
				4500328,
				1.88
			],
			[
				4500413,
				1.88
			],
			[
				4500428,
				1.88
			],
			[
				0,
				1993686.63
			]
		]
	]
}
function start() {
	status = -1;
	// cm.sendOk(cm.getOneTimeLog("制作"+"1121008") > 0 ? cm.getOneTimeLog("制作"+"1121008") : 0);
	action(1, 0, 0);
}
function action(mode, type, selection) {
	//var brs = cm.getBossRankCountTop4("希拉");//开放
	var 等级 = cm.getPlayer().getLevel();
	var 名字 = cm.getPlayer().getName();
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {


			cm.sendOk("感谢你的光临！");
			cm.dispose();
			return;
		}
		if (mode == 1) {
			status++;
		} else {
			status--;
		}
		if (status == 0) {
			// 排名 = 1;
			var text = "";
			// text += "  #w名次            伤害              名字  \r\n"
			text += "玩家奖励发放";
			// for (var i = 0; i<(brs.size()); i++) {
			// var br = brs.get(i);
			// text += "  #bNo.#r" + (i+1) + "#k             #b" + cm.getString(br.getCount(), 8) + "#k          #r" + br.getName() + "#k\r\n"
			// }



			// var toSpawn = cm.获取BOSS伤害排行("希拉");
			// for (var i = 0; i < toSpawn.length; i++) {
			// 	if (toSpawn[i].getLeft() == cm.getPlayer().getName()) {
			// 		个人排名 = i + 1;
			// 	}
			// 	text += "#rNO." + (i + 1) + "#k " + toSpawn[i].getLeft() + " : " + toSpawn[i].getRight() + "\r\n";
			// }



			cm.sendSimpleS(text, 2);
		} else if (status == 1) {
			// for (var i = 0; i<(brs.size()); i++) {
			// var br = brs.get(i);
			// if(cm.getName() == br.getName()){
			// 排名 = (i+1);
			// break;
			// }
			// }
			// for (var i = 0; i < 给予.length; i++) {
			// 	if (排名 == 给予[i][0]) {
			// 		if (cm.getLevel() >= 给予[i][1] && cm.getLevel() < 给予[i][2]) {
			// 			cm.gainItem(给予[i][3], 给予[i][4]);
			// 		}
			// 	}
			// }
			// var 等级 = cm.getPlayer().getLevel();
			// var levels = [70, 90, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240];
			// var index = -1;

			// // 获取等级索引
			// for (var i = 0; i < levels.length; i++) {
			// 	if (等级 <= levels[i]) {
			// 		index = i;
			// 		break;
			// 	}
			// }

			var index = getLevelIndex(等级);
			if (index === -1) {
				return; // 等级不在奖励范围内
			}

			var 奖励列表 = 奖励数据["个人"][index-1];

			for (var i = 0; i < 奖励列表.length; i++) {
				var 物品ID = 奖励列表[i][0];
				var 爆率 = 奖励列表[i][1];
				var 数量 = rate(爆率);
				if (数量 > 0) {
					if (物品ID == 0) {
						cm.gainMeso(数量);
					} else {
						cm.gainItem(物品ID, 数量);
					}
				}
			}
			// cm.sendOk("领取 伤害排行第 " + 排名 + " 名奖励");
			// cm.sendOk(等级);
			cm.sendOk("奖励发放成功")
			cm.dispose();


		} else if (selection == 30) {
			cm.dispose();
			cm.openNpc(9900001, "矿石仓库");
		}
	}
}

function getLevelIndex(等级) {
	var levels = [70, 90, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240];
	for (var i = 0; i < levels.length; i++) {
		if (等级 <= levels[i]) {
			return i;
		}
	}
	return -1;
}



function rate(材料爆率) {
	var 整数部分 = Math.floor(材料爆率);
	var 小数部分 = 材料爆率 - 整数部分;

	var 获得数量 = 整数部分;

	if (小数部分 > 0) {
		if (Math.random() < 小数部分) {
			获得数量 += 1;
		}
	}

	return 获得数量;
}

