var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 130;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1092045": {
        "等级1": {
            "hpmp": 0,
            "攻魔": 0,
            "命中": 0,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级1": {
            "hpmp": 140,
            "攻魔": 4,
            "命中": 7,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    10
                ],
                [
                    4000313,
                    15
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级2": {
            "hpmp": 280,
            "攻魔": 8,
            "命中": 14,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    10
                ],
                [
                    4000313,
                    15
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级3": {
            "hpmp": 420,
            "攻魔": 12,
            "命中": 22,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    15
                ],
                [
                    4000313,
                    16
                ],
                [
                    0,
                    788955
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级4": {
            "hpmp": 550,
            "攻魔": 16,
            "命中": 29,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    20
                ],
                [
                    4000313,
                    15
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级5": {
            "hpmp": 690,
            "攻魔": 20,
            "命中": 36,
            "材料": [
                [
                    4001084,
                    1
                ],
                [
                    4033104,
                    25
                ],
                [
                    4000313,
                    16
                ],
                [
                    0,
                    788955
                ]
            ],
            "绑定材料": [
                4500019,
                4500216,
                4500033
            ]
        },
        "等级6": {
            "hpmp": 830,
            "攻魔": 25,
            "命中": 43,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    30
                ],
                [
                    4000313,
                    16
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级7": {
            "hpmp": 970,
            "攻魔": 29,
            "命中": 50,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    35
                ],
                [
                    4000313,
                    15
                ],
                [
                    0,
                    788955
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级8": {
            "hpmp": 1110,
            "攻魔": 33,
            "命中": 57,
            "材料": [
                [
                    4001084,
                    1
                ],
                [
                    4033104,
                    40
                ],
                [
                    4000313,
                    16
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                4500019,
                4500216,
                4500033
            ]
        },
        "等级9": {
            "hpmp": 1250,
            "攻魔": 37,
            "命中": 65,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    45
                ],
                [
                    4000313,
                    16
                ],
                [
                    0,
                    788955
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级10": {
            "hpmp": 1380,
            "攻魔": 41,
            "命中": 72,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033104,
                    50
                ],
                [
                    4000313,
                    15
                ],
                [
                    0,
                    788954
                ]
            ],
            "绑定材料": [
                null,
                4500216,
                4500033
            ]
        },
        "等级11": {
            "hpmp": 1520,
            "攻魔": 45,
            "命中": 80,
            "材料": [
                [
                    4001085,
                    3
                ],
                [
                    4500202,
                    10
                ],
                [
                    4000313,
                    20
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                4500020,
                4500217,
                4500033
            ]
        },
        "等级12": {
            "hpmp": 1660,
            "攻魔": 50,
            "命中": 87,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    15
                ],
                [
                    4000313,
                    19
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级13": {
            "hpmp": 1800,
            "攻魔": 54,
            "命中": 95,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    20
                ],
                [
                    4000313,
                    19
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级14": {
            "hpmp": 1940,
            "攻魔": 59,
            "命中": 103,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    25
                ],
                [
                    4000313,
                    20
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级15": {
            "hpmp": 2080,
            "攻魔": 63,
            "命中": 111,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    30
                ],
                [
                    4000313,
                    19
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级16": {
            "hpmp": 2220,
            "攻魔": 68,
            "命中": 118,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    30
                ],
                [
                    4000313,
                    20
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级17": {
            "hpmp": 2350,
            "攻魔": 72,
            "命中": 126,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    35
                ],
                [
                    4000313,
                    19
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级18": {
            "hpmp": 2490,
            "攻魔": 76,
            "命中": 134,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    40
                ],
                [
                    4000313,
                    20
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级19": {
            "hpmp": 2630,
            "攻魔": 81,
            "命中": 142,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    45
                ],
                [
                    4000313,
                    19
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级20": {
            "hpmp": 2770,
            "攻魔": 85,
            "命中": 149,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500202,
                    50
                ],
                [
                    4000313,
                    20
                ],
                [
                    0,
                    1064800
                ]
            ],
            "绑定材料": [
                null,
                4500217,
                4500033
            ]
        },
        "等级21": {
            "hpmp": 2910,
            "攻魔": 91,
            "命中": 159,
            "材料": [
                [
                    4500006,
                    4
                ],
                [
                    4500203,
                    15
                ],
                [
                    4000313,
                    25
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                4500021,
                4500218,
                4500033
            ]
        },
        "等级22": {
            "hpmp": 3050,
            "攻魔": 96,
            "命中": 168,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    20
                ],
                [
                    4000313,
                    26
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级23": {
            "hpmp": 3180,
            "攻魔": 101,
            "命中": 177,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    25
                ],
                [
                    4000313,
                    25
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级24": {
            "hpmp": 3320,
            "攻魔": 106,
            "命中": 186,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    30
                ],
                [
                    4000313,
                    26
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级25": {
            "hpmp": 3460,
            "攻魔": 112,
            "命中": 195,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    35
                ],
                [
                    4000313,
                    25
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级26": {
            "hpmp": 3600,
            "攻魔": 117,
            "命中": 204,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    40
                ],
                [
                    4000313,
                    26
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级27": {
            "hpmp": 3740,
            "攻魔": 122,
            "命中": 213,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    45
                ],
                [
                    4000313,
                    25
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级28": {
            "hpmp": 3880,
            "攻魔": 127,
            "命中": 223,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    50
                ],
                [
                    4000313,
                    26
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级29": {
            "hpmp": 4020,
            "攻魔": 132,
            "命中": 232,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    55
                ],
                [
                    4000313,
                    25
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级30": {
            "hpmp": 4150,
            "攻魔": 138,
            "命中": 241,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500203,
                    60
                ],
                [
                    4000313,
                    26
                ],
                [
                    0,
                    1464100
                ]
            ],
            "绑定材料": [
                null,
                4500218,
                4500033
            ]
        },
        "等级31": {
            "hpmp": 4290,
            "攻魔": 145,
            "命中": 254,
            "材料": [
                [
                    4500007,
                    6
                ],
                [
                    4500204,
                    25
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                4500022,
                4500219,
                4500033
            ]
        },
        "等级32": {
            "hpmp": 4430,
            "攻魔": 152,
            "命中": 267,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    30
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级33": {
            "hpmp": 4570,
            "攻魔": 160,
            "命中": 279,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    40
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级34": {
            "hpmp": 4710,
            "攻魔": 167,
            "命中": 292,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    50
                ],
                [
                    4000313,
                    41
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级35": {
            "hpmp": 4850,
            "攻魔": 174,
            "命中": 305,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    55
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级36": {
            "hpmp": 4980,
            "攻魔": 182,
            "命中": 318,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    60
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级37": {
            "hpmp": 5120,
            "攻魔": 189,
            "命中": 331,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    65
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级38": {
            "hpmp": 5260,
            "攻魔": 196,
            "命中": 344,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    70
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级39": {
            "hpmp": 5400,
            "攻魔": 204,
            "命中": 357,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    75
                ],
                [
                    4000313,
                    41
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级40": {
            "hpmp": 5540,
            "攻魔": 211,
            "命中": 370,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500204,
                    80
                ],
                [
                    4000313,
                    40
                ],
                [
                    0,
                    2415765
                ]
            ],
            "绑定材料": [
                null,
                4500219,
                4500033
            ]
        },
        "等级41": {
            "hpmp": 5680,
            "攻魔": 218,
            "命中": 382,
            "材料": [
                [
                    4500008,
                    6
                ],
                [
                    4500205,
                    25
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657342
                ]
            ],
            "绑定材料": [
                4500023,
                4500220,
                4500033
            ]
        },
        "等级42": {
            "hpmp": 5820,
            "攻魔": 225,
            "命中": 394,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    30
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657341
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级43": {
            "hpmp": 5950,
            "攻魔": 232,
            "命中": 406,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    40
                ],
                [
                    4000313,
                    43
                ],
                [
                    0,
                    2657342
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级44": {
            "hpmp": 6090,
            "攻魔": 239,
            "命中": 418,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    50
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657341
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级45": {
            "hpmp": 6230,
            "攻魔": 246,
            "命中": 430,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    55
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657342
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级46": {
            "hpmp": 6370,
            "攻魔": 252,
            "命中": 442,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    60
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657341
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级47": {
            "hpmp": 6510,
            "攻魔": 259,
            "命中": 454,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    65
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657342
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级48": {
            "hpmp": 6650,
            "攻魔": 266,
            "命中": 466,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    70
                ],
                [
                    4000313,
                    43
                ],
                [
                    0,
                    2657341
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级49": {
            "hpmp": 6780,
            "攻魔": 273,
            "命中": 478,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    75
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657342
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级50": {
            "hpmp": 6920,
            "攻魔": 280,
            "命中": 490,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500205,
                    80
                ],
                [
                    4000313,
                    42
                ],
                [
                    0,
                    2657341
                ]
            ],
            "绑定材料": [
                null,
                4500220,
                4500033
            ]
        },
        "等级51": {
            "hpmp": 7060,
            "攻魔": 288,
            "命中": 505,
            "材料": [
                [
                    4500009,
                    8
                ],
                [
                    4500206,
                    30
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897435
                ]
            ],
            "绑定材料": [
                4500024,
                4500221,
                4500033
            ]
        },
        "等级52": {
            "hpmp": 7200,
            "攻魔": 297,
            "命中": 520,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    40
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级53": {
            "hpmp": 7340,
            "攻魔": 306,
            "命中": 535,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    50
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级54": {
            "hpmp": 7480,
            "攻魔": 314,
            "命中": 550,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    60
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级55": {
            "hpmp": 7620,
            "攻魔": 323,
            "命中": 565,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    70
                ],
                [
                    4000313,
                    60
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级56": {
            "hpmp": 7750,
            "攻魔": 331,
            "命中": 580,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    80
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897435
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级57": {
            "hpmp": 7890,
            "攻魔": 340,
            "命中": 595,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    90
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级58": {
            "hpmp": 8030,
            "攻魔": 349,
            "命中": 610,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    100
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级59": {
            "hpmp": 8170,
            "攻魔": 357,
            "命中": 625,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    110
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级60": {
            "hpmp": 8310,
            "攻魔": 366,
            "命中": 640,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500206,
                    120
                ],
                [
                    4000313,
                    59
                ],
                [
                    0,
                    3897434
                ]
            ],
            "绑定材料": [
                null,
                4500221,
                4500033
            ]
        },
        "等级61": {
            "hpmp": 8450,
            "攻魔": 374,
            "命中": 654,
            "材料": [
                [
                    4500010,
                    8
                ],
                [
                    4500207,
                    30
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                4500025,
                4500222,
                4500033
            ]
        },
        "等级62": {
            "hpmp": 8580,
            "攻魔": 382,
            "命中": 669,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    40
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级63": {
            "hpmp": 8720,
            "攻魔": 390,
            "命中": 683,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    50
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287177
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级64": {
            "hpmp": 8860,
            "攻魔": 398,
            "命中": 697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    60
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级65": {
            "hpmp": 9000,
            "攻魔": 407,
            "命中": 711,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    70
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级66": {
            "hpmp": 9140,
            "攻魔": 415,
            "命中": 726,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    80
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287177
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级67": {
            "hpmp": 9280,
            "攻魔": 423,
            "命中": 740,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    90
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级68": {
            "hpmp": 9420,
            "攻魔": 431,
            "命中": 754,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    100
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287177
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级69": {
            "hpmp": 9550,
            "攻魔": 439,
            "命中": 768,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    110
                ],
                [
                    4000313,
                    62
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级70": {
            "hpmp": 9690,
            "攻魔": 447,
            "命中": 783,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500207,
                    120
                ],
                [
                    4000313,
                    63
                ],
                [
                    0,
                    4287178
                ]
            ],
            "绑定材料": [
                null,
                4500222,
                4500033
            ]
        },
        "等级71": {
            "hpmp": 9830,
            "攻魔": 455,
            "命中": 796,
            "材料": [
                [
                    4500011,
                    8
                ],
                [
                    4500208,
                    30
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                4500026,
                4500223,
                4500033
            ]
        },
        "等级72": {
            "hpmp": 9970,
            "攻魔": 463,
            "命中": 810,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    40
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级73": {
            "hpmp": 10110,
            "攻魔": 470,
            "命中": 823,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    50
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715896
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级74": {
            "hpmp": 10250,
            "攻魔": 478,
            "命中": 837,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    60
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级75": {
            "hpmp": 10380,
            "攻魔": 486,
            "命中": 851,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    70
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715896
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级76": {
            "hpmp": 10520,
            "攻魔": 494,
            "命中": 864,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    80
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级77": {
            "hpmp": 10660,
            "攻魔": 502,
            "命中": 878,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    90
                ],
                [
                    4000313,
                    66
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级78": {
            "hpmp": 10800,
            "攻魔": 509,
            "命中": 891,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    100
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715896
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级79": {
            "hpmp": 10940,
            "攻魔": 517,
            "命中": 905,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    110
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级80": {
            "hpmp": 11080,
            "攻魔": 525,
            "命中": 918,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500208,
                    120
                ],
                [
                    4000313,
                    65
                ],
                [
                    0,
                    4715895
                ]
            ],
            "绑定材料": [
                null,
                4500223,
                4500033
            ]
        },
        "等级81": {
            "hpmp": 11220,
            "攻魔": 534,
            "命中": 935,
            "材料": [
                [
                    4500012,
                    10
                ],
                [
                    4500209,
                    40
                ],
                [
                    4000313,
                    86
                ],
                [
                    0,
                    6484357
                ]
            ],
            "绑定材料": [
                4500027,
                4500224,
                4500033
            ]
        },
        "等级82": {
            "hpmp": 11350,
            "攻魔": 544,
            "命中": 951,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    55
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级83": {
            "hpmp": 11490,
            "攻魔": 553,
            "命中": 967,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    70
                ],
                [
                    4000313,
                    86
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级84": {
            "hpmp": 11630,
            "攻魔": 562,
            "命中": 984,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    80
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级85": {
            "hpmp": 11770,
            "攻魔": 572,
            "命中": 1000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    90
                ],
                [
                    4000313,
                    86
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级86": {
            "hpmp": 11910,
            "攻魔": 581,
            "命中": 1016,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    100
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级87": {
            "hpmp": 12050,
            "攻魔": 590,
            "命中": 1033,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    110
                ],
                [
                    4000313,
                    86
                ],
                [
                    0,
                    6484357
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级88": {
            "hpmp": 12180,
            "攻魔": 600,
            "命中": 1049,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    120
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级89": {
            "hpmp": 12320,
            "攻魔": 609,
            "命中": 1066,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    130
                ],
                [
                    4000313,
                    86
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级90": {
            "hpmp": 12460,
            "攻魔": 618,
            "命中": 1082,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500209,
                    140
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    6484356
                ]
            ],
            "绑定材料": [
                null,
                4500224,
                4500033
            ]
        },
        "等级91": {
            "hpmp": 12600,
            "攻魔": 627,
            "命中": 1098,
            "材料": [
                [
                    4500013,
                    10
                ],
                [
                    4500210,
                    40
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                4500028,
                4500225,
                4500033
            ]
        },
        "等级92": {
            "hpmp": 12740,
            "攻魔": 636,
            "命中": 1113,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    55
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级93": {
            "hpmp": 12880,
            "攻魔": 645,
            "命中": 1129,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    70
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132791
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级94": {
            "hpmp": 13020,
            "攻魔": 654,
            "命中": 1145,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    80
                ],
                [
                    4000313,
                    89
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级95": {
            "hpmp": 13150,
            "攻魔": 663,
            "命中": 1161,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    90
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级96": {
            "hpmp": 13290,
            "攻魔": 672,
            "命中": 1177,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    100
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级97": {
            "hpmp": 13430,
            "攻魔": 681,
            "命中": 1192,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    110
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132791
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级98": {
            "hpmp": 13570,
            "攻魔": 690,
            "命中": 1208,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    120
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级99": {
            "hpmp": 13710,
            "攻魔": 699,
            "命中": 1224,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    130
                ],
                [
                    4000313,
                    89
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级100": {
            "hpmp": 13850,
            "攻魔": 709,
            "命中": 1240,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500210,
                    140
                ],
                [
                    4000313,
                    90
                ],
                [
                    0,
                    7132792
                ]
            ],
            "绑定材料": [
                null,
                4500225,
                4500033
            ]
        },
        "等级101": {
            "hpmp": 13980,
            "攻魔": 717,
            "命中": 1255,
            "材料": [
                [
                    4500014,
                    10
                ],
                [
                    4500211,
                    40
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                4500029,
                4500226,
                4500033
            ]
        },
        "等级102": {
            "hpmp": 14120,
            "攻魔": 726,
            "命中": 1270,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    55
                ],
                [
                    4000313,
                    95
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级103": {
            "hpmp": 14260,
            "攻魔": 735,
            "命中": 1286,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    70
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846070
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级104": {
            "hpmp": 14400,
            "攻魔": 744,
            "命中": 1301,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    80
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级105": {
            "hpmp": 14540,
            "攻魔": 752,
            "命中": 1317,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    90
                ],
                [
                    4000313,
                    95
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级106": {
            "hpmp": 14680,
            "攻魔": 761,
            "命中": 1332,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    100
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级107": {
            "hpmp": 14820,
            "攻魔": 770,
            "命中": 1347,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    110
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级108": {
            "hpmp": 14950,
            "攻魔": 779,
            "命中": 1363,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    120
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级109": {
            "hpmp": 15090,
            "攻魔": 788,
            "命中": 1378,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    130
                ],
                [
                    4000313,
                    95
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级110": {
            "hpmp": 15230,
            "攻魔": 796,
            "命中": 1393,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500211,
                    140
                ],
                [
                    4000313,
                    94
                ],
                [
                    0,
                    7846071
                ]
            ],
            "绑定材料": [
                null,
                4500226,
                4500033
            ]
        },
        "等级111": {
            "hpmp": 15370,
            "攻魔": 807,
            "命中": 1411,
            "材料": [
                [
                    4500015,
                    12
                ],
                [
                    4500212,
                    50
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                4500030,
                4500227,
                4500033
            ]
        },
        "等级112": {
            "hpmp": 15510,
            "攻魔": 817,
            "命中": 1429,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    65
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356813
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级113": {
            "hpmp": 15650,
            "攻魔": 827,
            "命中": 1447,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    80
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级114": {
            "hpmp": 15780,
            "攻魔": 837,
            "命中": 1465,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    95
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级115": {
            "hpmp": 15920,
            "攻魔": 848,
            "命中": 1483,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    110
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356813
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级116": {
            "hpmp": 16060,
            "攻魔": 858,
            "命中": 1502,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    125
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级117": {
            "hpmp": 16200,
            "攻魔": 868,
            "命中": 1520,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    135
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级118": {
            "hpmp": 16340,
            "攻魔": 879,
            "命中": 1538,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    145
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    10356813
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级119": {
            "hpmp": 16480,
            "攻魔": 889,
            "命中": 1556,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    155
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356814
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级120": {
            "hpmp": 16620,
            "攻魔": 899,
            "命中": 1574,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500212,
                    165
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    10356813
                ]
            ],
            "绑定材料": [
                null,
                4500227,
                4500033
            ]
        },
        "等级121": {
            "hpmp": 16750,
            "攻魔": 909,
            "命中": 1591,
            "材料": [
                [
                    4500016,
                    12
                ],
                [
                    4500213,
                    50
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                4500031,
                4500228,
                4500033
            ]
        },
        "等级122": {
            "hpmp": 16890,
            "攻魔": 919,
            "命中": 1609,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    65
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级123": {
            "hpmp": 17030,
            "攻魔": 929,
            "命中": 1627,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    80
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392496
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级124": {
            "hpmp": 17170,
            "攻魔": 939,
            "命中": 1644,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    95
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级125": {
            "hpmp": 17310,
            "攻魔": 950,
            "命中": 1662,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    110
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级126": {
            "hpmp": 17450,
            "攻魔": 960,
            "命中": 1679,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    125
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级127": {
            "hpmp": 17580,
            "攻魔": 970,
            "命中": 1697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    135
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级128": {
            "hpmp": 17720,
            "攻魔": 980,
            "命中": 1715,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    145
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级129": {
            "hpmp": 17860,
            "攻魔": 990,
            "命中": 1732,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    155
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        },
        "等级130": {
            "hpmp": 18000,
            "攻魔": 1000,
            "命中": 1750,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500213,
                    165
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    11392495
                ]
            ],
            "绑定材料": [
                null,
                4500228,
                4500033
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {

    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级0";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 0 || 当前星级 > 130) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    // cm.sendOk(下一星级+下一等级);
    // cm.dispose();
    // return;
    // // 检查是否达到最高等级
    if (当前星级 >= 130) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }


    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rmp+" + (进阶数据[强化物品][下一等级]["hpmp"] + 123) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + 进阶数据[强化物品][下一等级]["四维"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["攻魔"] ? "[#r攻魔+" + (进阶数据[强化物品][下一等级]["攻魔"] + 24) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双防"] ? "[#r双防+" + 进阶数据[强化物品][下一等级]["双防"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["速度"] ? "[#r速度+" + 进阶数据[强化物品][下一等级]["速度"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[强化物品][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["命中"] ? "[#r命中+" + (进阶数据[强化物品][下一等级]["命中"] + 9.5) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["回避"] ? "[#r回避+" + 进阶数据[强化物品][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                if (需要物品id == 4033104 ||
                    需要物品id == 4500202 ||
                    需要物品id == 4500203 ||
                    需要物品id == 4500204 ||
                    需要物品id == 4500205 ||
                    需要物品id == 4500206 ||
                    需要物品id == 4500207 ||
                    需要物品id == 4500208 ||
                    需要物品id == 4500209 ||
                    需要物品id == 4500210 ||
                    需要物品id == 4500211 ||
                    需要物品id == 4500212 ||
                    需要物品id == 4500213) {
                    cm.dispose();
                    cm.openNpc(2013000, "武器材料礼包");
                    return;
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            // equip.setStr(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setDex(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setInt(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setLuk(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setMp(123+ 进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setWatk(24 + 进阶数据[强化物品][下一等级]["攻魔"]);
            equip.setMatk(24 + 进阶数据[强化物品][下一等级]["攻魔"]);
            // equip.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
            equip.setAcc(10 + 进阶数据[强化物品][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                // item.setStr(进阶数据[强化物品][下一等级]["四维"]);
                // item.setDex(进阶数据[强化物品][下一等级]["四维"]);
                // item.setInt(进阶数据[强化物品][下一等级]["四维"]);
                // item.setLuk(进阶数据[强化物品][下一等级]["四维"]);
                //  item.setHp(item.getHp() + 进阶数据[强化物品][下一等级]["hpmp"]);
                item.setMp(123 + 进阶数据[强化物品][下一等级]["hpmp"]);
                item.setWatk(24+ 进阶数据[强化物品][下一等级]["攻魔"]);
                item.setMatk(24+ 进阶数据[强化物品][下一等级]["攻魔"]);
                // item.setAvoid(item.getAvoid() + 进阶数据[强化物品][下一等级]["回避"]);
                item.setAcc(10 + 进阶数据[强化物品][下一等级]["命中"]);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}





function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}