var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 130;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级0", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1902000": {
        "等级0": {
            "hpmp": 0,
            "双攻": 0,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级1": {
            "hpmp": 31,
            "双攻": 12,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    2
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级2": {
            "hpmp": 61,
            "双攻": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    2
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级3": {
            "hpmp": 92,
            "双攻": 37,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    3
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级4": {
            "hpmp": 123,
            "双攻": 49,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    4
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级5": {
            "hpmp": 154,
            "双攻": 61,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4033062,
                    5
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500916,
                4500034
            ]
        },
        "等级6": {
            "hpmp": 184,
            "双攻": 74,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    6
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577910
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级7": {
            "hpmp": 215,
            "双攻": 86,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    7
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级8": {
            "hpmp": 246,
            "双攻": 98,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4033062,
                    8
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500916,
                4500034
            ]
        },
        "等级9": {
            "hpmp": 277,
            "双攻": 111,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    9
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级10": {
            "hpmp": 307,
            "双攻": 123,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033062,
                    10
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500916,
                4500034
            ]
        },
        "等级11": {
            "hpmp": 341,
            "双攻": 136,
            "材料": [
                [
                    4001085,
                    19
                ],
                [
                    4500902,
                    2
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                4500020,
                4500917,
                4500034
            ]
        },
        "等级12": {
            "hpmp": 374,
            "双攻": 149,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    3
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级13": {
            "hpmp": 407,
            "双攻": 163,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    4
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级14": {
            "hpmp": 440,
            "双攻": 176,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    5
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级15": {
            "hpmp": 474,
            "双攻": 189,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    6
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级16": {
            "hpmp": 507,
            "双攻": 203,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    6
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级17": {
            "hpmp": 540,
            "双攻": 216,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    7
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级18": {
            "hpmp": 573,
            "双攻": 229,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    8
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级19": {
            "hpmp": 607,
            "双攻": 243,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    9
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级20": {
            "hpmp": 640,
            "双攻": 256,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500902,
                    10
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500917,
                4500034
            ]
        },
        "等级21": {
            "hpmp": 679,
            "双攻": 272,
            "材料": [
                [
                    4500006,
                    24
                ],
                [
                    4500903,
                    3
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                4500021,
                4500918,
                4500034
            ]
        },
        "等级22": {
            "hpmp": 718,
            "双攻": 287,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    4
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级23": {
            "hpmp": 758,
            "双攻": 303,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    5
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级24": {
            "hpmp": 797,
            "双攻": 319,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    6
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级25": {
            "hpmp": 836,
            "双攻": 335,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    7
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级26": {
            "hpmp": 876,
            "双攻": 350,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    8
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级27": {
            "hpmp": 915,
            "双攻": 366,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    9
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级28": {
            "hpmp": 954,
            "双攻": 382,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    10
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级29": {
            "hpmp": 993,
            "双攻": 397,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    11
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级30": {
            "hpmp": 1033,
            "双攻": 413,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500903,
                    12
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500918,
                4500034
            ]
        },
        "等级31": {
            "hpmp": 1088,
            "双攻": 435,
            "材料": [
                [
                    4500007,
                    36
                ],
                [
                    4500904,
                    5
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                4500022,
                4500919,
                4500034
            ]
        },
        "等级32": {
            "hpmp": 1143,
            "双攻": 457,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    6
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级33": {
            "hpmp": 1198,
            "双攻": 479,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    8
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级34": {
            "hpmp": 1253,
            "双攻": 501,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    10
                ],
                [
                    4000487,
                    41
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级35": {
            "hpmp": 1308,
            "双攻": 523,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    11
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级36": {
            "hpmp": 1363,
            "双攻": 545,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    12
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级37": {
            "hpmp": 1418,
            "双攻": 567,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    13
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级38": {
            "hpmp": 1473,
            "双攻": 589,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    14
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级39": {
            "hpmp": 1528,
            "双攻": 611,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    15
                ],
                [
                    4000487,
                    41
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级40": {
            "hpmp": 1584,
            "双攻": 633,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500904,
                    16
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500919,
                4500034
            ]
        },
        "等级41": {
            "hpmp": 1635,
            "双攻": 654,
            "材料": [
                [
                    4500008,
                    36
                ],
                [
                    4500905,
                    5
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                4500023,
                4500920,
                4500034
            ]
        },
        "等级42": {
            "hpmp": 1687,
            "双攻": 675,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    6
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级43": {
            "hpmp": 1738,
            "双攻": 695,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    8
                ],
                [
                    4000487,
                    43
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级44": {
            "hpmp": 1790,
            "双攻": 716,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    10
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级45": {
            "hpmp": 1841,
            "双攻": 737,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    11
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级46": {
            "hpmp": 1893,
            "双攻": 757,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    12
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级47": {
            "hpmp": 1944,
            "双攻": 778,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    13
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级48": {
            "hpmp": 1996,
            "双攻": 798,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    14
                ],
                [
                    4000487,
                    43
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级49": {
            "hpmp": 2047,
            "双攻": 819,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    15
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级50": {
            "hpmp": 2099,
            "双攻": 840,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500905,
                    16
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500920,
                4500034
            ]
        },
        "等级51": {
            "hpmp": 2163,
            "双攻": 865,
            "材料": [
                [
                    4500009,
                    48
                ],
                [
                    4500906,
                    6
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                4500024,
                4500921,
                4500034
            ]
        },
        "等级52": {
            "hpmp": 2228,
            "双攻": 891,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    8
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级53": {
            "hpmp": 2292,
            "双攻": 917,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    10
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级54": {
            "hpmp": 2357,
            "双攻": 943,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    12
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级55": {
            "hpmp": 2421,
            "双攻": 969,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    14
                ],
                [
                    4000487,
                    60
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级56": {
            "hpmp": 2486,
            "双攻": 994,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    16
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级57": {
            "hpmp": 2550,
            "双攻": 1020,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    18
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级58": {
            "hpmp": 2615,
            "双攻": 1046,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    20
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级59": {
            "hpmp": 2679,
            "双攻": 1072,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    22
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级60": {
            "hpmp": 2744,
            "双攻": 1098,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500906,
                    24
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500921,
                4500034
            ]
        },
        "等级61": {
            "hpmp": 2805,
            "双攻": 1122,
            "材料": [
                [
                    4500010,
                    48
                ],
                [
                    4500907,
                    6
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                4500025,
                4500922,
                4500034
            ]
        },
        "等级62": {
            "hpmp": 2866,
            "双攻": 1146,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    8
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级63": {
            "hpmp": 2927,
            "双攻": 1171,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    10
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级64": {
            "hpmp": 2988,
            "双攻": 1195,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    12
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级65": {
            "hpmp": 3049,
            "双攻": 1220,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    14
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级66": {
            "hpmp": 3110,
            "双攻": 1244,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    16
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级67": {
            "hpmp": 3171,
            "双攻": 1268,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    18
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级68": {
            "hpmp": 3232,
            "双攻": 1293,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    20
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级69": {
            "hpmp": 3293,
            "双攻": 1317,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    22
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级70": {
            "hpmp": 3354,
            "双攻": 1341,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500907,
                    24
                ],
                [
                    4000487,
                    63
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500922,
                4500034
            ]
        },
        "等级71": {
            "hpmp": 3412,
            "双攻": 1365,
            "材料": [
                [
                    4500011,
                    48
                ],
                [
                    4500908,
                    6
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                4500026,
                4500923,
                4500034
            ]
        },
        "等级72": {
            "hpmp": 3470,
            "双攻": 1388,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    8
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级73": {
            "hpmp": 3529,
            "双攻": 1411,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    10
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级74": {
            "hpmp": 3587,
            "双攻": 1435,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    12
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级75": {
            "hpmp": 3645,
            "双攻": 1458,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    14
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级76": {
            "hpmp": 3704,
            "双攻": 1481,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    16
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级77": {
            "hpmp": 3762,
            "双攻": 1505,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    18
                ],
                [
                    4000487,
                    66
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级78": {
            "hpmp": 3820,
            "双攻": 1528,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    20
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级79": {
            "hpmp": 3878,
            "双攻": 1551,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    22
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级80": {
            "hpmp": 3937,
            "双攻": 1575,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500908,
                    24
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500923,
                4500034
            ]
        },
        "等级81": {
            "hpmp": 4007,
            "双攻": 1603,
            "材料": [
                [
                    4500012,
                    60
                ],
                [
                    4500909,
                    8
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                4500027,
                4500924,
                4500034
            ]
        },
        "等级82": {
            "hpmp": 4077,
            "双攻": 1631,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    11
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级83": {
            "hpmp": 4147,
            "双攻": 1659,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    14
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级84": {
            "hpmp": 4217,
            "双攻": 1687,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    16
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级85": {
            "hpmp": 4287,
            "双攻": 1715,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    18
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级86": {
            "hpmp": 4357,
            "双攻": 1743,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    20
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级87": {
            "hpmp": 4427,
            "双攻": 1771,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    22
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级88": {
            "hpmp": 4497,
            "双攻": 1799,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    24
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级89": {
            "hpmp": 4567,
            "双攻": 1827,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    26
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级90": {
            "hpmp": 4637,
            "双攻": 1855,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500909,
                    28
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500924,
                4500034
            ]
        },
        "等级91": {
            "hpmp": 4705,
            "双攻": 1882,
            "材料": [
                [
                    4500013,
                    60
                ],
                [
                    4500910,
                    8
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                4500028,
                4500925,
                4500034
            ]
        },
        "等级92": {
            "hpmp": 4772,
            "双攻": 1909,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    11
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级93": {
            "hpmp": 4840,
            "双攻": 1936,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    14
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级94": {
            "hpmp": 4908,
            "双攻": 1963,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    16
                ],
                [
                    4000487,
                    89
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级95": {
            "hpmp": 4975,
            "双攻": 1990,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    18
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级96": {
            "hpmp": 5043,
            "双攻": 2017,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    20
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级97": {
            "hpmp": 5111,
            "双攻": 2044,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    22
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级98": {
            "hpmp": 5178,
            "双攻": 2071,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    24
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级99": {
            "hpmp": 5246,
            "双攻": 2098,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    26
                ],
                [
                    4000487,
                    89
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级100": {
            "hpmp": 5314,
            "双攻": 2126,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500910,
                    28
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500925,
                4500034
            ]
        },
        "等级101": {
            "hpmp": 5380,
            "双攻": 2152,
            "材料": [
                [
                    4500014,
                    60
                ],
                [
                    4500911,
                    8
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                4500029,
                4500926,
                4500034
            ]
        },
        "等级102": {
            "hpmp": 5445,
            "双攻": 2178,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    11
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级103": {
            "hpmp": 5511,
            "双攻": 2205,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    14
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级104": {
            "hpmp": 5577,
            "双攻": 2231,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    16
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级105": {
            "hpmp": 5643,
            "双攻": 2257,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    18
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级106": {
            "hpmp": 5709,
            "双攻": 2284,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    20
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级107": {
            "hpmp": 5775,
            "双攻": 2310,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    22
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692141
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级108": {
            "hpmp": 5840,
            "双攻": 2336,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    24
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级109": {
            "hpmp": 5906,
            "双攻": 2363,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    26
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级110": {
            "hpmp": 5972,
            "双攻": 2389,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500911,
                    28
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500926,
                4500034
            ]
        },
        "等级111": {
            "hpmp": 6049,
            "双攻": 2420,
            "材料": [
                [
                    4500015,
                    72
                ],
                [
                    4500912,
                    10
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                4500030,
                4500927,
                4500034
            ]
        },
        "等级112": {
            "hpmp": 6126,
            "双攻": 2451,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    13
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级113": {
            "hpmp": 6204,
            "双攻": 2481,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    16
                ],
                [
                    4000487,
                    118
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级114": {
            "hpmp": 6281,
            "双攻": 2512,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    19
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级115": {
            "hpmp": 6358,
            "双攻": 2543,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    22
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级116": {
            "hpmp": 6435,
            "双攻": 2574,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    25
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级117": {
            "hpmp": 6512,
            "双攻": 2605,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    27
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级118": {
            "hpmp": 6589,
            "双攻": 2636,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    29
                ],
                [
                    4000487,
                    118
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级119": {
            "hpmp": 6667,
            "双攻": 2667,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    31
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级120": {
            "hpmp": 6744,
            "双攻": 2697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500912,
                    33
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500927,
                4500034
            ]
        },
        "等级121": {
            "hpmp": 6819,
            "双攻": 2728,
            "材料": [
                [
                    4500016,
                    72
                ],
                [
                    4500913,
                    10
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                4500031,
                4500928,
                4500034
            ]
        },
        "等级122": {
            "hpmp": 6895,
            "双攻": 2758,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    13
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级123": {
            "hpmp": 6971,
            "双攻": 2788,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    16
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级124": {
            "hpmp": 7046,
            "双攻": 2818,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    19
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级125": {
            "hpmp": 7122,
            "双攻": 2849,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    22
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级126": {
            "hpmp": 7198,
            "双攻": 2879,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    25
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级127": {
            "hpmp": 7273,
            "双攻": 2909,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    27
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级128": {
            "hpmp": 7349,
            "双攻": 2939,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    29
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级129": {
            "hpmp": 7424,
            "双攻": 2970,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    31
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        },
        "等级130": {
            "hpmp": 7500,
            "双攻": 3000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500913,
                    33
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500928,
                4500034
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {

    action(1, 0, 0);
}



function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级0";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 0 || 当前星级 > 130) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    // cm.sendOk(下一星级+下一等级);
    // cm.dispose();
    // return;
    // // 检查是否达到最高等级
    if (当前星级 >= 130) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }


    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[强化物品][下一等级]["hpmp"]+ "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + 进阶数据[强化物品][下一等级]["四维"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双攻"] ? "[#r双攻+" + 进阶数据[强化物品][下一等级]["双攻"] + "]" : "";
        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();d
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"]; 
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                var 需要物品id = cm.getBossLog("需要物品id");
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 || 需要物品id == 4001085 || 需要物品id == 4500006 || 需要物品id == 4500007 || 需要物品id == 4500008 || 需要物品id == 4500009 || 需要物品id == 4500010 || 需要物品id == 4500011 || 需要物品id == 4500012 || 需要物品id == 4500013 || 需要物品id == 4500014 || 需要物品id == 4500015 || 需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                    return;
                }
                if (需要物品id == 4033062 || 需要物品id == 4500902 || 需要物品id == 4500903 || 需要物品id == 4500904 || 需要物品id == 4500905 || 需要物品id == 4500906 || 需要物品id == 4500907 || 需要物品id == 4500908 || 需要物品id == 4500909 || 需要物品id == 4500910 || 需要物品id == 4500911 || 需要物品id == 4500912 || 需要物品id == 4500913) {
                    cm.dispose();
                    cm.openNpc(9130000, "坐骑材料礼包");
                    return;
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            equip.setStr(10);
            equip.setDex(10);
            equip.setInt(10);
            equip.setLuk(10);
            equip.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
            equip.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
            equip.setWdef(6);
            equip.setMdef(6);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                item.setStr(10);
                item.setDex(10);
                item.setInt(10);
                item.setLuk(10);
                item.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
                item.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
                item.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setWdef(6);
                item.setMdef(6);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}


function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}