var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 130;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级0", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1112751": {
        "等级0": {
            "四维": 10,
            "双防": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级1": {
            "四维": 10,
            "双防": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    2
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级2": {
            "四维": 21,
            "双防": 49,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    2
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级3": {
            "四维": 31,
            "双防": 74,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    3
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级4": {
            "四维": 41,
            "双防": 98,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    4
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级5": {
            "四维": 51,
            "双防": 123,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4033255,
                    5
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4501116,
                4500034
            ]
        },
        "等级6": {
            "四维": 62,
            "双防": 147,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    6
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577910
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级7": {
            "四维": 72,
            "双防": 172,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    7
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级8": {
            "四维": 82,
            "双防": 197,
            "材料": [
                [
                    4001084,
                    8
                ],
                [
                    4033255,
                    8
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4501116,
                4500034
            ]
        },
        "等级9": {
            "四维": 92,
            "双防": 221,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    9
                ],
                [
                    4000487,
                    16
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级10": {
            "四维": 103,
            "双防": 246,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4033255,
                    10
                ],
                [
                    4000487,
                    15
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4501116,
                4500034
            ]
        },
        "等级11": {
            "四维": 114,
            "双防": 272,
            "材料": [
                [
                    4001085,
                    19
                ],
                [
                    4501102,
                    2
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                4500020,
                4501117,
                4500034
            ]
        },
        "等级12": {
            "四维": 125,
            "双防": 299,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    3
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级13": {
            "四维": 136,
            "双防": 326,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    4
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级14": {
            "四维": 147,
            "双防": 352,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    5
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级15": {
            "四维": 158,
            "双防": 379,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    6
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级16": {
            "四维": 169,
            "双防": 405,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    6
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级17": {
            "四维": 180,
            "双防": 432,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    7
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级18": {
            "四维": 191,
            "双防": 459,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    8
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级19": {
            "四维": 202,
            "双防": 485,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    9
                ],
                [
                    4000487,
                    19
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级20": {
            "四维": 213,
            "双防": 512,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501102,
                    10
                ],
                [
                    4000487,
                    20
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4501117,
                4500034
            ]
        },
        "等级21": {
            "四维": 226,
            "双防": 543,
            "材料": [
                [
                    4500006,
                    24
                ],
                [
                    4501103,
                    3
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                4500021,
                4501118,
                4500034
            ]
        },
        "等级22": {
            "四维": 239,
            "双防": 575,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    4
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级23": {
            "四维": 253,
            "双防": 606,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    5
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级24": {
            "四维": 266,
            "双防": 638,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    6
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级25": {
            "四维": 279,
            "双防": 669,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    7
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级26": {
            "四维": 292,
            "双防": 700,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    8
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级27": {
            "四维": 305,
            "双防": 732,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    9
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级28": {
            "四维": 318,
            "双防": 763,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    10
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级29": {
            "四维": 331,
            "双防": 795,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    11
                ],
                [
                    4000487,
                    25
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级30": {
            "四维": 344,
            "双防": 826,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501103,
                    12
                ],
                [
                    4000487,
                    26
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4501118,
                4500034
            ]
        },
        "等级31": {
            "四维": 363,
            "双防": 870,
            "材料": [
                [
                    4500007,
                    36
                ],
                [
                    4501104,
                    5
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                4500022,
                4501119,
                4500034
            ]
        },
        "等级32": {
            "四维": 381,
            "双防": 914,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    6
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级33": {
            "四维": 399,
            "双防": 958,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    8
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级34": {
            "四维": 418,
            "双防": 1002,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    10
                ],
                [
                    4000487,
                    41
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级35": {
            "四维": 436,
            "双防": 1047,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    11
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级36": {
            "四维": 454,
            "双防": 1091,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    12
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级37": {
            "四维": 473,
            "双防": 1135,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    13
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级38": {
            "四维": 491,
            "双防": 1179,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    14
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级39": {
            "四维": 509,
            "双防": 1223,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    15
                ],
                [
                    4000487,
                    41
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级40": {
            "四维": 528,
            "双防": 1267,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501104,
                    16
                ],
                [
                    4000487,
                    40
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4501119,
                4500034
            ]
        },
        "等级41": {
            "四维": 545,
            "双防": 1308,
            "材料": [
                [
                    4500008,
                    36
                ],
                [
                    4501105,
                    5
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                4500023,
                4501120,
                4500034
            ]
        },
        "等级42": {
            "四维": 562,
            "双防": 1349,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    6
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级43": {
            "四维": 579,
            "双防": 1391,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    8
                ],
                [
                    4000487,
                    43
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级44": {
            "四维": 596,
            "双防": 1432,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    10
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级45": {
            "四维": 614,
            "双防": 1473,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    11
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级46": {
            "四维": 631,
            "双防": 1514,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    12
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级47": {
            "四维": 648,
            "双防": 1555,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    13
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级48": {
            "四维": 665,
            "双防": 1597,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    14
                ],
                [
                    4000487,
                    43
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级49": {
            "四维": 682,
            "双防": 1638,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    15
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级50": {
            "四维": 700,
            "双防": 1679,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501105,
                    16
                ],
                [
                    4000487,
                    42
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4501120,
                4500034
            ]
        },
        "等级51": {
            "四维": 721,
            "双防": 1731,
            "材料": [
                [
                    4500009,
                    48
                ],
                [
                    4501106,
                    6
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                4500024,
                4501121,
                4500034
            ]
        },
        "等级52": {
            "四维": 743,
            "双防": 1782,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    8
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级53": {
            "四维": 764,
            "双防": 1834,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    10
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级54": {
            "四维": 786,
            "双防": 1886,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    12
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级55": {
            "四维": 807,
            "双防": 1937,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    14
                ],
                [
                    4000487,
                    60
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级56": {
            "四维": 829,
            "双防": 1989,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    16
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级57": {
            "四维": 850,
            "双防": 2040,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    18
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级58": {
            "四维": 872,
            "双防": 2092,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    20
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级59": {
            "四维": 893,
            "双防": 2144,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    22
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级60": {
            "四维": 915,
            "双防": 2195,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501106,
                    24
                ],
                [
                    4000487,
                    59
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4501121,
                4500034
            ]
        },
        "等级61": {
            "四维": 935,
            "双防": 2244,
            "材料": [
                [
                    4500010,
                    48
                ],
                [
                    4501107,
                    6
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                4500025,
                4501122,
                4500034
            ]
        },
        "等级62": {
            "四维": 955,
            "双防": 2293,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    8
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级63": {
            "四维": 976,
            "双防": 2341,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    10
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级64": {
            "四维": 996,
            "双防": 2390,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    12
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级65": {
            "四维": 1016,
            "双防": 2439,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    14
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级66": {
            "四维": 1037,
            "双防": 2488,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    16
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级67": {
            "四维": 1057,
            "双防": 2537,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    18
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级68": {
            "四维": 1077,
            "双防": 2585,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    20
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级69": {
            "四维": 1098,
            "双防": 2634,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    22
                ],
                [
                    4000487,
                    62
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级70": {
            "四维": 1118,
            "双防": 2683,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501107,
                    24
                ],
                [
                    4000487,
                    63
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4501122,
                4500034
            ]
        },
        "等级71": {
            "四维": 1137,
            "双防": 2730,
            "材料": [
                [
                    4500011,
                    48
                ],
                [
                    4501108,
                    6
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                4500026,
                4501123,
                4500034
            ]
        },
        "等级72": {
            "四维": 1157,
            "双防": 2776,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    8
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级73": {
            "四维": 1176,
            "双防": 2823,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    10
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级74": {
            "四维": 1196,
            "双防": 2870,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    12
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级75": {
            "四维": 1215,
            "双防": 2916,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    14
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级76": {
            "四维": 1235,
            "双防": 2963,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    16
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级77": {
            "四维": 1254,
            "双防": 3009,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    18
                ],
                [
                    4000487,
                    66
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级78": {
            "四维": 1273,
            "双防": 3056,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    20
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级79": {
            "四维": 1293,
            "双防": 3103,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    22
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级80": {
            "四维": 1312,
            "双防": 3149,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501108,
                    24
                ],
                [
                    4000487,
                    65
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4501123,
                4500034
            ]
        },
        "等级81": {
            "四维": 1336,
            "双防": 3205,
            "材料": [
                [
                    4500012,
                    60
                ],
                [
                    4501109,
                    8
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                4500027,
                4501124,
                4500034
            ]
        },
        "等级82": {
            "四维": 1359,
            "双防": 3261,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    11
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级83": {
            "四维": 1382,
            "双防": 3318,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    14
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级84": {
            "四维": 1406,
            "双防": 3374,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    16
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级85": {
            "四维": 1429,
            "双防": 3430,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    18
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级86": {
            "四维": 1452,
            "双防": 3486,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    20
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级87": {
            "四维": 1476,
            "双防": 3542,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    22
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级88": {
            "四维": 1499,
            "双防": 3598,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    24
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级89": {
            "四维": 1522,
            "双防": 3654,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    26
                ],
                [
                    4000487,
                    86
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级90": {
            "四维": 1546,
            "双防": 3710,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501109,
                    28
                ],
                [
                    4000487,
                    85
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4501124,
                4500034
            ]
        },
        "等级91": {
            "四维": 1568,
            "双防": 3764,
            "材料": [
                [
                    4500013,
                    60
                ],
                [
                    4501110,
                    8
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                4500028,
                4501125,
                4500034
            ]
        },
        "等级92": {
            "四维": 1591,
            "双防": 3818,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    11
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级93": {
            "四维": 1613,
            "双防": 3872,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    14
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级94": {
            "四维": 1636,
            "双防": 3926,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    16
                ],
                [
                    4000487,
                    89
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级95": {
            "四维": 1659,
            "双防": 3980,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    18
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级96": {
            "四维": 1681,
            "双防": 4035,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    20
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级97": {
            "四维": 1704,
            "双防": 4089,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    22
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级98": {
            "四维": 1726,
            "双防": 4143,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    24
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级99": {
            "四维": 1749,
            "双防": 4197,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    26
                ],
                [
                    4000487,
                    89
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级100": {
            "四维": 1771,
            "双防": 4251,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501110,
                    28
                ],
                [
                    4000487,
                    90
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4501125,
                4500034
            ]
        },
        "等级101": {
            "四维": 1793,
            "双防": 4304,
            "材料": [
                [
                    4500014,
                    60
                ],
                [
                    4501111,
                    8
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                4500029,
                4501126,
                4500034
            ]
        },
        "等级102": {
            "四维": 1815,
            "双防": 4356,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    11
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级103": {
            "四维": 1837,
            "双防": 4409,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    14
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级104": {
            "四维": 1859,
            "双防": 4462,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    16
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级105": {
            "四维": 1881,
            "双防": 4514,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    18
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级106": {
            "四维": 1903,
            "双防": 4567,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    20
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级107": {
            "四维": 1925,
            "双防": 4620,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    22
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692141
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级108": {
            "四维": 1947,
            "双防": 4672,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    24
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级109": {
            "四维": 1969,
            "双防": 4725,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    26
                ],
                [
                    4000487,
                    95
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级110": {
            "四维": 1991,
            "双防": 4778,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501111,
                    28
                ],
                [
                    4000487,
                    94
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4501126,
                4500034
            ]
        },
        "等级111": {
            "四维": 2016,
            "双防": 4840,
            "材料": [
                [
                    4500015,
                    72
                ],
                [
                    4501112,
                    10
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                4500030,
                4501127,
                4500034
            ]
        },
        "等级112": {
            "四维": 2042,
            "双防": 4901,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    13
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级113": {
            "四维": 2068,
            "双防": 4963,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    16
                ],
                [
                    4000487,
                    118
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级114": {
            "四维": 2094,
            "双防": 5025,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    19
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级115": {
            "四维": 2119,
            "双防": 5086,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    22
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级116": {
            "四维": 2145,
            "双防": 5148,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    25
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级117": {
            "四维": 2171,
            "双防": 5210,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    27
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级118": {
            "四维": 2197,
            "双防": 5271,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    29
                ],
                [
                    4000487,
                    118
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级119": {
            "四维": 2222,
            "双防": 5333,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    31
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级120": {
            "四维": 2248,
            "双防": 5395,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501112,
                    33
                ],
                [
                    4000487,
                    119
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4501127,
                4500034
            ]
        },
        "等级121": {
            "四维": 2273,
            "双防": 5455,
            "材料": [
                [
                    4500016,
                    72
                ],
                [
                    4501113,
                    10
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                4500031,
                4501128,
                4500034
            ]
        },
        "等级122": {
            "四维": 2298,
            "双防": 5516,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    13
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级123": {
            "四维": 2324,
            "双防": 5576,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    16
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级124": {
            "四维": 2349,
            "双防": 5637,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    19
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级125": {
            "四维": 2374,
            "双防": 5697,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    22
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级126": {
            "四维": 2399,
            "双防": 5758,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    25
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级127": {
            "四维": 2424,
            "双防": 5818,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    27
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级128": {
            "四维": 2450,
            "双防": 5879,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    29
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级129": {
            "四维": 2475,
            "双防": 5939,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    31
                ],
                [
                    4000487,
                    125
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        },
        "等级130": {
            "四维": 2500,
            "双防": 6000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4501113,
                    33
                ],
                [
                    4000487,
                    124
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4501128,
                4500034
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {

    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级0";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 0 || 当前星级 > 130) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    // cm.sendOk(下一星级+下一等级);
    // cm.dispose();
    // return;
    // // 检查是否达到最高等级
    if (当前星级 >= 130) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }


    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rhp+" + 进阶数据[强化物品][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rmp+" + 进阶数据[强化物品][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + (进阶数据[强化物品][下一等级]["四维"] + 25) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[强化物品][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双防"] ? "[#r双防+" + (进阶数据[强化物品][下一等级]["双防"] + 55) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["速度"] ? "[#r速度+" + 进阶数据[强化物品][下一等级]["速度"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[强化物品][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["命中"] ? "[#r命中+" + 进阶数据[强化物品][下一等级]["命中"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["回避"] ? "[#r回避+" + 进阶数据[强化物品][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4000487 || 需要物品id == 4500034) {
                    cm.dispose();
                    cm.openNpc(9130000, "暗影币礼包");
                    return;
                }
                if (需要物品id == 4001084 || 需要物品id == 4001085 || 需要物品id == 4500006 || 需要物品id == 4500007 || 需要物品id == 4500008 || 需要物品id == 4500009 || 需要物品id == 4500010 || 需要物品id == 4500011 || 需要物品id == 4500012 || 需要物品id == 4500013 || 需要物品id == 4500014 || 需要物品id == 4500015 || 需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                    return;
                }
                if (需要物品id == 4033255 || 需要物品id == 4501102 || 需要物品id == 4501103 || 需要物品id == 4501104 || 需要物品id == 4501105 || 需要物品id == 4501106 || 需要物品id == 4501107 || 需要物品id == 4501108 || 需要物品id == 4501109 || 需要物品id == 4501110 || 需要物品id == 4501111 || 需要物品id == 4501112 || 需要物品id == 4501113) {
                    cm.dispose();
                    cm.openNpc(9130000, "神环材料礼包");
                    return;
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            equip.setStr(25 + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setDex(25 + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setInt(25 + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setLuk(25 + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setHp(198);
            // equip.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
            // equip.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
            // equip.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
            equip.setWdef(55 + 进阶数据[强化物品][下一等级]["双防"]);
            equip.setMdef(55 + 进阶数据[强化物品][下一等级]["双防"]);
            // equip.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
            // equip.setAcc(进阶数据[强化物品][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                item.setStr(25 + 进阶数据[强化物品][下一等级]["四维"]);
                item.setDex(25 + 进阶数据[强化物品][下一等级]["四维"]);
                item.setInt(25 + 进阶数据[强化物品][下一等级]["四维"]);
                item.setLuk(25 + 进阶数据[强化物品][下一等级]["四维"]);
                item.setHp(198);
                // item.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
                // item.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
                // item.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setWdef(55 + 进阶数据[强化物品][下一等级]["双防"]);
                item.setMdef(55 + 进阶数据[强化物品][下一等级]["双防"]);
                // item.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
                // item.setAcc(进阶数据[强化物品][下一等级]["命中"]);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}





function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}