var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 80;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级0", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1122007": {
        "等级0": {
            "四维": 0,
            "双防": 0,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级1": {
            "四维": 4,
            "双防": 4,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    2
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级2": {
            "四维": 8,
            "双防": 8,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    2
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级3": {
            "四维": 12,
            "双防": 12,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    3
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级4": {
            "四维": 16,
            "双防": 16,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    4
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级5": {
            "四维": 21,
            "双防": 20,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    4500716,
                    5
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4500033
            ]
        },
        "等级6": {
            "四维": 25,
            "双防": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    6
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577910
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级7": {
            "四维": 29,
            "双防": 29,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    7
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级8": {
            "四维": 33,
            "双防": 33,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    4500716,
                    8
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4500033
            ]
        },
        "等级9": {
            "四维": 37,
            "双防": 37,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    9
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级10": {
            "四维": 41,
            "双防": 41,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500716,
                    10
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级11": {
            "四维": 45,
            "双防": 45,
            "材料": [
                [
                    4001085,
                    6
                ],
                [
                    4500717,
                    2
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4500033
            ]
        },
        "等级12": {
            "四维": 50,
            "双防": 50,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    3
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级13": {
            "四维": 54,
            "双防": 54,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    4
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级14": {
            "四维": 59,
            "双防": 59,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    5
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级15": {
            "四维": 63,
            "双防": 63,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    6
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级16": {
            "四维": 68,
            "双防": 68,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    6
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级17": {
            "四维": 72,
            "双防": 72,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    7
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级18": {
            "四维": 76,
            "双防": 76,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    8
                ],
                [
                    4000313,
                    38
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级19": {
            "四维": 81,
            "双防": 81,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    9
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级20": {
            "四维": 85,
            "双防": 85,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500717,
                    10
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级21": {
            "四维": 91,
            "双防": 91,
            "材料": [
                [
                    4500006,
                    8
                ],
                [
                    4500718,
                    3
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4500033
            ]
        },
        "等级22": {
            "四维": 96,
            "双防": 96,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    4
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级23": {
            "四维": 101,
            "双防": 101,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    5
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级24": {
            "四维": 106,
            "双防": 106,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    6
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级25": {
            "四维": 112,
            "双防": 112,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    7
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级26": {
            "四维": 117,
            "双防": 117,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    8
                ],
                [
                    4000313,
                    52
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级27": {
            "四维": 122,
            "双防": 122,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    9
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级28": {
            "四维": 127,
            "双防": 127,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    10
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级29": {
            "四维": 132,
            "双防": 132,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    11
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级30": {
            "四维": 138,
            "双防": 138,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500718,
                    12
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级31": {
            "四维": 145,
            "双防": 145,
            "材料": [
                [
                    4500007,
                    12
                ],
                [
                    4500719,
                    5
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4500033
            ]
        },
        "等级32": {
            "四维": 152,
            "双防": 152,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    6
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级33": {
            "四维": 160,
            "双防": 160,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    8
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级34": {
            "四维": 167,
            "双防": 167,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    10
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级35": {
            "四维": 174,
            "双防": 174,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    11
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级36": {
            "四维": 182,
            "双防": 182,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    12
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级37": {
            "四维": 189,
            "双防": 189,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    13
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级38": {
            "四维": 196,
            "双防": 196,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    14
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级39": {
            "四维": 204,
            "双防": 204,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    15
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级40": {
            "四维": 211,
            "双防": 211,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500719,
                    16
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级41": {
            "四维": 218,
            "双防": 218,
            "材料": [
                [
                    4500008,
                    12
                ],
                [
                    4500720,
                    5
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4500033
            ]
        },
        "等级42": {
            "四维": 225,
            "双防": 225,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    6
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级43": {
            "四维": 232,
            "双防": 232,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    8
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级44": {
            "四维": 239,
            "双防": 239,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    10
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级45": {
            "四维": 245,
            "双防": 246,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    11
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级46": {
            "四维": 252,
            "双防": 252,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    12
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级47": {
            "四维": 259,
            "双防": 259,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    13
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级48": {
            "四维": 266,
            "双防": 266,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    14
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级49": {
            "四维": 273,
            "双防": 273,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    15
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级50": {
            "四维": 280,
            "双防": 280,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500720,
                    16
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级51": {
            "四维": 288,
            "双防": 288,
            "材料": [
                [
                    4500009,
                    16
                ],
                [
                    4500721,
                    6
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4500033
            ]
        },
        "等级52": {
            "四维": 297,
            "双防": 297,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    8
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级53": {
            "四维": 306,
            "双防": 306,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    10
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级54": {
            "四维": 314,
            "双防": 314,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    12
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级55": {
            "四维": 323,
            "双防": 323,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    14
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级56": {
            "四维": 331,
            "双防": 331,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    16
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级57": {
            "四维": 340,
            "双防": 340,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    18
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级58": {
            "四维": 349,
            "双防": 349,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    20
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级59": {
            "四维": 357,
            "双防": 357,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    22
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级60": {
            "四维": 366,
            "双防": 366,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500721,
                    24
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级61": {
            "四维": 374,
            "双防": 374,
            "材料": [
                [
                    4500010,
                    16
                ],
                [
                    4500722,
                    6
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4500033
            ]
        },
        "等级62": {
            "四维": 382,
            "双防": 382,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    8
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级63": {
            "四维": 390,
            "双防": 390,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    10
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级64": {
            "四维": 398,
            "双防": 398,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    12
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级65": {
            "四维": 407,
            "双防": 407,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    14
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级66": {
            "四维": 415,
            "双防": 415,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    16
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级67": {
            "四维": 423,
            "双防": 423,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    18
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级68": {
            "四维": 431,
            "双防": 431,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    20
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级69": {
            "四维": 439,
            "双防": 439,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    22
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级70": {
            "四维": 447,
            "双防": 447,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500722,
                    24
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级71": {
            "四维": 455,
            "双防": 455,
            "材料": [
                [
                    4500011,
                    16
                ],
                [
                    4500723,
                    6
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4500033
            ]
        },
        "等级72": {
            "四维": 463,
            "双防": 463,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    8
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级73": {
            "四维": 471,
            "双防": 470,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    10
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级74": {
            "四维": 478,
            "双防": 478,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    12
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级75": {
            "四维": 486,
            "双防": 486,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    14
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级76": {
            "四维": 494,
            "双防": 494,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    16
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级77": {
            "四维": 502,
            "双防": 502,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    18
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级78": {
            "四维": 509,
            "双防": 509,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    20
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级79": {
            "四维": 517,
            "双防": 517,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    22
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级80": {
            "四维": 525,
            "双防": 525,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500723,
                    24
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级81": {
            "四维": 534,
            "双防": 534,
            "材料": [
                [
                    4500012,
                    20
                ],
                [
                    4500724,
                    8
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4500033
            ]
        },
        "等级82": {
            "四维": 544,
            "双防": 544,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    11
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级83": {
            "四维": 553,
            "双防": 553,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    14
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级84": {
            "四维": 562,
            "双防": 562,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    16
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级85": {
            "四维": 572,
            "双防": 572,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    18
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级86": {
            "四维": 581,
            "双防": 581,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    20
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级87": {
            "四维": 590,
            "双防": 590,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    22
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级88": {
            "四维": 600,
            "双防": 600,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    24
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级89": {
            "四维": 609,
            "双防": 609,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    26
                ],
                [
                    4000313,
                    172
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级90": {
            "四维": 618,
            "双防": 618,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500724,
                    28
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级91": {
            "四维": 627,
            "双防": 627,
            "材料": [
                [
                    4500013,
                    20
                ],
                [
                    4500725,
                    8
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4500033
            ]
        },
        "等级92": {
            "四维": 636,
            "双防": 636,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    11
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级93": {
            "四维": 645,
            "双防": 645,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    14
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级94": {
            "四维": 654,
            "双防": 654,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    16
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级95": {
            "四维": 663,
            "双防": 663,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    18
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级96": {
            "四维": 672,
            "双防": 672,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    20
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级97": {
            "四维": 681,
            "双防": 681,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    22
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级98": {
            "四维": 690,
            "双防": 690,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    24
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级99": {
            "四维": 699,
            "双防": 699,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    26
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级100": {
            "四维": 709,
            "双防": 709,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500725,
                    28
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级101": {
            "四维": 717,
            "双防": 717,
            "材料": [
                [
                    4500014,
                    20
                ],
                [
                    4500726,
                    8
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4500033
            ]
        },
        "等级102": {
            "四维": 726,
            "双防": 726,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    11
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级103": {
            "四维": 735,
            "双防": 735,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    14
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级104": {
            "四维": 744,
            "双防": 744,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    16
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级105": {
            "四维": 752,
            "双防": 752,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    18
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级106": {
            "四维": 761,
            "双防": 761,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    20
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级107": {
            "四维": 770,
            "双防": 770,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    22
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692141
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级108": {
            "四维": 779,
            "双防": 779,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    24
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级109": {
            "四维": 788,
            "双防": 788,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    26
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级110": {
            "四维": 796,
            "双防": 796,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500726,
                    28
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级111": {
            "四维": 807,
            "双防": 807,
            "材料": [
                [
                    4500015,
                    24
                ],
                [
                    4500727,
                    10
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4500033
            ]
        },
        "等级112": {
            "四维": 817,
            "双防": 817,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    13
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级113": {
            "四维": 827,
            "双防": 827,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    16
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级114": {
            "四维": 837,
            "双防": 837,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    19
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级115": {
            "四维": 848,
            "双防": 848,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    22
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级116": {
            "四维": 858,
            "双防": 858,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    25
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级117": {
            "四维": 868,
            "双防": 868,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    27
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级118": {
            "四维": 879,
            "双防": 879,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    29
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级119": {
            "四维": 889,
            "双防": 889,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    31
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级120": {
            "四维": 899,
            "双防": 899,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500727,
                    33
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级121": {
            "四维": 909,
            "双防": 909,
            "材料": [
                [
                    4500016,
                    24
                ],
                [
                    4500728,
                    10
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4500033
            ]
        },
        "等级122": {
            "四维": 919,
            "双防": 919,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    13
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级123": {
            "四维": 929,
            "双防": 929,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    16
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级124": {
            "四维": 940,
            "双防": 939,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    19
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级125": {
            "四维": 950,
            "双防": 950,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    22
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级126": {
            "四维": 960,
            "双防": 960,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    25
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级127": {
            "四维": 970,
            "双防": 970,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    27
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级128": {
            "四维": 980,
            "双防": 980,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    29
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级129": {
            "四维": 990,
            "双防": 990,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    31
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        },
        "等级130": {
            "四维": 1000,
            "双防": 1000,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4500728,
                    33
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                null,
                4500033
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级0";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 0 || 当前星级 > 80) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    //   cm.sendOk(下一星级+下一等级);
    //   cm.dispose();
    //   return;
    // // 检查是否达到最高等级
    if (当前星级 >= 80) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[强化物品][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + (进阶数据[强化物品][下一等级]["四维"] + 6) + "]" : "[#r四维+6]";
        text += 进阶数据[强化物品][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[强化物品][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双防"] ? "[#r双防+" + (进阶数据[强化物品][下一等级]["双防"] + 4) + "]" : "[#r双防+4]";
        text += 进阶数据[强化物品][下一等级]["速度"] ? "[#r速度+" + 进阶数据[强化物品][下一等级]["速度"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[强化物品][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["命中"] ? "[#r命中+" + 进阶数据[强化物品][下一等级]["命中"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["回避"] ? "[#r回避+" + 进阶数据[强化物品][下一等级]["回避"] + "]" : "";

        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            }
            else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        // text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendYesNo(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4000313 || 需要物品id == 4500033) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                if (需要物品id == 4500716 ||
                    需要物品id == 4500717 ||
                    需要物品id == 4500718 ||
                    需要物品id == 4500719 ||
                    需要物品id == 4500720 ||
                    需要物品id == 4500721 ||
                    需要物品id == 4500722 ||
                    需要物品id == 4500723 ||
                    需要物品id == 4500724 ||
                    需要物品id == 4500725 ||
                    需要物品id == 4500726 ||
                    需要物品id == 4500727 ||
                    需要物品id == 4500728) {
                    cm.dispose();
                    cm.openNpc(2013000, 0);
                    return;
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !强化物品 || 进阶数据[强化物品]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            equip.setStr(6+进阶数据[强化物品][下一等级]["四维"]);
            equip.setDex(6+进阶数据[强化物品][下一等级]["四维"]);
            equip.setInt(6+进阶数据[强化物品][下一等级]["四维"]);
            equip.setLuk(6+进阶数据[强化物品][下一等级]["四维"]);
            // equip.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
            // equip.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
            // equip.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
            // equip.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
           equip.setWdef(4+进阶数据[强化物品][下一等级]["双防"]);
            equip.setMdef(4+进阶数据[强化物品][下一等级]["双防"]);
            // equip.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
            // equip.setAcc(进阶数据[强化物品][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                item.setStr(6+进阶数据[强化物品][下一等级]["四维"]);
                item.setDex(6+进阶数据[强化物品][下一等级]["四维"]);
                item.setInt(6+进阶数据[强化物品][下一等级]["四维"]);
                item.setLuk(6+进阶数据[强化物品][下一等级]["四维"]);
                // item.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
                // item.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
                // item.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
                // item.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setWdef(4+进阶数据[强化物品][下一等级]["双防"]);
                item.setMdef(4+进阶数据[强化物品][下一等级]["双防"]);
                // item.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
                // item.setAcc(进阶数据[强化物品][下一等级]["命中"]);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}





function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}