var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 130;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1122000": {
        "等级0": {
            "HP": 0,
            "MP": 0,
            "四维": 0,
            "攻魔": 1,
            "双防": 1,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    10
                ],
                [
                    0,
                    250000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级1": {
            "HP": 0,
            "MP": 0,
            "四维": 0,
            "攻魔": 1,
            "双防": 1,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    10
                ],
                [
                    0,
                    250000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级2": {
            "HP": 0,
            "MP": 0,
            "四维": 0,
            "攻魔": 1,
            "双防": 1,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    10
                ],
                [
                    0,
                    250000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级3": {
            "HP": 0,
            "MP": 0,
            "四维": 0,
            "攻魔": 1,
            "双防": 1,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    10
                ],
                [
                    0,
                    250000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级4": {
            "HP": 0,
            "MP": 0,
            "四维": 0,
            "攻魔": 1,
            "双防": 1,
            "材料": [
                [
                    4001084,
                    3
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    10
                ],
                [
                    0,
                    250000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级5": {
            "HP": 3,
            "MP": 3,
            "四维": 3,
            "攻魔": 7,
            "双防": 7,
            "材料": [
                [
                    4001084,
                    12
                ],
                [
                    1122000,
                    1
                ],
                [
                    4500033,
                    40
                ],
                [
                    0,
                    1000000
                ]
            ],
            "绑定材料": [
                4500019,
                null,
                4000313
            ]
        },
        "等级6": {
            "HP": 1,
            "MP": 1,
            "四维": 1,
            "攻魔": 3,
            "双防": 3,
            "材料": [
                [
                    4001083,
                    6
                ],
                [
                    1122000,
                    2
                ],
                [
                    4500033,
                    20
                ],
                [
                    0,
                    750000
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4000313
            ]
        },
        "等级7": {
            "HP": 1,
            "MP": 1,
            "四维": 1,
            "攻魔": 3,
            "双防": 3,
            "材料": [
                [
                    4001083,
                    6
                ],
                [
                    1122000,
                    2
                ],
                [
                    4500033,
                    20
                ],
                [
                    0,
                    750000
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4000313
            ]
        },
        "等级8": {
            "HP": 1,
            "MP": 1,
            "四维": 1,
            "攻魔": 3,
            "双防": 3,
            "材料": [
                [
                    4001083,
                    6
                ],
                [
                    1122000,
                    2
                ],
                [
                    4500033,
                    20
                ],
                [
                    0,
                    750000
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4000313
            ]
        },
        "等级9": {
            "HP": 1,
            "MP": 1,
            "四维": 1,
            "攻魔": 3,
            "双防": 3,
            "材料": [
                [
                    4001083,
                    6
                ],
                [
                    1122000,
                    2
                ],
                [
                    4500033,
                    20
                ],
                [
                    0,
                    750000
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4000313
            ]
        },
        "等级10": {
            "HP": 7,
            "MP": 7,
            "四维": 7,
            "攻魔": 15,
            "双防": 15,
            "材料": [
                [
                    4001083,
                    24
                ],
                [
                    1122000,
                    2
                ],
                [
                    4500033,
                    80
                ],
                [
                    0,
                    3000000
                ]
            ],
            "绑定材料": [
                4500020,
                null,
                4000313
            ]
        },
        "等级11": {
            "HP": 2,
            "MP": 2,
            "四维": 2,
            "攻魔": 5,
            "双防": 5,
            "材料": [
                [
                    4001085,
                    9
                ],
                [
                    1122000,
                    3
                ],
                [
                    4500033,
                    30
                ],
                [
                    0,
                    1250000
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4000313
            ]
        },
        "等级12": {
            "HP": 2,
            "MP": 2,
            "四维": 2,
            "攻魔": 5,
            "双防": 5,
            "材料": [
                [
                    4001085,
                    9
                ],
                [
                    1122000,
                    3
                ],
                [
                    4500033,
                    30
                ],
                [
                    0,
                    1250000
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4000313
            ]
        },
        "等级13": {
            "HP": 2,
            "MP": 2,
            "四维": 2,
            "攻魔": 5,
            "双防": 5,
            "材料": [
                [
                    4001085,
                    9
                ],
                [
                    1122000,
                    3
                ],
                [
                    4500033,
                    30
                ],
                [
                    0,
                    1250000
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4000313
            ]
        },
        "等级14": {
            "HP": 2,
            "MP": 2,
            "四维": 2,
            "攻魔": 5,
            "双防": 5,
            "材料": [
                [
                    4001085,
                    9
                ],
                [
                    1122000,
                    3
                ],
                [
                    4500033,
                    30
                ],
                [
                    0,
                    1250000
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4000313
            ]
        },
        "等级15": {
            "HP": 11,
            "MP": 11,
            "四维": 11,
            "攻魔": 23,
            "双防": 23,
            "材料": [
                [
                    4001085,
                    36
                ],
                [
                    1122000,
                    3
                ],
                [
                    4500033,
                    120
                ],
                [
                    0,
                    5000000
                ]
            ],
            "绑定材料": [
                4500021,
                null,
                4000313
            ]
        },
        "等级16": {
            "HP": 3,
            "MP": 3,
            "四维": 3,
            "攻魔": 7,
            "双防": 7,
            "材料": [
                [
                    4021010,
                    12
                ],
                [
                    1122000,
                    4
                ],
                [
                    4500033,
                    40
                ],
                [
                    0,
                    1750000
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4000313
            ]
        },
        "等级17": {
            "HP": 3,
            "MP": 3,
            "四维": 3,
            "攻魔": 7,
            "双防": 7,
            "材料": [
                [
                    4021010,
                    12
                ],
                [
                    1122000,
                    4
                ],
                [
                    4500033,
                    40
                ],
                [
                    0,
                    1750000
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4000313
            ]
        },
        "等级18": {
            "HP": 3,
            "MP": 3,
            "四维": 3,
            "攻魔": 7,
            "双防": 7,
            "材料": [
                [
                    4021010,
                    12
                ],
                [
                    1122000,
                    4
                ],
                [
                    4500033,
                    40
                ],
                [
                    0,
                    1750000
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4000313
            ]
        },
        "等级19": {
            "HP": 3,
            "MP": 3,
            "四维": 3,
            "攻魔": 7,
            "双防": 7,
            "材料": [
                [
                    4021010,
                    12
                ],
                [
                    1122000,
                    4
                ],
                [
                    4500033,
                    40
                ],
                [
                    0,
                    1750000
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4000313
            ]
        },
        "等级20": {
            "HP": 15,
            "MP": 15,
            "四维": 15,
            "攻魔": 31,
            "双防": 31,
            "材料": [
                [
                    4021010,
                    48
                ],
                [
                    1122000,
                    4
                ],
                [
                    4500033,
                    160
                ],
                [
                    0,
                    7000000
                ]
            ],
            "绑定材料": [
                4500022,
                null,
                4000313
            ]
        },
        "等级21": {
            "HP": 4,
            "MP": 4,
            "四维": 4,
            "攻魔": 9,
            "双防": 9,
            "材料": [
                [
                    4032323,
                    15
                ],
                [
                    1122000,
                    5
                ],
                [
                    4500033,
                    50
                ],
                [
                    0,
                    2250000
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4000313
            ]
        },
        "等级22": {
            "HP": 4,
            "MP": 4,
            "四维": 4,
            "攻魔": 9,
            "双防": 9,
            "材料": [
                [
                    4032323,
                    15
                ],
                [
                    1122000,
                    5
                ],
                [
                    4500033,
                    50
                ],
                [
                    0,
                    2250000
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4000313
            ]
        },
        "等级23": {
            "HP": 4,
            "MP": 4,
            "四维": 4,
            "攻魔": 9,
            "双防": 9,
            "材料": [
                [
                    4032323,
                    15
                ],
                [
                    1122000,
                    5
                ],
                [
                    4500033,
                    50
                ],
                [
                    0,
                    2250000
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4000313
            ]
        },
        "等级24": {
            "HP": 4,
            "MP": 4,
            "四维": 4,
            "攻魔": 9,
            "双防": 9,
            "材料": [
                [
                    4032323,
                    15
                ],
                [
                    1122000,
                    5
                ],
                [
                    4500033,
                    50
                ],
                [
                    0,
                    2250000
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4000313
            ]
        },
        "等级25": {
            "HP": 19,
            "MP": 19,
            "四维": 19,
            "攻魔": 39,
            "双防": 39,
            "材料": [
                [
                    4032323,
                    60
                ],
                [
                    1122000,
                    5
                ],
                [
                    4500033,
                    200
                ],
                [
                    0,
                    9000000
                ]
            ],
            "绑定材料": [
                4500023,
                null,
                4000313
            ]
        },
        "等级26": {
            "HP": 5,
            "MP": 5,
            "四维": 5,
            "攻魔": 11,
            "双防": 11,
            "材料": [
                [
                    4033232,
                    18
                ],
                [
                    1122000,
                    6
                ],
                [
                    4500033,
                    60
                ],
                [
                    0,
                    2750000
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4000313
            ]
        },
        "等级27": {
            "HP": 5,
            "MP": 5,
            "四维": 5,
            "攻魔": 11,
            "双防": 11,
            "材料": [
                [
                    4033232,
                    18
                ],
                [
                    1122000,
                    6
                ],
                [
                    4500033,
                    60
                ],
                [
                    0,
                    2750000
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4000313
            ]
        },
        "等级28": {
            "HP": 5,
            "MP": 5,
            "四维": 5,
            "攻魔": 11,
            "双防": 11,
            "材料": [
                [
                    4033232,
                    18
                ],
                [
                    1122000,
                    6
                ],
                [
                    4500033,
                    60
                ],
                [
                    0,
                    2750000
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4000313
            ]
        },
        "等级29": {
            "HP": 5,
            "MP": 5,
            "四维": 5,
            "攻魔": 11,
            "双防": 11,
            "材料": [
                [
                    4033232,
                    18
                ],
                [
                    1122000,
                    6
                ],
                [
                    4500033,
                    60
                ],
                [
                    0,
                    2750000
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4000313
            ]
        },
        "等级30": {
            "HP": 23,
            "MP": 23,
            "四维": 23,
            "攻魔": 47,
            "双防": 47,
            "材料": [
                [
                    4033232,
                    72
                ],
                [
                    1122000,
                    6
                ],
                [
                    4500033,
                    240
                ],
                [
                    0,
                    11000000
                ]
            ],
            "绑定材料": [
                4500024,
                null,
                4000313
            ]
        },
        "等级31": {
            "HP": 6,
            "MP": 6,
            "四维": 6,
            "攻魔": 13,
            "双防": 13,
            "材料": [
                [
                    4033174,
                    21
                ],
                [
                    1122000,
                    7
                ],
                [
                    4500033,
                    70
                ],
                [
                    0,
                    3250000
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4000313
            ]
        },
        "等级32": {
            "HP": 6,
            "MP": 6,
            "四维": 6,
            "攻魔": 13,
            "双防": 13,
            "材料": [
                [
                    4033174,
                    21
                ],
                [
                    1122000,
                    7
                ],
                [
                    4500033,
                    70
                ],
                [
                    0,
                    3250000
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4000313
            ]
        },
        "等级33": {
            "HP": 6,
            "MP": 6,
            "四维": 6,
            "攻魔": 13,
            "双防": 13,
            "材料": [
                [
                    4033174,
                    21
                ],
                [
                    1122000,
                    7
                ],
                [
                    4500033,
                    70
                ],
                [
                    0,
                    3250000
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4000313
            ]
        },
        "等级34": {
            "HP": 6,
            "MP": 6,
            "四维": 6,
            "攻魔": 13,
            "双防": 13,
            "材料": [
                [
                    4033174,
                    21
                ],
                [
                    1122000,
                    7
                ],
                [
                    4500033,
                    70
                ],
                [
                    0,
                    3250000
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4000313
            ]
        },
        "等级35": {
            "HP": 27,
            "MP": 27,
            "四维": 27,
            "攻魔": 55,
            "双防": 55,
            "材料": [
                [
                    4033174,
                    84
                ],
                [
                    1122000,
                    7
                ],
                [
                    4500033,
                    280
                ],
                [
                    0,
                    13000000
                ]
            ],
            "绑定材料": [
                4500025,
                null,
                4000313
            ]
        },
        "等级36": {
            "HP": 7,
            "MP": 7,
            "四维": 7,
            "攻魔": 15,
            "双防": 15,
            "材料": [
                [
                    4033159,
                    24
                ],
                [
                    1122000,
                    8
                ],
                [
                    4500033,
                    80
                ],
                [
                    0,
                    3750000
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4000313
            ]
        },
        "等级37": {
            "HP": 7,
            "MP": 7,
            "四维": 7,
            "攻魔": 15,
            "双防": 15,
            "材料": [
                [
                    4033159,
                    24
                ],
                [
                    1122000,
                    8
                ],
                [
                    4500033,
                    80
                ],
                [
                    0,
                    3750000
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4000313
            ]
        },
        "等级38": {
            "HP": 7,
            "MP": 7,
            "四维": 7,
            "攻魔": 15,
            "双防": 15,
            "材料": [
                [
                    4033159,
                    24
                ],
                [
                    1122000,
                    8
                ],
                [
                    4500033,
                    80
                ],
                [
                    0,
                    3750000
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4000313
            ]
        },
        "等级39": {
            "HP": 7,
            "MP": 7,
            "四维": 7,
            "攻魔": 15,
            "双防": 15,
            "材料": [
                [
                    4033159,
                    24
                ],
                [
                    1122000,
                    8
                ],
                [
                    4500033,
                    80
                ],
                [
                    0,
                    3750000
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4000313
            ]
        },
        "等级40": {
            "HP": 31,
            "MP": 31,
            "四维": 31,
            "攻魔": 63,
            "双防": 63,
            "材料": [
                [
                    4033159,
                    96
                ],
                [
                    1122000,
                    8
                ],
                [
                    4500033,
                    320
                ],
                [
                    0,
                    15000000
                ]
            ],
            "绑定材料": [
                4500026,
                null,
                4000313
            ]
        },
        "等级41": {
            "HP": 8,
            "MP": 8,
            "四维": 8,
            "攻魔": 17,
            "双防": 17,
            "材料": [
                [
                    4031868,
                    27
                ],
                [
                    1122000,
                    9
                ],
                [
                    4500033,
                    90
                ],
                [
                    0,
                    4250000
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4000313
            ]
        },
        "等级42": {
            "HP": 8,
            "MP": 8,
            "四维": 8,
            "攻魔": 17,
            "双防": 17,
            "材料": [
                [
                    4031868,
                    27
                ],
                [
                    1122000,
                    9
                ],
                [
                    4500033,
                    90
                ],
                [
                    0,
                    4250000
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4000313
            ]
        },
        "等级43": {
            "HP": 8,
            "MP": 8,
            "四维": 8,
            "攻魔": 17,
            "双防": 17,
            "材料": [
                [
                    4031868,
                    27
                ],
                [
                    1122000,
                    9
                ],
                [
                    4500033,
                    90
                ],
                [
                    0,
                    4250000
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4000313
            ]
        },
        "等级44": {
            "HP": 8,
            "MP": 8,
            "四维": 8,
            "攻魔": 17,
            "双防": 17,
            "材料": [
                [
                    4031868,
                    27
                ],
                [
                    1122000,
                    9
                ],
                [
                    4500033,
                    90
                ],
                [
                    0,
                    4250000
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4000313
            ]
        },
        "等级45": {
            "HP": 35,
            "MP": 35,
            "四维": 35,
            "攻魔": 71,
            "双防": 71,
            "材料": [
                [
                    4031868,
                    108
                ],
                [
                    1122000,
                    9
                ],
                [
                    4500033,
                    360
                ],
                [
                    0,
                    17000000
                ]
            ],
            "绑定材料": [
                4500027,
                null,
                4000313
            ]
        },
        "等级46": {
            "HP": 9,
            "MP": 9,
            "四维": 9,
            "攻魔": 19,
            "双防": 19,
            "材料": [
                [
                    4001237,
                    30
                ],
                [
                    1122000,
                    10
                ],
                [
                    4500033,
                    100
                ],
                [
                    0,
                    4750000
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4000313
            ]
        },
        "等级47": {
            "HP": 9,
            "MP": 9,
            "四维": 9,
            "攻魔": 19,
            "双防": 19,
            "材料": [
                [
                    4001237,
                    30
                ],
                [
                    1122000,
                    10
                ],
                [
                    4500033,
                    100
                ],
                [
                    0,
                    4750000
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4000313
            ]
        },
        "等级48": {
            "HP": 9,
            "MP": 9,
            "四维": 9,
            "攻魔": 19,
            "双防": 19,
            "材料": [
                [
                    4001237,
                    30
                ],
                [
                    1122000,
                    10
                ],
                [
                    4500033,
                    100
                ],
                [
                    0,
                    4750000
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4000313
            ]
        },
        "等级49": {
            "HP": 9,
            "MP": 9,
            "四维": 9,
            "攻魔": 19,
            "双防": 19,
            "材料": [
                [
                    4001237,
                    30
                ],
                [
                    1122000,
                    10
                ],
                [
                    4500033,
                    100
                ],
                [
                    0,
                    4750000
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4000313
            ]
        },
        "等级50": {
            "HP": 39,
            "MP": 39,
            "四维": 39,
            "攻魔": 79,
            "双防": 79,
            "材料": [
                [
                    4001237,
                    120
                ],
                [
                    1122000,
                    10
                ],
                [
                    4500033,
                    400
                ],
                [
                    0,
                    19000000
                ]
            ],
            "绑定材料": [
                4500028,
                null,
                4000313
            ]
        },
        "等级51": {
            "HP": 10,
            "MP": 10,
            "四维": 10,
            "攻魔": 21,
            "双防": 21,
            "材料": [
                [
                    4001238,
                    33
                ],
                [
                    1122000,
                    11
                ],
                [
                    4500033,
                    110
                ],
                [
                    0,
                    5250000
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4000313
            ]
        },
        "等级52": {
            "HP": 10,
            "MP": 10,
            "四维": 10,
            "攻魔": 21,
            "双防": 21,
            "材料": [
                [
                    4001238,
                    33
                ],
                [
                    1122000,
                    11
                ],
                [
                    4500033,
                    110
                ],
                [
                    0,
                    5250000
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4000313
            ]
        },
        "等级53": {
            "HP": 10,
            "MP": 10,
            "四维": 10,
            "攻魔": 21,
            "双防": 21,
            "材料": [
                [
                    4001238,
                    33
                ],
                [
                    1122000,
                    11
                ],
                [
                    4500033,
                    110
                ],
                [
                    0,
                    5250000
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4000313
            ]
        },
        "等级54": {
            "HP": 10,
            "MP": 10,
            "四维": 10,
            "攻魔": 21,
            "双防": 21,
            "材料": [
                [
                    4001238,
                    33
                ],
                [
                    1122000,
                    11
                ],
                [
                    4500033,
                    110
                ],
                [
                    0,
                    5250000
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4000313
            ]
        },
        "等级55": {
            "HP": 43,
            "MP": 43,
            "四维": 43,
            "攻魔": 87,
            "双防": 87,
            "材料": [
                [
                    4001238,
                    132
                ],
                [
                    1122000,
                    11
                ],
                [
                    4500033,
                    440
                ],
                [
                    0,
                    21000000
                ]
            ],
            "绑定材料": [
                4500029,
                null,
                4000313
            ]
        },
        "等级56": {
            "HP": 11,
            "MP": 11,
            "四维": 11,
            "攻魔": 23,
            "双防": 23,
            "材料": [
                [
                    4001239,
                    36
                ],
                [
                    1122000,
                    12
                ],
                [
                    4500033,
                    120
                ],
                [
                    0,
                    5750000
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4000313
            ]
        },
        "等级57": {
            "HP": 11,
            "MP": 11,
            "四维": 11,
            "攻魔": 23,
            "双防": 23,
            "材料": [
                [
                    4001239,
                    36
                ],
                [
                    1122000,
                    12
                ],
                [
                    4500033,
                    120
                ],
                [
                    0,
                    5750000
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4000313
            ]
        },
        "等级58": {
            "HP": 11,
            "MP": 11,
            "四维": 11,
            "攻魔": 23,
            "双防": 23,
            "材料": [
                [
                    4001239,
                    36
                ],
                [
                    1122000,
                    12
                ],
                [
                    4500033,
                    120
                ],
                [
                    0,
                    5750000
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4000313
            ]
        },
        "等级59": {
            "HP": 11,
            "MP": 11,
            "四维": 11,
            "攻魔": 23,
            "双防": 23,
            "材料": [
                [
                    4001239,
                    36
                ],
                [
                    1122000,
                    12
                ],
                [
                    4500033,
                    120
                ],
                [
                    0,
                    5750000
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4000313
            ]
        },
        "等级60": {
            "HP": 47,
            "MP": 47,
            "四维": 47,
            "攻魔": 95,
            "双防": 95,
            "材料": [
                [
                    4001239,
                    144
                ],
                [
                    1122000,
                    12
                ],
                [
                    4500033,
                    480
                ],
                [
                    0,
                    23000000
                ]
            ],
            "绑定材料": [
                4500030,
                null,
                4000313
            ]
        },
        "等级61": {
            "HP": 12,
            "MP": 12,
            "四维": 12,
            "攻魔": 25,
            "双防": 25,
            "材料": [
                [
                    4250802,
                    39
                ],
                [
                    1122000,
                    13
                ],
                [
                    4500033,
                    130
                ],
                [
                    0,
                    6250000
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4000313
            ]
        },
        "等级62": {
            "HP": 12,
            "MP": 12,
            "四维": 12,
            "攻魔": 25,
            "双防": 25,
            "材料": [
                [
                    4250802,
                    39
                ],
                [
                    1122000,
                    13
                ],
                [
                    4500033,
                    130
                ],
                [
                    0,
                    6250000
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4000313
            ]
        },
        "等级63": {
            "HP": 12,
            "MP": 12,
            "四维": 12,
            "攻魔": 25,
            "双防": 25,
            "材料": [
                [
                    4250802,
                    39
                ],
                [
                    1122000,
                    13
                ],
                [
                    4500033,
                    130
                ],
                [
                    0,
                    6250000
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4000313
            ]
        },
        "等级64": {
            "HP": 12,
            "MP": 12,
            "四维": 12,
            "攻魔": 25,
            "双防": 25,
            "材料": [
                [
                    4250802,
                    39
                ],
                [
                    1122000,
                    13
                ],
                [
                    4500033,
                    130
                ],
                [
                    0,
                    6250000
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4000313
            ]
        },
        "等级65": {
            "HP": 51,
            "MP": 51,
            "四维": 51,
            "攻魔": 103,
            "双防": 103,
            "材料": [
                [
                    4250802,
                    156
                ],
                [
                    1122000,
                    13
                ],
                [
                    4500033,
                    520
                ],
                [
                    0,
                    25000000
                ]
            ],
            "绑定材料": [
                4500031,
                null,
                4000313
            ]
        },
        "等级66": {
            "HP": 13,
            "MP": 13,
            "四维": 13,
            "攻魔": 27,
            "双防": 27,
            "材料": [
                [
                    4251002,
                    42
                ],
                [
                    1122000,
                    14
                ],
                [
                    4500033,
                    140
                ],
                [
                    0,
                    6750000
                ]
            ],
            "绑定材料": [
                4500032,
                null,
                4000313
            ]
        },
        "等级67": {
            "HP": 13,
            "MP": 13,
            "四维": 13,
            "攻魔": 27,
            "双防": 27,
            "材料": [
                [
                    4251002,
                    42
                ],
                [
                    1122000,
                    14
                ],
                [
                    4500033,
                    140
                ],
                [
                    0,
                    6750000
                ]
            ],
            "绑定材料": [
                4500032,
                null,
                4000313
            ]
        },
        "等级68": {
            "HP": 13,
            "MP": 13,
            "四维": 13,
            "攻魔": 27,
            "双防": 27,
            "材料": [
                [
                    4251002,
                    42
                ],
                [
                    1122000,
                    14
                ],
                [
                    4500033,
                    140
                ],
                [
                    0,
                    6750000
                ]
            ],
            "绑定材料": [
                4500032,
                null,
                4000313
            ]
        },
        "等级69": {
            "HP": 13,
            "MP": 13,
            "四维": 13,
            "攻魔": 27,
            "双防": 27,
            "材料": [
                [
                    4251002,
                    42
                ],
                [
                    1122000,
                    14
                ],
                [
                    4500033,
                    140
                ],
                [
                    0,
                    6750000
                ]
            ],
            "绑定材料": [
                4500032,
                null,
                4000313
            ]
        },
        "等级70": {
            "HP": 55,
            "MP": 55,
            "四维": 55,
            "攻魔": 111,
            "双防": 111,
            "材料": [
                [
                    4251002,
                    168
                ],
                [
                    1122000,
                    14
                ],
                [
                    4500033,
                    560
                ],
                [
                    0,
                    27000000
                ]
            ],
            "绑定材料": [
                4500032,
                null,
                4000313
            ]
        },
        "等级71": {
            "HP": 14,
            "MP": 14,
            "四维": 14,
            "攻魔": 29,
            "双防": 29,
            "材料": [
                [
                    4250902,
                    45
                ],
                [
                    1122000,
                    15
                ],
                [
                    4500033,
                    150
                ],
                [
                    0,
                    7250000
                ]
            ],
            "绑定材料": [
                4500033,
                null,
                4000313
            ]
        },
        "等级72": {
            "HP": 14,
            "MP": 14,
            "四维": 14,
            "攻魔": 29,
            "双防": 29,
            "材料": [
                [
                    4250902,
                    45
                ],
                [
                    1122000,
                    15
                ],
                [
                    4500033,
                    150
                ],
                [
                    0,
                    7250000
                ]
            ],
            "绑定材料": [
                4500033,
                null,
                4000313
            ]
        },
        "等级73": {
            "HP": 14,
            "MP": 14,
            "四维": 14,
            "攻魔": 29,
            "双防": 29,
            "材料": [
                [
                    4250902,
                    45
                ],
                [
                    1122000,
                    15
                ],
                [
                    4500033,
                    150
                ],
                [
                    0,
                    7250000
                ]
            ],
            "绑定材料": [
                4500033,
                null,
                4000313
            ]
        },
        "等级74": {
            "HP": 14,
            "MP": 14,
            "四维": 14,
            "攻魔": 29,
            "双防": 29,
            "材料": [
                [
                    4250902,
                    45
                ],
                [
                    1122000,
                    15
                ],
                [
                    4500033,
                    150
                ],
                [
                    0,
                    7250000
                ]
            ],
            "绑定材料": [
                4500033,
                null,
                4000313
            ]
        },
        "等级75": {
            "HP": 59,
            "MP": 59,
            "四维": 59,
            "攻魔": 119,
            "双防": 119,
            "材料": [
                [
                    4250902,
                    180
                ],
                [
                    1122000,
                    15
                ],
                [
                    4500033,
                    600
                ],
                [
                    0,
                    29000000
                ]
            ],
            "绑定材料": [
                4500033,
                null,
                4000313
            ]
        },
        "等级76": {
            "HP": 15,
            "MP": 15,
            "四维": 15,
            "攻魔": 31,
            "双防": 31,
            "材料": [
                [
                    4251102,
                    48
                ],
                [
                    1122000,
                    16
                ],
                [
                    4500033,
                    160
                ],
                [
                    0,
                    7750000
                ]
            ],
            "绑定材料": [
                4500034,
                null,
                4000313
            ]
        },
        "等级77": {
            "HP": 15,
            "MP": 15,
            "四维": 15,
            "攻魔": 31,
            "双防": 31,
            "材料": [
                [
                    4251102,
                    48
                ],
                [
                    1122000,
                    16
                ],
                [
                    4500033,
                    160
                ],
                [
                    0,
                    7750000
                ]
            ],
            "绑定材料": [
                4500034,
                null,
                4000313
            ]
        },
        "等级78": {
            "HP": 15,
            "MP": 15,
            "四维": 15,
            "攻魔": 31,
            "双防": 31,
            "材料": [
                [
                    4251102,
                    48
                ],
                [
                    1122000,
                    16
                ],
                [
                    4500033,
                    160
                ],
                [
                    0,
                    7750000
                ]
            ],
            "绑定材料": [
                4500034,
                null,
                4000313
            ]
        },
        "等级79": {
            "HP": 15,
            "MP": 15,
            "四维": 15,
            "攻魔": 31,
            "双防": 31,
            "材料": [
                [
                    4251102,
                    48
                ],
                [
                    1122000,
                    16
                ],
                [
                    4500033,
                    160
                ],
                [
                    0,
                    7750000
                ]
            ],
            "绑定材料": [
                4500034,
                null,
                4000313
            ]
        },
        "等级80": {
            "HP": 63,
            "MP": 63,
            "四维": 63,
            "攻魔": 127,
            "双防": 127,
            "材料": [
                [
                    4251102,
                    192
                ],
                [
                    1122000,
                    16
                ],
                [
                    4500033,
                    640
                ],
                [
                    0,
                    31000000
                ]
            ],
            "绑定材料": [
                4500034,
                null,
                4000313
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {

    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(-1).getItem(-17) == null) {
        cm.sendOk("您没有穿戴此要强化的装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(-1).getItem(-17).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化的装备穿戴在身上");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级0";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 0 || 当前星级 > 130) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    // cm.sendOk(下一星级+下一等级);
    // cm.dispose();
    // return;  
    // // 检查是否达到最高等级
    if (当前星级 >= 130) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }


    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        var equip = cm.getEquip(强化物品);
        text += 进阶数据[强化物品][下一等级]["HP"] ? "[#rHP+" + (进阶数据[强化物品][下一等级]["HP"] + equip.getHp()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["MP"] ? "[#rMP+" + (进阶数据[强化物品][下一等级]["MP"] + equip.getMp()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + (进阶数据[强化物品][下一等级]["四维"] + equip.getInt()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["攻魔"] ? "[#r攻魔+" + (进阶数据[强化物品][下一等级]["攻魔"] + equip.getWatk()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双防"] ? "[#r双防+" + (进阶数据[强化物品][下一等级]["双防"] + equip.getWatk()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["速度"] ? "[#r速度+" + 进阶数据[强化物品][下一等级]["速度"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[强化物品][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["命中"] ? "[#r命中+" + (进阶数据[强化物品][下一等级]["命中"] + equip.getAcc()) + "]" : "";
        text += 进阶数据[强化物品][下一等级]["回避"] ? "[#r回避+" + 进阶数据[强化物品][下一等级]["回避"] + "]" : "";
        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                if (需要物品数量 > 0) {
                    text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
                }
            } else if (需要物品id == null) {
                text += "      此次装备打造免费升级\r\n";
                break;
            }
            else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4000487 || 需要物品id == 4500034) {
                    cm.dispose();
                    cm.openNpc(9130000, "暗影币礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            equip.setStr(equip.getStr() + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setDex(equip.getDex() + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setInt(equip.getInt() + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setLuk(equip.getLuk() + 进阶数据[强化物品][下一等级]["四维"]);
            equip.setHp(equip.getHp() + 进阶数据[强化物品][下一等级]["HP"]);
            equip.setMp(equip.getMp() + 进阶数据[强化物品][下一等级]["MP"]);
            equip.setWatk(equip.getWatk() + 进阶数据[强化物品][下一等级]["攻魔"]);
            equip.setMatk(equip.getMatk() + 进阶数据[强化物品][下一等级]["攻魔"]);
            equip.setWatk(equip.getWatk() + 进阶数据[强化物品][下一等级]["双防"]);
            equip.setMatk(equip.getMatk() + 进阶数据[强化物品][下一等级]["双防"]);
            equip.setAcc(equip.getAcc() + 进阶数据[强化物品][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            var item = cm.getInventory(1).getItem(1).copy();
            var data = 进阶数据[强化物品][下一等级];
            item.setStr(item.getStr() + 进阶数据[强化物品][下一等级]["四维"]);
            item.setDex(item.getDex() + 进阶数据[强化物品][下一等级]["四维"]);
            item.setInt(item.getInt() + 进阶数据[强化物品][下一等级]["四维"]);
            item.setLuk(item.getLuk() + 进阶数据[强化物品][下一等级]["四维"]);
            item.setHp(item.getHp() + 进阶数据[强化物品][下一等级]["HP"]);
            item.setMp(item.getMp() + 进阶数据[强化物品][下一等级]["MP"]);
            item.setWatk(item.getWatk() + 进阶数据[强化物品][下一等级]["攻魔"]);
            item.setMatk(item.getMatk() + 进阶数据[强化物品][下一等级]["攻魔"]);
            item.setWatk(item.getWatk() + 进阶数据[强化物品][下一等级]["双防"]);
            item.setMatk(item.getMatk() + 进阶数据[强化物品][下一等级]["双防"]);
            item.setAcc(equip.getAcc() + 进阶数据[强化物品][下一等级]["命中"]);
            item.setOwner(下一等级); // 如需显示“等级1”，建议：item.setOwner('等级' + (当前星级+1));
            Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
            Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
            cm.sendNext("强化成功");
            status = -1;


        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}





function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}