var 星星 = "#fMap/MapHelper/weather/witch/3#";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
/* ==================
脚本类型: NPC	    
脚本作者：TT111111   
联系方式qq：111111111111
=====================
*/
importPackage(java.util);
importPackage(Packages.client);
importPackage(Packages.server);
importPackage(Packages.tools);
importPackage(Packages.tools.packet);
importPackage(java.lang);
importPackage(Packages.server.quest);
importPackage(Packages.scripting);
importPackage(Packages.handling.channel);
importPackage(Packages.handling);
importPackage(Packages.handling.word);
importPackage(Packages.constants);
var status = 0;
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
//var 蓝色角点 = "#fEffect/CharacterEff/1022223/4/0#";
var 蓝色角点 = "#fEffect/CharacterEff/1112915/0/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 琴符 = "#fEffect/CharacterEff/1003252/0/0#";
var 音符 = "#fEffect/CharacterEff/1032063/0/0#";
var 花 = "#fUI/UIWindow.img/AriantMatch/characterIcon/0#";
var s = "#fUI/StatusBar/BtClaim/normal/0#";
var h = "#fUI/CashShop/CSEffect/effect/1#";
//var 小雪花 = "#fEffect/CharacterEff/1003393/0/0#";
var 花蘑菇 = "#fItem/Pet/5000046/change/1#";
var 萝卜 = "#fItem/Pet/5000048/angry/0#";
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 心 = "#fUI/GuildMark.img/Mark/Etc/00009001/14#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 礼包物品 = "#v1302000#";
var add = "#fEffect/CharacterEff/1112903/0/0#"; //红桃心
var aaa = "#fUI/UIWindow.img/Quest/icon9/0#"; //红色右箭头
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#"; //蓝色右箭头
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#"; //选择道具
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 红色箭头 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 粉爱心 = "#fItem/Etc/0427/04270005/Icon8/1#"; //
var 菊花 = "#fUI/PredictHarmony/card/19#"; //卡片效果菊花
var 笑 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/0#"; //笑脸
var 金枫叶 = "#fMap/MapHelper/weather/Maple/2#";
var 红枫叶 = "#fMap/MapHelper/weather/Maple/1#";
var 巫女 = "#fMap/MapHelper/weather/witch/0#"; //巫女
var 气球 = "#fMap/MapHelper/weather/balloon/4#"; //气球
var 射箭 = "#fMap/MapHelper/weather/LoveEffect2/4/0#"; //射箭
var 玫瑰 = "#fMap/MapHelper/weather/rose/0#"; //玫瑰花
var 烟花 = "#fMap/MapHelper/weather/squib/squib1/3#"; //烟花
var 黑水晶 = 4021008;
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 圆形 = "#fUI/UIWindow/Quest/icon3/6#";
var 美化new = "#fUI/UIWindow/Quest/icon5/1#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
var 正方箭头 = "#fUI/Basic/BtHide3/mouseOver/0#";
var 忠告 = "#k温馨提示：任何非法程序和外挂封号处理.封杀侥幸心理.";
var 彩虹 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 中条猫 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫右 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 猫左 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 幸运草 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 香水 = "#fItem/Etc/0427/04270001/Icon9/0#";
var 皇冠 = "#fUI/UIWindow.img/UserInfo/bossPetCrown#";
var 开 = "#fUI/Basic/CheckBox/0#";   //有框框 无√
var 关 = "#fUI/Basic/CheckBox/1#";   //有框框 有√
var 金币图 = "#fUI/UIWindow/QuestIcon/7/0#";
var 圆圈 = "#fUI/UIWindow/Quest/icon3/0#";
var ll;
var mj;
var zl;
var yq;
var hp;
var mp;
var gj;
var mg;
var wf;
var mf;
var mz;
var hb;
var ys;
var ty;
var 强化物品 = 1112422;
var 材料物品 = 1112421;
var 物品数量 = 0;
var 成功率 = 100;
var 最高等级 = 130;
var 属性 = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 攻魔a = [4, 4, 4, 5, 4, 4, 4, 4, 4, 4];
var 祝福数量 = 0;
var 枫叶数量 = 0;
var 暗影数量 = 0;
var 强化物品ivid = -1;
var 下一阶id = -1;
var 下一等级 = "";
var 等级规划 = [
    "", "等级1", "等级2", "等级3", "等级4", "等级5", "等级6", "等级7", "等级8", "等级9", "等级10", "等级11", "等级12", "等级13", "等级14", "等级15", "等级16", "等级17"
];
var 进阶数据 = {
    "1112423": {
        "等级1": {
            "四维": 12,
            "双攻": 2,
            "命中": 6,
            "回避": 6,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    null,
                    0
                ],
                [
                    0,
                    0
                ]
            ],
            "绑定材料": [
                null,
                null,
                null
            ]
        },
        "等级2": {
            "四维": 25,
            "双攻": 3,
            "命中": 12,
            "回避": 12,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    32
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级3": {
            "四维": 37,
            "双攻": 5,
            "命中": 18,
            "回避": 18,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    40
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级4": {
            "四维": 49,
            "双攻": 7,
            "命中": 25,
            "回避": 25,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    48
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级5": {
            "四维": 61,
            "双攻": 8,
            "命中": 31,
            "回避": 31,
            "材料": [
                [
                    4001084,
                    14
                ],
                [
                    4310079,
                    56
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500001,
                4500033
            ]
        },
        "等级6": {
            "四维": 74,
            "双攻": 10,
            "命中": 37,
            "回避": 37,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    64
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577910
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级7": {
            "四维": 86,
            "双攻": 11,
            "命中": 43,
            "回避": 43,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    72
                ],
                [
                    4000313,
                    32
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级8": {
            "四维": 98,
            "双攻": 13,
            "命中": 49,
            "回避": 49,
            "材料": [
                [
                    4001084,
                    14
                ],
                [
                    4310079,
                    80
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                4500019,
                4500001,
                4500033
            ]
        },
        "等级9": {
            "四维": 111,
            "双攻": 15,
            "命中": 55,
            "回避": 55,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    88
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级10": {
            "四维": 123,
            "双攻": 16,
            "命中": 62,
            "回避": 62,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    108
                ],
                [
                    4000313,
                    31
                ],
                [
                    0,
                    1577909
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级11": {
            "四维": 136,
            "双攻": 18,
            "命中": 68,
            "回避": 68,
            "材料": [
                [
                    4001085,
                    32
                ],
                [
                    4310079,
                    43
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                4500020,
                4500001,
                4500033
            ]
        },
        "等级12": {
            "四维": 150,
            "双攻": 20,
            "命中": 75,
            "回避": 75,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    53
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级13": {
            "四维": 163,
            "双攻": 22,
            "命中": 81,
            "回避": 81,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    64
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级14": {
            "四维": 176,
            "双攻": 23,
            "命中": 88,
            "回避": 88,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    75
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级15": {
            "四维": 189,
            "双攻": 25,
            "命中": 95,
            "回避": 95,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    85
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级16": {
            "四维": 203,
            "双攻": 27,
            "命中": 101,
            "回避": 101,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    96
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级17": {
            "四维": 216,
            "双攻": 29,
            "命中": 108,
            "回避": 108,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    107
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级18": {
            "四维": 229,
            "双攻": 31,
            "命中": 115,
            "回避": 115,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    117
                ],
                [
                    4000313,
                    38
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级19": {
            "四维": 243,
            "双攻": 32,
            "命中": 121,
            "回避": 121,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    144
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级20": {
            "四维": 256,
            "双攻": 34,
            "命中": 128,
            "回避": 128,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    57
                ],
                [
                    4000313,
                    39
                ],
                [
                    0,
                    2129600
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级21": {
            "四维": 272,
            "双攻": 36,
            "命中": 136,
            "回避": 136,
            "材料": [
                [
                    4500006,
                    40
                ],
                [
                    4310079,
                    67
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                4500021,
                4500001,
                4500033
            ]
        },
        "等级22": {
            "四维": 287,
            "双攻": 38,
            "命中": 144,
            "回避": 144,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    83
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级23": {
            "四维": 303,
            "双攻": 40,
            "命中": 152,
            "回避": 152,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    100
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级24": {
            "四维": 319,
            "双攻": 43,
            "命中": 159,
            "回避": 159,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    117
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级25": {
            "四维": 335,
            "双攻": 45,
            "命中": 167,
            "回避": 167,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    133
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级26": {
            "四维": 350,
            "双攻": 47,
            "命中": 175,
            "回避": 175,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    150
                ],
                [
                    4000313,
                    52
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级27": {
            "四维": 366,
            "双攻": 49,
            "命中": 183,
            "回避": 183,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    167
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级28": {
            "四维": 382,
            "双攻": 51,
            "命中": 191,
            "回避": 191,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    183
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级29": {
            "四维": 397,
            "双攻": 53,
            "命中": 199,
            "回避": 199,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    225
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级30": {
            "四维": 413,
            "双攻": 55,
            "命中": 206,
            "回避": 206,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    89
                ],
                [
                    4000313,
                    51
                ],
                [
                    0,
                    2928200
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级31": {
            "四维": 435,
            "双攻": 58,
            "命中": 217,
            "回避": 217,
            "材料": [
                [
                    4500007,
                    60
                ],
                [
                    4310079,
                    126
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                4500022,
                4500001,
                4500033
            ]
        },
        "等级32": {
            "四维": 457,
            "双攻": 61,
            "命中": 228,
            "回避": 228,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    156
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级33": {
            "四维": 479,
            "双攻": 64,
            "命中": 240,
            "回避": 240,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    188
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级34": {
            "四维": 501,
            "双攻": 67,
            "命中": 251,
            "回避": 251,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    219
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级35": {
            "四维": 523,
            "双攻": 70,
            "命中": 262,
            "回避": 262,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    249
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级36": {
            "四维": 545,
            "双攻": 73,
            "命中": 273,
            "回避": 273,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    281
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级37": {
            "四维": 567,
            "双攻": 76,
            "命中": 284,
            "回避": 284,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    313
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级38": {
            "四维": 589,
            "双攻": 79,
            "命中": 295,
            "回避": 295,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    343
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级39": {
            "四维": 611,
            "双攻": 82,
            "命中": 306,
            "回避": 306,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    422
                ],
                [
                    4000313,
                    80
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级40": {
            "四维": 633,
            "双攻": 84,
            "命中": 317,
            "回避": 317,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    167
                ],
                [
                    4000313,
                    81
                ],
                [
                    0,
                    4831530
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级41": {
            "四维": 654,
            "双攻": 87,
            "命中": 327,
            "回避": 327,
            "材料": [
                [
                    4500008,
                    60
                ],
                [
                    4310079,
                    158
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                4500023,
                4500001,
                4500033
            ]
        },
        "等级42": {
            "四维": 675,
            "双攻": 90,
            "命中": 337,
            "回避": 337,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    195
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级43": {
            "四维": 695,
            "双攻": 93,
            "命中": 348,
            "回避": 348,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    235
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级44": {
            "四维": 716,
            "双攻": 95,
            "命中": 358,
            "回避": 358,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    274
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级45": {
            "四维": 736,
            "双攻": 98,
            "命中": 368,
            "回避": 368,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    311
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级46": {
            "四维": 757,
            "双攻": 101,
            "命中": 379,
            "回避": 379,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    351
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级47": {
            "四维": 778,
            "双攻": 104,
            "命中": 389,
            "回避": 389,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    391
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级48": {
            "四维": 798,
            "双攻": 106,
            "命中": 399,
            "回避": 399,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    429
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级49": {
            "四维": 819,
            "双攻": 109,
            "命中": 409,
            "回避": 409,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    528
                ],
                [
                    4000313,
                    85
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级50": {
            "四维": 840,
            "双攻": 112,
            "命中": 420,
            "回避": 420,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    209
                ],
                [
                    4000313,
                    84
                ],
                [
                    0,
                    5314683
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级51": {
            "四维": 865,
            "双攻": 115,
            "命中": 433,
            "回避": 433,
            "材料": [
                [
                    4500009,
                    80
                ],
                [
                    4310079,
                    263
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                4500024,
                4500001,
                4500033
            ]
        },
        "等级52": {
            "四维": 891,
            "双攻": 119,
            "命中": 446,
            "回避": 446,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    325
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级53": {
            "四维": 917,
            "双攻": 122,
            "命中": 458,
            "回避": 458,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    392
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级54": {
            "四维": 943,
            "双攻": 126,
            "命中": 471,
            "回避": 471,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    457
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级55": {
            "四维": 969,
            "双攻": 129,
            "命中": 484,
            "回避": 484,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    518
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级56": {
            "四维": 994,
            "双攻": 133,
            "命中": 497,
            "回避": 497,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    585
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级57": {
            "四维": 1020,
            "双攻": 136,
            "命中": 510,
            "回避": 510,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    652
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级58": {
            "四维": 1046,
            "双攻": 139,
            "命中": 523,
            "回避": 523,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    715
                ],
                [
                    4000313,
                    119
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级59": {
            "四维": 1072,
            "双攻": 143,
            "命中": 536,
            "回避": 536,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    880
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794869
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级60": {
            "四维": 1098,
            "双攻": 146,
            "命中": 549,
            "回避": 549,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    348
                ],
                [
                    4000313,
                    118
                ],
                [
                    0,
                    7794868
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级61": {
            "四维": 1122,
            "双攻": 150,
            "命中": 561,
            "回避": 561,
            "材料": [
                [
                    4500010,
                    80
                ],
                [
                    4310079,
                    329
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                4500025,
                4500001,
                4500033
            ]
        },
        "等级62": {
            "四维": 1146,
            "双攻": 153,
            "命中": 573,
            "回避": 573,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    406
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级63": {
            "四维": 1171,
            "双攻": 156,
            "命中": 585,
            "回避": 585,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    490
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级64": {
            "四维": 1195,
            "双攻": 159,
            "命中": 598,
            "回避": 598,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    571
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级65": {
            "四维": 1220,
            "双攻": 163,
            "命中": 610,
            "回避": 610,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    648
                ],
                [
                    4000313,
                    125
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级66": {
            "四维": 1244,
            "双攻": 166,
            "命中": 622,
            "回避": 622,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    731
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级67": {
            "四维": 1268,
            "双攻": 169,
            "命中": 634,
            "回避": 634,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    815
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574356
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级68": {
            "四维": 1293,
            "双攻": 172,
            "命中": 646,
            "回避": 646,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    894
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级69": {
            "四维": 1317,
            "双攻": 176,
            "命中": 659,
            "回避": 659,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1100
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级70": {
            "四维": 1342,
            "双攻": 179,
            "命中": 671,
            "回避": 671,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    435
                ],
                [
                    4000313,
                    124
                ],
                [
                    0,
                    8574355
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级71": {
            "四维": 1365,
            "双攻": 182,
            "命中": 682,
            "回避": 682,
            "材料": [
                [
                    4500011,
                    80
                ],
                [
                    4310079,
                    411
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                4500026,
                4500001,
                4500033
            ]
        },
        "等级72": {
            "四维": 1388,
            "双攻": 185,
            "命中": 694,
            "回避": 694,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    508
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级73": {
            "四维": 1411,
            "双攻": 188,
            "命中": 706,
            "回避": 706,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    613
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级74": {
            "四维": 1435,
            "双攻": 191,
            "命中": 717,
            "回避": 717,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    714
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级75": {
            "四维": 1458,
            "双攻": 194,
            "命中": 729,
            "回避": 729,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    810
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级76": {
            "四维": 1481,
            "双攻": 198,
            "命中": 741,
            "回避": 741,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    914
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级77": {
            "四维": 1505,
            "双攻": 201,
            "命中": 752,
            "回避": 752,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1019
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级78": {
            "四维": 1528,
            "双攻": 204,
            "命中": 764,
            "回避": 764,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1118
                ],
                [
                    4000313,
                    131
                ],
                [
                    0,
                    9431790
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级79": {
            "四维": 1551,
            "双攻": 207,
            "命中": 776,
            "回避": 776,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1375
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级80": {
            "四维": 1575,
            "双攻": 210,
            "命中": 787,
            "回避": 787,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    544
                ],
                [
                    4000313,
                    130
                ],
                [
                    0,
                    9431791
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级81": {
            "四维": 1603,
            "双攻": 214,
            "命中": 801,
            "回避": 801,
            "材料": [
                [
                    4500012,
                    100
                ],
                [
                    4310079,
                    617
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                4500027,
                4500001,
                4500033
            ]
        },
        "等级82": {
            "四维": 1631,
            "双攻": 217,
            "命中": 815,
            "回避": 815,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    762
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级83": {
            "四维": 1659,
            "双攻": 221,
            "命中": 829,
            "回避": 829,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    920
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级84": {
            "四维": 1687,
            "双攻": 225,
            "命中": 843,
            "回避": 843,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1071
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级85": {
            "四维": 1715,
            "双攻": 229,
            "命中": 857,
            "回避": 857,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1215
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级86": {
            "四维": 1743,
            "双攻": 232,
            "命中": 871,
            "回避": 871,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1371
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级87": {
            "四维": 1771,
            "双攻": 236,
            "命中": 885,
            "回避": 885,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1529
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级88": {
            "四维": 1799,
            "双攻": 240,
            "命中": 899,
            "回避": 899,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1677
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级89": {
            "四维": 1827,
            "双攻": 244,
            "命中": 913,
            "回避": 913,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2063
                ],
                [
                    4000313,
                    172
                ],
                [
                    0,
                    12968713
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级90": {
            "四维": 1855,
            "双攻": 247,
            "命中": 927,
            "回避": 927,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    816
                ],
                [
                    4000313,
                    171
                ],
                [
                    0,
                    12968712
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级91": {
            "四维": 1882,
            "双攻": 251,
            "命中": 941,
            "回避": 941,
            "材料": [
                [
                    4500013,
                    100
                ],
                [
                    4310079,
                    771
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                4500028,
                4500001,
                4500033
            ]
        },
        "等级92": {
            "四维": 1909,
            "双攻": 255,
            "命中": 954,
            "回避": 954,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    953
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级93": {
            "四维": 1936,
            "双攻": 258,
            "命中": 968,
            "回避": 968,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1150
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级94": {
            "四维": 1963,
            "双攻": 262,
            "命中": 981,
            "回避": 981,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1339
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级95": {
            "四维": 1990,
            "双攻": 265,
            "命中": 995,
            "回避": 995,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1519
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级96": {
            "四维": 2017,
            "双攻": 269,
            "命中": 1008,
            "回避": 1008,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1714
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级97": {
            "四维": 2044,
            "双攻": 273,
            "命中": 1022,
            "回避": 1022,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1911
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级98": {
            "四维": 2071,
            "双攻": 276,
            "命中": 1036,
            "回避": 1036,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2096
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级99": {
            "四维": 2098,
            "双攻": 280,
            "命中": 1049,
            "回避": 1049,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2579
                ],
                [
                    4000313,
                    180
                ],
                [
                    0,
                    14265584
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级100": {
            "四维": 2126,
            "双攻": 283,
            "命中": 1063,
            "回避": 1063,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1020
                ],
                [
                    4000313,
                    179
                ],
                [
                    0,
                    14265583
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级101": {
            "四维": 2152,
            "双攻": 287,
            "命中": 1076,
            "回避": 1076,
            "材料": [
                [
                    4500014,
                    100
                ],
                [
                    4310079,
                    964
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                4500029,
                4500001,
                4500033
            ]
        },
        "等级102": {
            "四维": 2178,
            "双攻": 290,
            "命中": 1089,
            "回避": 1089,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1191
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级103": {
            "四维": 2204,
            "双攻": 294,
            "命中": 1102,
            "回避": 1102,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1438
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级104": {
            "四维": 2231,
            "双攻": 297,
            "命中": 1115,
            "回避": 1115,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1674
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级105": {
            "四维": 2257,
            "双攻": 301,
            "命中": 1128,
            "回避": 1128,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1899
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级106": {
            "四维": 2283,
            "双攻": 304,
            "命中": 1142,
            "回避": 1142,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2143
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级107": {
            "四维": 2310,
            "双攻": 308,
            "命中": 1155,
            "回避": 1155,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2389
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692141
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级108": {
            "四维": 2336,
            "双攻": 311,
            "命中": 1168,
            "回避": 1168,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2620
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级109": {
            "四维": 2362,
            "双攻": 315,
            "命中": 1181,
            "回避": 1181,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3224
                ],
                [
                    4000313,
                    188
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级110": {
            "四维": 2389,
            "双攻": 319,
            "命中": 1194,
            "回避": 1194,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1275
                ],
                [
                    4000313,
                    189
                ],
                [
                    0,
                    15692142
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级111": {
            "四维": 2420,
            "双攻": 323,
            "命中": 1210,
            "回避": 1210,
            "材料": [
                [
                    4500015,
                    120
                ],
                [
                    4310079,
                    1446
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                4500030,
                4500001,
                4500033
            ]
        },
        "等级112": {
            "四维": 2451,
            "双攻": 327,
            "命中": 1225,
            "回避": 1225,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1787
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级113": {
            "四维": 2481,
            "双攻": 331,
            "命中": 1241,
            "回避": 1241,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2157
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级114": {
            "四维": 2512,
            "双攻": 335,
            "命中": 1256,
            "回避": 1256,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2511
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级115": {
            "四维": 2543,
            "双攻": 339,
            "命中": 1272,
            "回避": 1272,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2849
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级116": {
            "四维": 2574,
            "双攻": 343,
            "命中": 1287,
            "回避": 1287,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3215
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级117": {
            "四维": 2605,
            "双攻": 347,
            "命中": 1302,
            "回避": 1302,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3584
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级118": {
            "四维": 2636,
            "双攻": 351,
            "命中": 1318,
            "回避": 1318,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3930
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级119": {
            "四维": 2667,
            "双攻": 356,
            "命中": 1333,
            "回避": 1333,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    4836
                ],
                [
                    4000313,
                    237
                ],
                [
                    0,
                    20713628
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级120": {
            "四维": 2698,
            "双攻": 360,
            "命中": 1349,
            "回避": 1349,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    1913
                ],
                [
                    4000313,
                    238
                ],
                [
                    0,
                    20713627
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级121": {
            "四维": 2728,
            "双攻": 364,
            "命中": 1364,
            "回避": 1364,
            "材料": [
                [
                    4500016,
                    120
                ],
                [
                    4310079,
                    1808
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                4500031,
                4500001,
                4500033
            ]
        },
        "等级122": {
            "四维": 2758,
            "双攻": 368,
            "命中": 1379,
            "回避": 1379,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2234
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级123": {
            "四维": 2788,
            "双攻": 372,
            "命中": 1394,
            "回避": 1394,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2696
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级124": {
            "四维": 2819,
            "双攻": 376,
            "命中": 1409,
            "回避": 1409,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3139
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级125": {
            "四维": 2849,
            "双攻": 380,
            "命中": 1424,
            "回避": 1424,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    3561
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级126": {
            "四维": 2879,
            "双攻": 384,
            "命中": 1440,
            "回避": 1440,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    4019
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级127": {
            "四维": 2909,
            "双攻": 388,
            "命中": 1455,
            "回避": 1455,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    4480
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级128": {
            "四维": 2940,
            "双攻": 392,
            "命中": 1470,
            "回避": 1470,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    4913
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级129": {
            "四维": 2970,
            "双攻": 396,
            "命中": 1485,
            "回避": 1485,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    6045
                ],
                [
                    4000313,
                    249
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        },
        "等级130": {
            "四维": 3000,
            "双攻": 400,
            "命中": 1500,
            "回避": 1500,
            "材料": [
                [
                    null,
                    0
                ],
                [
                    4310079,
                    2391
                ],
                [
                    4000313,
                    250
                ],
                [
                    0,
                    22784990
                ]
            ],
            "绑定材料": [
                null,
                4500001,
                4500033
            ]
        }
    }
};
var sels;
var status = -1;
var 当前星级 = -1;
var 小黄星 = "#fItem/Etc/0427/04270001/Icon9/0#";

function start() {

    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (cm.getInventory(1).getItem(1) == null) {
        cm.sendOk("装备栏第一格没有装备");
        cm.dispose();
        return;
    }
    强化物品 = cm.getInventory(1).getItem(1).getItemId();
    if (!进阶数据[强化物品]) {
        cm.sendOk("请把要强化放在装备栏第一格");
        cm.dispose();
        return;
    }
    var itemaa = cm.getInventory(1).getItem(1).copy();
    // 强化物品ivid = itemaa.getInventoryId();
    // // 获取当前等级

    var currentLevel = "等级1";
    if (itemaa.getOwner() != null && itemaa.getOwner() != "") {
        currentLevel = itemaa.getOwner();
    }
    // 获取当前等级数字
    当前星级 = parseInt(currentLevel.replace("等级", ""));
    if (当前星级 < 1 || 当前星级 > 130) {
        cm.sendOk("未知错误00001，请联系管理员。");
        cm.dispose();
        return;
    }
    下一星级 = 当前星级 + 1;
    当前等级 = "等级" + 当前星级;
    下一等级 = "等级" + (当前星级 + 1);
    // cm.sendOk(下一星级+下一等级);
    // cm.dispose();
    // return;
    // // 检查是否达到最高等级
    if (当前星级 >= 130) {
        cm.sendOk("该装备已到达最高等级，无法继续升级。");
        cm.dispose();
        return;
    }


    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {

        var text = "";
        text += "#k┏━━" + 小黄星 + "━━━┫ 欢迎来到冒险岛 ┣━━━" + 小黄星 + "━━┓#k\r\n\r\n";
        text += "  " + 感叹号 + "[#v" + 强化物品 + "#][#t" + 强化物品 + "#]#b(最多Lv" + 最高等级 + ")#k#n\r\n";
        text += "  " + 感叹号 + "当前强化是 #b#e" + 当前等级 + "#k#n 强化至 #b#e" + 下一等级 + "#k#n\r\n";
        text += "  " + 感叹号 + "强化后属性：";
        text += 进阶数据[强化物品][下一等级]["hpmp"] ? "[#rhpmp+" + 进阶数据[强化物品][下一等级]["hpmp"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["四维"] ? "[#r四维+" + 进阶数据[强化物品][下一等级]["四维"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双攻"] ? "[#r攻魔+" + 进阶数据[强化物品][下一等级]["双攻"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["双防"] ? "[#r双防+" + 进阶数据[强化物品][下一等级]["双防"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["速度"] ? "[#r速度+" + 进阶数据[强化物品][下一等级]["速度"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["跳跃"] ? "[#r跳跃+" + 进阶数据[强化物品][下一等级]["跳跃"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["命中"] ? "[#r命中+" + 进阶数据[强化物品][下一等级]["命中"] + "]" : "";
        text += 进阶数据[强化物品][下一等级]["回避"] ? "[#r回避+" + 进阶数据[强化物品][下一等级]["回避"] + "]" : "";


        text += "#b#k\r\n";
        text += "  " + 感叹号 + "进行强化的放到 [装备栏] 第#r#e1#k#n格#b#k\r\n";
        text += "  " + 感叹号 + "进行强化需要以下材料：#k\r\n";
        text += "  #b#e----------------------------------------#n#k\r\n";
        // cm.sendOk(强化物品 + "," + 当前星级);
        // cm.dispose();
        // return;

        var 进阶需要材料 = 进阶数据[强化物品][下一等级]["材料"];
        var 进阶需要绑定材料 = 进阶数据[强化物品][下一等级]["绑定材料"];
        var 材料齐全 = true;
        for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
            var 背包绑定物品数量 = 0;
            var 需要物品数量 = 进阶需要材料[i][1];
            var 需要物品id = 进阶需要材料[i][0];
            var 绑定物品id = -1;
            if (进阶需要绑定材料[i]) {
                绑定物品id = 进阶需要绑定材料[i];
                背包绑定物品数量 = cm.itemQuantity(绑定物品id);
            }
            var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
            if (需要物品id > 0) {
                if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                    材料齐全 = false;
                    cm.setBossLog("需要物品id", 需要物品id, true);
                }
                text += "   " + 圆形 + "需要#v" + 需要物品id + "# #k[#r " + 需要物品数量 + " #k/ " + (背包绑定物品数量 + 背包非绑定物品数量) + " ] " + ((背包绑定物品数量 + 背包非绑定物品数量) >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d优先扣除绑定材料#k#n\r\n"
            } else if (需要物品id == 0) {
                if (cm.getPlayer().getMeso() < 需要物品数量) {
                    材料齐全 = false;
                }
                text += "   " + 圆形 + "需要#v2140002# #k[#r " + 需要物品数量 + " #k/ " + cm.getPlayer().getMeso() + " ] " + (cm.getPlayer().getMeso() >= 需要物品数量 ? "" + 关 + "#g#e满足#k#n" : "" + 开 + "#r#e不足#k#n") + "#d#k#n\r\n"
            }
        }
        text += "  #b#e----------------------------------------#n#k\r\n"
        if (材料齐全) {
            text += "  #L1#" + zzz + "#b开始强化#l";
        } else {
            text += "   #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        }
        //text += "  #L1#" + zzz + "#b开始强化#l      #L2#" + aaa + "#r获取所需材料#l#n#k\r\n"
        cm.sendSimple(text);
    } else if (status == 1) {
        sels = selection;
        if (selection == 1) {
            cm.sendSimple("#b是否要强化#r#r #i" + 强化物品 + "#? \r\n");
        } else if (selection == 2) {
            if (sels == 2) {
                // cm.sendOk(cm.getBossLog("需要物品id") + "获取材料");
                // cm.dispose();
                // return;
                var 需要物品id = cm.getBossLog("需要物品id");
                // cm.sendSimple(需要物品id);
                if (需要物品id == 4500033 || 需要物品id == 4000313) {
                    cm.dispose();
                    cm.openNpc(9130000, "黄金枫叶礼包");
                    return;
                }
                if (需要物品id == 4001084 ||
                    需要物品id == 4001085 ||
                    需要物品id == 4500006 ||
                    需要物品id == 4500007 ||
                    需要物品id == 4500008 ||
                    需要物品id == 4500009 ||
                    需要物品id == 4500010 ||
                    需要物品id == 4500011 ||
                    需要物品id == 4500012 ||
                    需要物品id == 4500013 ||
                    需要物品id == 4500014 ||
                    需要物品id == 4500015 ||
                    需要物品id == 4500016) {
                    cm.dispose();
                    cm.openNpc(9130000, "BOSS材料礼包");
                }
                if (需要物品id == 4310079 || 需要物品id == 4500001) {
                    cm.dispose();
                    cm.openNpc(9130000, "获取材料1");
                    return;
                }
            }
        }

    } else if (status == 2) {
        if (当前星级 >= 最高等级) {
            var itemab = cm.getInventory(1).getItem(1).copy();
            if (itemab.getMatk() != 16 || !下一阶id || 进阶数据[下一阶id]) {
                cm.sendOk("此装备无法进阶");
                cm.dispose();
                return;
            }
            if (!deleteitem(下一阶id, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (!cm.removeFromSlot(1, 1, 1, 强化物品)) {
                cm.sendOk("进阶异常，请重试！！");
                cm.dispose();
                return;
            }
            var equip = cm.getEquip(强化物品);
            // equip.setStr(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setDex(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setInt(进阶数据[强化物品][下一等级]["四维"]);
            // equip.setLuk(进阶数据[强化物品][下一等级]["四维"]);
            equip.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
            equip.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
            equip.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
            equip.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
            equip.setAcc(进阶数据[强化物品][下一等级]["命中"]);
            equip.setOwner(下一等级);
            cm.addFromDrop(equip, true);
            cm.dispose();
            return;

        } else {
            if (!deleteitem(强化物品, 下一等级)) {
                cm.sendOk("材料不足");
                cm.dispose();
                return;
            }
            if (cm.随机数(100) <= 成功率) {
                var statup = new java.util.ArrayList();
                var item = cm.getInventory(1).getItem(1).copy();
                // item.setStr(进阶数据[强化物品][下一等级]["四维"]);
                // item.setDex(进阶数据[强化物品][下一等级]["四维"]);
                // item.setInt(进阶数据[强化物品][下一等级]["四维"]);
                // item.setLuk(进阶数据[强化物品][下一等级]["四维"]);
                item.setHp(进阶数据[强化物品][下一等级]["hpmp"]);
                item.setMp(进阶数据[强化物品][下一等级]["hpmp"]);
                item.setWatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setMatk(进阶数据[强化物品][下一等级]["双攻"]);
                item.setAvoid(进阶数据[强化物品][下一等级]["回避"]);
                item.setAcc(进阶数据[强化物品][下一等级]["命中"]);
                item.setOwner(下一等级);
                Packages.server.MapleInventoryManipulator.removeFromSlot(cm.getC(), Packages.client.inventory.MapleInventoryType.EQUIP, 1, 1, false);
                Packages.server.MapleInventoryManipulator.addFromDrop(cm.getC(), item, false);
                //cm.itemlaba("『戒指强化』", "玩家 [" + cm.getPlayer().getName() + "] 强化 "+等级规划[(当前星级+1)]+"成功", item, 15);
                cm.sendNext("强化成功");
                status = -1;

            } else {
                cm.sendNext("强化失败");
                status = -1;
            }
        }

    } else {
        //cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}





function deleteitem(新物品id, 新等级) {
    var 进阶需要材料 = 进阶数据[新物品id][新等级]["材料"];
    var 进阶需要绑定材料 = 进阶数据[新物品id][新等级]["绑定材料"];
    for (var i = 0; i < 进阶需要材料.length; i++) {//判定材料扣除材料
        var 背包绑定物品数量 = 0;
        var 需要物品数量 = 进阶需要材料[i][1];
        var 需要物品id = 进阶需要材料[i][0];
        var 绑定物品id = -1;
        if (进阶需要绑定材料[i]) {
            绑定物品id = 进阶需要绑定材料[i];
            背包绑定物品数量 = cm.itemQuantity(绑定物品id);
        }
        var 背包非绑定物品数量 = cm.itemQuantity(需要物品id);
        if (需要物品id > 0) {
            if (背包绑定物品数量 + 背包非绑定物品数量 < 需要物品数量) {
                return false;
            } else {
                if (背包绑定物品数量 >= 需要物品数量) {
                    cm.gainItem(绑定物品id, -需要物品数量);
                } else {
                    cm.gainItem(绑定物品id, -背包绑定物品数量);
                    cm.gainItem(需要物品id, 背包绑定物品数量 - 需要物品数量);
                }
            }
        } else if (需要物品id == 0) {
            if (cm.getPlayer().getMeso() < 需要物品数量) {
                return false;
            }
            cm.gainMeso(-需要物品数量);
        }
    }
    return true;
}